{
  "created_at": "Feb 26, 2026, 19:05 UTC",
  "keyword": "Accountability",
  "generated_synonyms": [
    "accountability",
    "responsibility",
    "answerability",
    "accountableness",
    "accounting",
    "account",
    "accounter",
    "accountancy",
    "accounting",
    "non-accountability"
  ],
  "num_total_paragraphs": 2,
  "num_matched": 2,
  "num_unmatched": 0,
  "keyBERT_config": {
    "embedding_model": "all-mpnet-base-v2",
    "ngram_range": [
      1,
      1
    ],
    "top_n_keywords_per_paragraph": 8,
    "search_kw_to_paragraph_similarity_threshold": 0.45,
    "search_kw_to_keywords_similarity_threshold": 0.65
  },
  "matched": [
    {
      "index": 0,
      "paragraph": "Accountability in Trustworthy Artificial Intelligence\nAccountability is a foundational principle of Trustworthy AI. In the context of artificial intelligence systems, accountability refers to the obligation of individuals, organizations, and institutions to tak responsibility for the outcomes produced by AI systems. Developers, deployers, and operators must remain accountable for the design choices, training data, deployment environments, and downstream impacts of their models. A core requirement of accountability is transparency. While transparency alone does not guarantee responsible outcomes, it enables stakeholders to audit systems and assign responsibility when harm occurs. Accountable AI systems should provide clear documentation of model objectives, data provenance, risk assessments, and evaluation procedures. Another essential dimension is traceability. AI systems must be designed in a way that allows decisions to be traced back to human oversight and documented processes. Without traceability, it becomes difficult to determine who is accountable when a system behaves unexpectedly or unfairly.",
      "keywords": [
        "ai",
        "accountability",
        "traceability",
        "accountable",
        "responsibility",
        "intelligence",
        "responsible",
        "provenance"
      ],
      "match_type": "exact",
      "matched_terms": [
        "accountability"
      ],
      "cosine_sim_score": null
    },
    {
      "index": 1,
      "paragraph": "Accountability in Trustworthy Artificial Intelligence\nIn policy discussions, accountability is closely linked to governance and regulatory compliance. Organizations deploying AI technologies are expected to establish internal governance mechanisms, including impact assessments and escalation procedures. These mechanisms ensure that decision-makers remain accountable for mitigating risks such as bias, discrimination, or violations of fundamental rights. Accountable AI also requires continuous monitoring. Systems should not be treated as static artifacts. Instead, they must be evaluated throughout their lifecycle t ensure ongoing compliance with ethical principles and legal standards. If an AI system produces harmful outcomes, responsible parties must provide remedies and corrective actions. Finally, accountability reinforces the principle of fairness. By holding actors accountable, societies ensure that AI systems support equitable treatment and uphold the principle of fairness in automated decision-making processes.",
      "keywords": [
        "ai",
        "accountability",
        "accountable",
        "governance",
        "ethical",
        "intelligence",
        "automated",
        "compliance"
      ],
      "match_type": "exact",
      "matched_terms": [
        "accountability"
      ],
      "cosine_sim_score": null
    }
  ],
  "unmatched": []
}