{
  "num_qualities": 1669,
  "qualities": [
    "IEEE Std 1522-2004 is a standard.",
    "IEEE Standards TM is a trademark.",
    "IEEE Trial-Use Standard for Testability and Diagnosability Characteristics and Metrics is a standard.",
    "The standard is sponsored by IEEE Standards Coordinating Committee 20.",
    "IEEE Standards Coordinating Committee 20 is a committee.",
    "IEEE Standards Coordinating Committee 20 is sponsored by the IEEE Standards Coordinating Committee 20 on Test and Diagnosis for Electronic Systems.",
    "The IEEE Standards Coordinating Committee 20 on Test and Diagnosis for Electronic Systems is a committee.",
    "The standard is published by IEEE Standards.",
    "The standard is published on 23 March 2005.",
    "The standard is printed by SH95278.",
    "The standard is published in PDF by SS95278.",
    "The standard is authorized by IEEE.",
    "The standard is licensed by IEEE.",
    "The standard is limited to use by Technische Universitat Kaiserslautern.",
    "The standard is downloaded from IEEE Xplore on 21 August 2024 at 11:55:44 UTC.",
    "Restrictions apply to the standard.",
    "The Institute of Electrical and Electronics Engineers is a company.",
    "The Institute of Electrical and Electronics Engineers is located at 3 Park Avenue, New York, NY 10016-5997, USA.",
    "The Institute of Electrical and Electronics Engineers is the copyright holder of this publication.",
    "The Institute of Electrical and Electronics Engineers has all rights reserved.",
    "This publication was published on 23 March 2005.",
    "This publication was printed in the United States of America.",
    "IEEE is a registered trademark in the U.S. Patent & Trademark Office.",
    "IEEE is owned by the Institute of Electrical and Electronics Engineers, Incorporated.",
    "The publication has an ISBN of 0-7381-4492-4.",
    "The publication has an ISBN of 0-7381-4493-2.",
    "No part of this publication may be reproduced without permission.",
    "The publisher requires prior written permission for reproduction.",
    "IEEE Std 1522 was developed in 2004.",
    "IEEE Std 1522 was sponsored by IEEE Standards Coordinating Committee 20.",
    "IEEE Std 1522 provides standard definitions of testability and diagnosability metrics and characteristics.",
    "IEEE Std 1522 builds on fundamental definitions derived from elements in formal information models.",
    "IEEE Std 1522 builds on definitions from IEEE Std 1232.",
    "IEEE Std 1522 is related to test and diagnosis in electronic systems.",
    "The ence model is a type of model.",
    "The enhanced diagnostic inference model is a type of model.",
    "The fault tree model is a type of model.",
    "Metrics are used.",
    "Testability is authorized.",
    "Licensed use is limited to Technische Universitat Kaiserslautern.",
    "The ence model was downloaded from IEEE Xplore.",
    "Restrictions apply to the ence model.",
    "IEEE Standards documents are developed within IEEE Societies.",
    "IEEE Standards documents are developed within the Standards Coordinating Committees of the IEEE Standards Association (IEEE-SA) Standards Board.",
    "The IEEE develops its standards through a consensus development process.",
    "The consensus development process is approved by the American National Standards Institute.",
    "The consensus development process brings together volunteers representing varied viewpoints and interests.",
    "The consensus development process achieves a final product.",
    "Volunteers are not necessarily members of the Institute.",
    "Volunteers serve without compensation.",
    "The IEEE administers the consensus development process.",
    "The IEEE establishes rules to promote fairness in the consensus development process.",
    "The IEEE does not independently evaluate the accuracy of IEEE Standards documents.",
    "The IEEE does not independently test the accuracy of IEEE Standards documents.",
    "The IEEE does not independently verify the accuracy of IEEE Standards documents.",
    "IEEE publishes standards.",
    "Use of IEEE standards is voluntary.",
    "IEEE disclaims liability for personal injury.",
    "IEEE disclaims liability for property damage.",
    "IEEE disclaims liability for other damage.",
    "IEEE disclaims liability for any damage.",
    "IEEE disclaims liability for special damage.",
    "IEEE disclaims liability for indirect damage.",
    "IEEE disclaims liability for consequential damage.",
    "IEEE disclaims liability for compensatory damage.",
    "IEEE does not warrant the accuracy of its standards.",
    "IEEE does not warrant the content of its standards.",
    "IEEE does not imply any warranty for its standards.",
    "IEEE does not imply a merchantability warranty for its standards.",
    "IEEE does not imply a fitness for purpose warranty for its standards.",
    "The use of the material contained herein is free from patent infringement.",
    "IEEE Standards documents are supplied AS IS.",
    "The existence of an IEEE Standard does not imply that there are no other ways to produce goods and services related to the IEEE Standard.",
    "The existence of an IEEE Standard does not imply that there are no other ways to test goods and services related to the IEEE Standard.",
    "The existence of an IEEE Standard does not imply that there are no other ways to measure goods and services related to the IEEE Standard.",
    "The existence of an IEEE Standard does not imply that there are no other ways to purchase goods and services related to the IEEE Standard.",
    "The existence of an IEEE Standard does not imply that there are no other ways to market goods and services related to the IEEE Standard.",
    "The existence of an IEEE Standard does not imply that there are no other ways to provide goods and services related to the IEEE Standard.",
    "The viewpoint expressed at the time a standard is approved and issued is subject to change.",
    "The viewpoint expressed at the time a standard is approved and issued is subject to change due to developments in the state of the art.",
    "The viewpoint expressed at the time a standard is approved and issued is subject to change due to comments received from users of the standard.",
    "Every IEEE Standard is reviewed at least every five years.",
    "A document is more than five years old.",
    "A document has not been reaffirmed.",
    "A document's contents do not wholly reflect the present state of the art.",
    "A document's contents are still of some value.",
    "Users should check to determine they have the latest edition of any IEEE Standard.",
    "The IEEE is not suggesting or rendering professional or other services for any person or entity.",
    "The IEEE is not rendering professional or other services on behalf of any person or entity.",
    "The IEEE is not undertaking to perform any duty owed by any other person or entity to another.",
    "Any person utilizing this document should rely upon the advice of a professional.",
    "IEEE is a professional organization.",
    "IEEE determines the exercise of reasonable care in any given circumstances.",
    "IEEE provides interpretations of standards.",
    "IEEE prepares responses to interpretations.",
    "IEEE ensures that interpretations have received concurrence of a balance of interests.",
    "IEEE Standards Coordinating Committees cannot provide an instant response to interpretation requests.",
    "IEEE Standards Coordinating Committees provide an instant response to interpretation requests only if the matter has previously received formal consideration.",
    "An individual presenting information on IEEE standards at lectures, symposia, seminars, or educational courses must make it clear that their views are personal.",
    "An individual presenting information on IEEE standards at lectures, symposia, seminars, or educational courses must make it clear that their views are not the formal position of IEEE.",
    "An individual presenting information on IEEE standards at lectures, symposia, seminars, or educational courses must make it clear that their views are not the formal explanation of IEEE.",
    "An individual presenting information on IEEE standards at lectures, symposia, seminars, or educational courses must make it clear that their views are not the formal interpretation of IEEE.",
    "Comments for revision of IEEE Standards are welcome from any interested party.",
    "Comments for revision of IEEE Standards are welcome regardless of membership affiliation.",
    "IEEE accepts suggestions for changes in documents.",
    "Suggestions for changes in documents should be in the form of a proposed change of text.",
    "Suggestions for changes in documents should include appropriate supporting comments.",
    "Comments on standards should be addressed to the Secretary, IEEE-SA Standards Board.",
    "Comments on standards should be addressed to 445 Hoes Lane, Piscataway, NJ 08855-1331, USA.",
    "Requests for interpretations should be addressed to the Secretary, IEEE-SA Standards Board.",
    "Requests for interpretations should be addressed to 445 Hoes Lane, Piscataway, NJ 08855-1331, USA.",
    "Authorization to photocopy portions of any individual standard is granted by the Institute of Electrical and Electronics Engineers, Inc.",
    "Authorization to photocopy portions of any individual standard requires payment of the appropriate fee to Copyright Clearance Center.",
    "Payment of licensing fee for photocopying should be arranged with Copyright Clearance Center, Customer Service.",
    "Payment of licensing fee for photocopying should be arranged with 222 Rosewood Drive.",
    "The address of the IEEE office is Danvers, MA 01923 USA.",
    "The phone number of the IEEE office is +1 978 750 8400.",
    "Permission to photocopy portions of any individual standard can be obtained through the Copyright Clearance Center.",
    "Implementation of this standard may require use of subject matter covered by patent rights.",
    "The IEEE does not take a position on the existence or validity of any patent rights in connection with this standard.",
    "The IEEE is not responsible for identifying patents for which a license may be required by an IEEE standard.",
    "The IEEE is not responsible for conducting inquiries into the patents required by an IEEE standard.",
    "IEEE Xplore restricts the download of patents.",
    "The download of patents from IEEE Xplore is limited to Technische Universitat Kaiserslautern.",
    "The download of patents from IEEE Xplore is restricted.",
    "The download of patents from IEEE Xplore is subject to restrictions.",
    "The download of patents from IEEE Xplore occurred on August 21, 2024.",
    "The download of patents from IEEE Xplore occurred at 11:55:44 UTC.",
    "IEEE holds the copyright in 2005.",
    "IEEE reserves all rights.",
    "This introduction is not part of IEEE Std 1522-2004.",
    "IEEE Std 1522-2004 is a trial-use standard.",
    "IEEE Std 1522-2004 is for testability and diagnosability characteristics and metrics.",
    "Systems became more complex over time.",
    "Systems became more costly over time.",
    "Systems became more difficult to diagnose over time.",
    "Systems became more difficult to repair over time.",
    "Initiatives were started to address system problems.",
    "The objective of one initiative was to make systems easier to test.",
    "The objective of one initiative was testability.",
    "Testability aims to make systems easier to test.",
    "This commercial standard must provide specific definitions.",
    "This commercial standard must provide unambiguous definitions.",
    "This commercial standard must provide definitions of criteria.",
    "This commercial standard must provide definitions of criteria for assessing system testability.",
    "IEEE initiated standardizing test initiatives.",
    "IEEE initiated standardizing test initiatives recently.",
    "The IEEE 1232TM AI-ESTATE series of standards provides the foundation for precise and unambiguous testability and diagnosability metrics.",
    "The objective of this standard is to provide notionally correct and inherently useful but mathematically precise definitions of testability measures.",
    "The definitions of testability measures provided by this standard are notionally correct.",
    "The definitions of testability measures provided by this standard are inherently useful.",
    "The definitions of testability measures provided by this standard are mathematically precise.",
    "The definitions of testability measures provided by this standard can be used to measure the testability characteristics of a system.",
    "The definitions of testability measures provided by this standard can be used to predict the testability of a system.",
    "The definitions of testability measures provided by this standard are not in conflict with intuitive and historical representations.",
    "Errata for this standard can be accessed at http://standards.ieee.org/reading/ieee/updates/errata/index.html.",
    "Users should check http://standards.ieee.org/reading/ieee/updates/errata/index.html periodically for errata.",
    "Current interpretations can be accessed at http://standards.ieee.org/reading/ieee/interp/index.html.",
    "Implementation of this standard may require use of subject matter covered by patent rights.",
    "No position is taken with respect to the existence of patent rights by publication of this standard.",
    "The IEEE is not responsible for identifying patents or patent applications.",
    "The IEEE is not responsible for conducting inquiries into the legal validity or scope of patents.",
    "Publication of this trial-use standard has been approved by the Institute of Electrical and Electronics Engineers.",
    "Trial-use standards are effective for 24 months.",
    "Comments for revision will be accepted for 18 months after publication.",
    "The revision should be directed to the Secretary, IEEE-SA Standards Board.",
    "The revision should be received no later than 23 March 2006.",
    "The trial-use standard shall be submitted to the IEEE-SA Standards Board for approval as a full-use standard after 24 months.",
    "The trial-use standard shall be revised as necessary.",
    "Mark Kaufman is the Co-chair of the Diagnostic & Maintenance Control subcommittee.",
    "Tim Wilmering is the Co-Chair of the Diagnostic & Maintenance Control subcommittee.",
    "Other persons contributed to this trial-use standard.",
    "The individual balloting committee voted on this trial-use standard.",
    "Balloters voted for approval, disapproval, or abstention.",
    "The IEEE-SA Standards Board approved this trial-use standard on 23 September 2004.",
    "Don Wright is the Chair of the IEEE-SA Standards Board.",
    "Steve M. Mills is the Vice Chair of the IEEE-SA Standards Board.",
    "Judith Gorman is the Secretary of the IEEE-SA Standards Board.",
    "Judith Gorman is a Member Emeritus of the IEEE-SA Standards Board.",
    "Steve M. Mills is the Vice Chair.",
    "Judith Gorman is the Secretary.",
    "Judith Gorman is a Member Emeritus.",
    "Satish K. Aggarwal is the NRC Representative.",
    "Richard DeBlasio is the DOE Representative.",
    "Alan Cookson is the NIST Representative.",
    "Don Messina is the IEEE Standards Project Editor.",
    "Sherif Abdelwahed is a nonvoting IEEE-SA Standards Board liaison.",
    "Guy Adam is a nonvoting IEEE-SA Standards Board liaison.",
    "Greg P. Bowman is a nonvoting IEEE-SA Standards Board liaison.",
    "Eric M. Bukata is a nonvoting IEEE-SA Standards Board liaison.",
    "Antonius Bunsen is a nonvoting IEEE-SA Standards Board liaison.",
    "Stephen J. Cmiel is a nonvoting IEEE-SA Standards Board liaison.",
    "Bernard Dathy is a nonvoting IEEE-SA Standards Board liaison.",
    "Bernd Dinklage is a nonvoting IEEE-SA Standards Board liaison.",
    "David B. Droste is a nonvoting IEEE-SA Standards Board liaison.",
    "William B. Frank is a nonvoting IEEE-SA Standards Board liaison.",
    "George E. Geathers is a nonvoting IEEE-SA Standards Board liaison.",
    "Sudipto Ghoshal is a nonvoting IEEE-SA Standards Board liaison.",
    "Gerald M. Goldemund is a nonvoting IEEE-SA Standards Board liaison.",
    "Chris C. Gorringe is a nonvoting IEEE-SA Standards Board liaison.",
    "Eric S. Gould is a nonvoting IEEE-SA Standards Board liaison.",
    "Michael E. Keller is a nonvoting IEEE-SA Standards Board liaison.",
    "Leslie A. Orlidge is a nonvoting IEEE-SA Standards Board liaison.",
    "Mukund U. Modi is a nonvoting IEEE-SA Standards Board liaison.",
    "N. Ramachandran is a nonvoting IEEE-SA Standards Board liaison.",
    "Mike L. Seavey is a nonvoting IEEE-SA Standards Board liaison.",
    "John W. Sheppard is a nonvoting IEEE-SA Standards Board liaison.",
    "Li Pi Su is a nonvoting IEEE-SA Standards Board liaison.",
    "William J. Taylor is a nonvoting IEEE-SA Standards Board liaison.",
    "Joerg H. Urban is a nonvoting IEEE-SA Standards Board liaison.",
    "J. Richard Weger is a nonvoting IEEE-SA Standards Board liaison.",
    "Li Pi Su is a person.",
    "William J. Taylor is a person.",
    "Joerg H. Urban is a person.",
    "J. Richard Weger is a person.",
    "Antony Bartolini is a person.",
    "Amanda Jane Giarla is a person.",
    "Martin Baur is a person.",
    "Tommy Cooper is a person.",
    "Em Delahostria is a person.",
    "Bernd Dinklage is a person.",
    "William Frank is a person.",
    "Eric Gould is a person.",
    "Randall Groves is a person.",
    "Ashley Hulme is a person.",
    "Mark Kaufman is a person.",
    "Adam Ley is a person.",
    "Gregory Luri is a person.",
    "Gary Michel is a person.",
    "Mukund Modi is a person.",
    "Charles Ngethe is a person.",
    "Paul Pillitteri is a person.",
    "Vikram Punj is a person.",
    "N. Ramachandran is a person.",
    "Klaus Rapf is a person.",
    "James Ruggieri is a person.",
    "John Sheppard is a person.",
    "James Smith is a person.",
    "Timothy Wilmering is a person.",
    "Chuck Adams is a person.",
    "H. Stephen Berger is a person.",
    "Mark D. Bowman is a person.",
    "Joseph A. Bruder is a person.",
    "Bob Davis is a person.",
    "Roberto de Marca Boisson is a person.",
    "Julian Forster is a person.",
    "Arnold M. Greenspan is a person.",
    "Mark S. Halpin is a person.",
    "Raymond Hapeman is a person.",
    "Richard J. Holleman is a person.",
    "Richard H. Hulett is a person.",
    "Lowell G. Johnson is a person.",
    "Joseph L. Koepfinger is a person.",
    "Hermann Koch is a person.",
    "Thomas J. McGean is a person.",
    "Daleep C. Mohla is a person.",
    "Paul Nikolich is a person.",
    "Hermann Koch is a person.",
    "Thomas J. McGean is a person.",
    "Daleep C. Mohla is a person.",
    "Paul Nikolich is a person.",
    "T. W. Olsen is a person.",
    "Ronald C. Petersen is a person.",
    "Gary S. Robinson is a person.",
    "Frank Stone is a person.",
    "Malcolm V. Thaden is a person.",
    "Doug Topping is a person.",
    "Joe D. Watson is a person.",
    "The text is licensed by IEEE Xplore.",
    "The license has restrictions.",
    "The license is limited to Technische Universitat Kaiserslautern.",
    "The IEEE copyrighted the content in 2005.",
    "The IEEE reserved all rights.",
    "The contents are listed in the overview.",
    "The overview is located at the beginning of the contents.",
    "The contents start on page 1.",
    "The text contains references.",
    "The text contains definitions.",
    "The text contains context.",
    "The text is located on page 3.",
    "The text is located on page 2.",
    "{",
    "\"qualities\": []",
    "}",
    "{",
    "\"qualities\": []",
    "}",
    "The document has an informative annex A.",
    "The document has an informative annex B.",
    "The document has an informative annex C.",
    "Annex C is normative.",
    "The document is restricted to use by Technische Universitat Kaiserslautern.",
    "The document was downloaded on August 21, 2024.",
    "The document was downloaded at 11:55:44 UTC.",
    "The document was downloaded from IEEE Xplore.",
    "The licensed use is limited to Technische Universitat Kaiserslautern.",
    "The document was downloaded on August 21, 2024.",
    "The document was downloaded at 11:55:44 UTC.",
    "The document was downloaded from IEEE Xplore.",
    "Restrictions apply to the document.",
    "IEEE developed the IEEE Trial-Use Standard for Testability and Diagnosability Characteristics and Metrics.",
    "The Diagnostic and Maintenance Control subcommittee of the IEEE Standards Coordinating Committee 20 developed the IEEE Trial-Use Standard for Testability and Diagnosability Characteristics and Metrics.",
    "The IEEE Trial-Use Standard for Testability and Diagnosability Characteristics and Metrics provides standard definitions of testability and diagnosability metrics and characteristics.",
    "The IEEE Trial-Use Standard for Testability and Diagnosability Characteristics and Metrics builds on fundamental definitions derived from IEEE Std 1232TM-2002.",
    "IEEE Std 1232TM-2002 defines elements related to test and diagnosis.",
    "This standard provides definitions of testability characteristics.",
    "This standard provides definitions of diagnosability characteristics.",
    "This standard provides definitions of testability metrics.",
    "This standard provides definitions of diagnosability metrics.",
    "These definitions are independent of specific test technologies.",
    "These definitions are independent of specific diagnosis technologies.",
    "These definitions are independent of specific system under test technologies.",
    "These definitions are used by procurement organizations.",
    "These definitions are used by support organizations.",
    "Lord Kelvin commented that measurement is necessary for understanding.",
    "Lord Kelvin commented that expression in numbers is necessary for understanding.",
    "Lord Kelvin commented that unmeasurable things cannot be expressed.",
    "Lord Kelvin stated that your knowledge is of a meager and unsatisfactory kind.",
    "Lord Kelvin stated that your knowledge may be the beginning of knowledge.",
    "You are scarcely in your thought advanced to the stage of a science.",
    "Different tools may measure something differently.",
    "The basis for the measurement may not be known or understood.",
    "It is neither knowledge nor science when different tools measure something differently and the basis for the measurement is not known or understood.",
    "The objective of this standard is to provide precise formal definitions of metrics.",
    "Metrics may be used to predict the testability of a system.",
    "Predictive metrics may be used iteratively during various phases of design and diagnostic development.",
    "Predictive metrics may be used to map the progress toward a project's testability goals.",
    "Metrics are derived from actual maintenance data.",
    "Metrics are used to determine testability.",
    "Testability is determined during factory testing.",
    "Testability is determined during field testing.",
    "A system undergoes factory testing.",
    "A system undergoes field testing.",
    "IEEE Std 1522-2004 is a trial-use standard.",
    "IEEE Std 1522-2004 is for testability and diagnosability metrics.",
    "Predictive testability and diagnosability metrics are defined based on IEEE Std 1232-2002.",
    "IEEE Std 1522-2004 provides its own information model for undefined entities.",
    "The information model is in the form of an AI-ESTATE extension.",
    "IEEE Std 1522-2004 does not impose implementation-specific requirements for computing metrics.",
    "Metrics not computed using the identified standard information are not required.",
    "models must be demonstrated to be mathematically equivalent to the definitions provided.",
    "metrics defined in this standard are based on the assumption that no more than a single independent fault exists at the time of diagnostics.",
    "multiple fault metrics are outside the scope of this standard.",
    "there is a lack of industry consensus on how to calculate multiple fault metrics.",
    "this standard defines technology-independent testability and diagnosability characteristics and metrics.",
    "this standard defines technology-independent testability and diagnosability characteristics and metrics based on relevant standard information models.",
    "this standard is based on standard AI-ESTATE information models.",
    "This standard provides consistent definitions of testability and diagnosability characteristics and metrics.",
    "This standard provides unambiguous definitions of testability and diagnosability characteristics and metrics.",
    "This standard provides a common basis for system testability and diagnosability assessment.",
    "The subclauses present specification formats using the EXPRESS language.",
    "Specifications in the EXPRESS language are given in the Courier type font.",
    "Specifications in the EXPRESS language include references to entity and attribute names in the supporting text.",
    "This standard uses the vocabulary and definitions of relevant IEEE standards.",
    "In case of conflict, this standard uses the vocabulary and definitions of relevant IEEE standards.",
    "Definitions are based on standards, except for quoted portions.",
    "Clause 3 has precedence.",
    "SCC20 documentation and standards have precedence.",
    "The Authoritative Dictionary of IEEE Standards Terms, seventh edition, has precedence.",
    "IEEE Std 1232-2002 has precedence over AI-ESTATE revisions.",
    "The current, approved version of IEEE Std 1232-2002 takes precedence.",
    "IEEE Std 1232-2002 is used in conjunction with AI-ESTATE.",
    "The EXPRESS Language Reference Manual is part of ISO 10303-11:1994.",
    "IEEE publications are available from the Institute of Electrical and Electronics Engineers, Inc.",
    "IEEE publications are available at http://standards.ieee.org/",
    "IEEE publications are available from 445 Hoes Lane, Piscataway, NJ 08854, USA.",
    "ISO publications are available from the ISO Central Secretariat.",
    "ISO publications are available at http://www.iso.ch/",
    "ISO publications are available from Case Postale 56, 1 rue de Varembé, CH-1211, Genève 20, Switzerland.",
    "ISO publications are also available in the United States from the Sales Department, American.",
    "The National Standards Institute is located at 25 West 43rd Street.",
    "The National Standards Institute is on the 4th floor.",
    "The National Standards Institute is in New York.",
    "The National Standards Institute is in the USA.",
    "The National Standards Institute's website is http://www.ansi.org/",
    "The National Standards Institute is authorized by a license.",
    "The license is limited to Technische Universitat Kaiserslautern.",
    "The National Standards Institute's content was downloaded from IEEE Xplore.",
    "The download occurred on August 21, 2024.",
    "The download occurred at 11:55:44 UTC.",
    "Restrictions apply to the National Standards Institute's content.",
    "The IEEE standard Std 1522-2004 describes its behavior under test.",
    "The behavior under test may or may not be measurable during actual system operation or maintenance.",
    "The behavior under test may or may not be measurable during actual system operation.",
    "The behavior under test may or may not be measurable during maintenance.",
    "The Authoritative Dictionary of IEEE Standards and Terms, Seventh edition, defines terms not defined in this clause.",
    "The Authoritative Dictionary of IEEE Standards and Terms, Seventh edition, should be referenced for terms not defined in this clause.",
    "Faults in a system can be localized.",
    "Fault localization can be done confidently.",
    "Fault localization can be done frequently.",
    "Fault localization can be done unambiguously.",
    "Fault isolation can be done when faults occur.",
    "Fault isolation can be optimized.",
    "Resources required for fault isolation can be optimized.",
    "Fault isolation can be measured during system operation.",
    "Fault isolation can be measured during system maintenance.",
    "Faults are isolated during system operation and maintenance.",
    "Fault isolation is performed efficiently.",
    "Systems became more complex over time.",
    "Systems became more costly over time.",
    "Systems became more difficult to diagnose over time.",
    "Systems became more difficult to repair over time.",
    "Initiatives were started to address system complexity.",
    "Initiatives were started to address system cost.",
    "Initiatives were started to address system diagnosis difficulty.",
    "Initiatives were started to address system repair difficulty.",
    "Test points were placed in the right locations.",
    "System design includes characteristics for easier testing.",
    "Testability is considered a design characteristic.",
    "MIL-STD-2165 defines testability as a design characteristic.",
    "Testability allows the status of an item to be determined.",
    "Testability allows the isolation of faults within an item to be performed in a timely manner.",
    "MIL-STD-2165 provides uniform procedures and methods for testability.",
    "MIL-STD-2165 controls planning, implementation, and verification of testability during system acquisition.",
    "MIL-STD-2165 provides useful guidance to government suppliers.",
    "There is no equivalent industry standard for testability.",
    "Developers have used it to guide their activities.",
    "It was not imposed as a requirement.",
    "The discipline of testability is made up of two related practices.",
    "Design for test (DFT) facilitates the testing process.",
    "Design for test (DFT) encourages good design practices.",
    "Design for test (DFT) evaluates diagnosability.",
    "The discipline of testability evaluates diagnosability.",
    "Formal definitions of testability have been unavailable.",
    "Unambiguous definitions of testability have been unavailable.",
    "Definitions of testability metrics have been unavailable.",
    "Definitions of testability characteristics have been unavailable.",
    "Formal definitions of diagnosability have been unavailable.",
    "Unambiguous definitions of diagnosability have been unavailable.",
    "Definitions of diagnosability metrics have been unavailable.",
    "Definitions of diagnosability characteristics have been unavailable.",
    "This standard addresses the issue of unavailable definitions of testability and diagnosability.",
    "This standard builds on the fundamental definitions in the information models of AI-ESTATE.",
    "This standard defines metrics related to fault detection and isolation.",
    "Fault detection metrics are represented as a ratio of detected or detectable faults to the full set of possible faults under consideration.",
    "The ratio of fault detection metrics is often called a fault universe.",
    "The ratio of fault detection metrics is weighted using the failure rates of the faults within the fault universe.",
    "The weighted ratio expresses the likelihood of a fault being detected.",
    "IEEE Std 1522-2004 is a trial-use standard.",
    "IEEE Std 1522-2004 is for testability and",
    "Fault isolation metrics are based on a ratio of the number of faults in ambiguity groups to the total number of faults that can be isolated for a given system.",
    "Fault isolation metrics are based on a ratio of the number of faults in ambiguity groups of a specified size or less to the total number of faults that can be isolated for a given system.",
    "Fault isolation metrics are weighted using failure rates.",
    "Fault isolation metrics express the likelihood of isolating a fault within an ambiguity group of a given size.",
    "Testability is concerned with fault detection and fault isolation.",
    "Testability is also concerned with other things.",
    "The test industry lacks consensus on predicting and measuring false indication.",
    "This standard defers specification of metrics for false indication until consensus is reached.",
    "False indication issues are complex.",
    "This standard distinguishes between predictive and empirical metrics.",
    "Predictive metrics include testability and diagnosability metrics derived from a static AI-ESTATE-compliant model.",
    "The model is the fault tree model, the diagnostic inference model, or the enhanced diagnostic inference model.",
    "The model is used to provide a quantitative evaluation of how well the system can be diagnosed.",
    "The metrics are calculated differently depending on whether the diagnostic model is developed in the form of a fault tree or test-to-diagnosis inference relationships.",
    "The diagnostic model is developed in the form of a fault tree or test-to-diagnosis inference relationships.",
    "The diagnostic model is the fault tree model, the diagnostic inference model, or the enhanced diagnostic inference model.",
    "The metrics are calculated differently depending on the diagnostic model.",
    "The metrics are empirical or are derived from collected maintenance data.",
    "The metrics are beyond the scope of this standard.",
    "Clause 5 provides several metrics.",
    "Fundamental measures are used in defining testability and diagnosability metrics.",
    "Functions are defined in 5.2 to aggregate basic elements from the AI-ESTATE models.",
    "Functions are defined in 5.3 to estimate cost of tests or probability of faults based on the cost model within AI-ESTATE.",
    "Functions are defined in 5.4 to assist in traversing the diagnostic models within AI-ESTATE.",
    "Fundamental measures under Clause 5 are defined using the AI-ESTATE information models.",
    "Multiple correct means can compute individual fundamental measures.",
    "The purpose of this standard is to provide semantically rigorous definitions.",
    "This standard does not dictate the method(s) of calculation.",
    "Detailed algorithms are not provided for these fundamental measures.",
    "Clause 6 uses fundamental measures from Clause 5.",
    "Clause 6 defines the standard metrics for testability.",
    "Clause 6 defines the standard metrics for diagnosability.",
    "IEEE Std 1232-2002 is an information exchange standard for test and diagnosis.",
    "IEEE Std 1232-2002 is an AI-ESTATE standard.",
    "IEEE Std 1232-2002 defines the architecture of an AI-ESTATE-conformant system.",
    "IEEE Std 1232-2002 defines the information models for knowledge exchange.",
    "IEEE Std 1232-2002 defines the information models for data exchange.",
    "IEEE Std 1232-2002 defines a set of standard software services.",
    "A diagnostic provides a set of standard software services.",
    "The AI-ESTATE standard provides formal definitions of information required for test and diagnosis.",
    "The AI-ESTATE standard provides formal definitions of information required for determining testability and diagnosability of a system.",
    "The AI-ESTATE standard is used as the basis for metrics defined within this standard.",
    "Clause 6 describes how to use fundamentals to develop metrics.",
    "Clause 6 defines requirements for conformance to standard testability and diagnosability characteristics and metrics.",
    "Conformance demands that all metrics be computed as specified in Clause 6.",
    "The failure rate was accounted for by extending the AI-ESTATE models.",
    "The failure rate was accounted for by using the EXTEND schema.",
    "The EXTEND schema is used in 5.3.1.",
    "Authorized licensed use is limited to Technische Universitat Kaiserslautern.",
    "The document was downloaded on August 21, 2024.",
    "The document was downloaded at 11:55:44 UTC.",
    "Restrictions apply to the document.",
    "IEEE Std 1522-2004 provides an extensibility mechanism.",
    "Extensions to IEEE Std 1522-2004 should be submitted to the D&MC Subcommittee.",
    "Proposed extensions to IEEE Std 1522-2004 are ranked in order of preference.",
    "Metrics derived from the fundamental measures of Clause 5 are preferred.",
    "Metrics derived from AI-ESTATE models are considered.",
    "Extensions to IEEE Std 1522-2004 are nonconformant.",
    "Metrics are derived from functions and measures based on the AI-ESTATE models.",
    "Metrics are derived from functions and measures based on AI-ESTATE-conformant extensions.",
    "Extensions cannot be used to redefine any metrics defined in this standard.",
    "The fundamental measures defined in this clause are categorized as aggregation measures.",
    "The fundamental measures defined in this clause are categorized as cost-related measures.",
    "The fundamental measures defined in this clause are categorized as measures to support detection and isolation metrics.",
    "The specific measures defined in this clause are listed in Table 1.",
    "The approach being taken to define standard, unambiguous testability metrics is based on something.",
    "The approach being taken to define standard, unambiguous diagnosability metrics is based on something.",
    "The assumption is that standard information models provide formal semantics for information of interest to the testability and diagnosability domain.",
    "The information models used to define the measures are drawn from the AI-ESTATE standard.",
    "The specific models used to define the measures include the AI-ESTATE common element model.",
    "The specific models used to define the measures include the fault tree model.",
    "The approach to specifying measures follows the conventions for defining services in AI-ESTATE.",
    "{\"qualities\": [\"All cost-related metrics are computed with respect to a single test or repair within the AI-ESTATE common element model.\", \"Cost-related metrics are computed with respect to a single test or repair.\", \"Cost-related metrics are computed within the AI-ESTATE common element model.\", \"Cost-related metrics are computed with respect to a single test.\", \"Cost-related metrics are computed with respect to a repair.\", \"All cost-related metrics are computed with respect to a single test.\", \"All cost-related metrics are computed with respect to a repair.\", \"Cost-related metrics are computed with respect to a single repair.\", \"All cost-related metrics are computed within the AI-ESTATE common element model.\", \"All cost-related metrics are computed with respect to a single test or repair within the AI-ESTATE common element model as qualified by specifically identified constraints and types.\", \"Isolation-related metrics are computed under the assumption that no more than a single, independent fault exists at the time of diagnostics.\", \"Isolation metrics are computed under the assumption that no more than a single, independent fault exists at the time of diagnostics.\", \"Isolation-related metrics are computed under the assumption that a single, independent fault exists at the time of diagnostics.\", \"Isolation metrics are computed under the assumption that a single, independent fault exists at the time of diagnostics.\", \"Isolation-related metrics are computed under the assumption that no more than a single fault exists at the time of diagnostics.\", \"Isolation metrics are computed under the assumption that no more than a single fault exists at the time of diagnostics.\", \"Isolation-related metrics are computed under the assumption that a single fault exists at the time of diagnostics.\", \"Isolation metrics are computed under the assumption that a single fault exists at the time of diagnostics.\", \"Isolation-related metrics are computed under the assumption that no more than an independent fault exists at the time of diagnostics.\", \"Isolation metrics are computed under the assumption that no more than an independent fault exists at the time of diagnostics.\", \"Isolation-related metrics are computed under the assumption that an independent fault exists at the time of diagnostics.\", \"Isolation metrics are computed under the assumption that an independent fault exists at the time of diagnostics.\", \"Isolation-related metrics are computed under the assumption that no more than a fault exists at the time of diagnostics.\", \"Isolation metrics are computed under the assumption that no more than a fault exists at the time of diagnostics.\", \"Isolation-related metrics are computed under the assumption that a fault exists at the time of diagnostics.\", \"Isolation metrics are computed under the assumption that a fault exists at the time of diagnostics.\", \"Isolation-related metrics are computed under the assumption that no more than an independent fault exists at the time of diagnostics as qualified by specifically identified constraints and types.\", \"Isolation metrics are computed under the assumption that no more than an independent fault exists at the time of diagnostics as qualified by specifically identified constraints and types.\", \"Isolation-related metrics are computed under the assumption that an independent fault exists at the time of diagnostics as qualified by specifically identified constraints and types.\", \"Isolation metrics are computed under the assumption that an independent fault exists at the time of diagnostics as qualified by specifically identified constraints and types.\", \"Isolation-related metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by specifically identified constraints and types.\", \"Isolation metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by specifically identified constraints and types.\", \"Isolation-related metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by specifically identified constraints and types.\", \"Isolation metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by specifically identified constraints and types.\", \"Isolation-related metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by specifically identified constraints.\", \"Isolation metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by specifically identified constraints.\", \"Isolation-related metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by types.\", \"Isolation metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by types.\", \"Isolation-related metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by constraints.\", \"Isolation metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by constraints.\", \"Isolation-related metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by specifically identified constraints.\", \"Isolation metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by specifically identified constraints.\", \"Isolation-related metrics are computed under the assumption that a fault exists at the time of diagnostics.\", \"Isolation metrics are computed under the assumption that a fault exists at the time of diagnostics.\", \"Isolation-related metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by types and constraints.\", \"Isolation metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by types and constraints.\", \"Isolation-related metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by types and constraints.\", \"Isolation metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by types and constraints.\", \"Isolation-related metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by constraints and types.\", \"Isolation metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by constraints and types.\", \"Isolation-related metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by constraints and types.\", \"Isolation metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by constraints and types.\", \"Isolation-related metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by specifically identified types and constraints.\", \"Isolation metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by specifically identified types and constraints.\", \"Isolation-related metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by specifically identified types and constraints.\", \"Isolation metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by specifically identified types and constraints.\", \"Isolation-related metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by types and specifically identified constraints.\", \"Isolation metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by types and specifically identified constraints.\", \"Isolation-related metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by types and specifically identified constraints.\", \"Isolation metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by types and specifically identified constraints.\", \"Isolation-related metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by specifically identified constraints and types.\", \"Isolation metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by specifically identified constraints and types.\", \"Isolation-related metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by specifically identified constraints and types.\", \"Isolation metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by specifically identified constraints and types.\", \"Isolation-related metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by constraints and specifically identified types.\", \"Isolation metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by constraints and specifically identified types.\", \"Isolation-related metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by constraints and specifically identified types.\", \"Isolation metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by constraints and specifically identified types.\", \"Isolation-related metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by specifically identified constraints and types.\", \"Isolation metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by specifically identified constraints and types.\", \"Isolation-related metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by specifically identified constraints and types.\", \"Isolation metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by specifically identified constraints and types.\", \"Isolation-related metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by types and specifically identified constraints.\", \"Isolation metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by types and specifically identified constraints.\", \"Isolation-related metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by types and specifically identified constraints.\", \"Isolation metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by types and specifically identified constraints.\", \"Isolation-related metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by specifically identified types and constraints.\", \"Isolation metrics are computed under the assumption that no more than a fault exists at the time of diagnostics as qualified by specifically identified types and constraints.\", \"Isolation-related metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by specifically identified types and constraints.\", \"Isolation metrics are computed under the assumption that a fault exists at the time of diagnostics as qualified by specifically identified types and constraints.\", \"Isolation-related metrics are computed",
    "The diagnostic model establishes detectability and isolatability differently.",
    "The diagnostic model is a fault tree model, a diagnostic inference model, or an enhanced diagnostic inference model.",
    "The diagnostic model is an AI-ESTATE model.",
    "The AI-ESTATE model defines a level entity.",
    "The level entity is the level of indenture for a hierarchical element.",
    "The level entity constrains diagnosis or analysis for testability and diagnosability assessment.",
    "The text is an authorized licensed use.",
    "The licensed use is limited to Technische Universitat Kaiserslautern.",
    "The text was downloaded from IEEE Xplore.",
    "The download occurred on August 21, 2024.",
    "The download occurred at 11:55:44 UTC.",
    "Restrictions apply to the text.",
    "IEEE published IEEE Std 1522-2004.",
    "IEEE Std 1522-2004 is a trial-use standard.",
    "IEEE Std 1522-2004 is for testability and",
    "IEEE Std 1522-2004 is copyrighted 2005 by IEEE.",
    "IEEE reserves all rights to IEEE Std 1522-2004.",
    "Table 1 in IEEE Std 1522-2004 defines fundamental measures.",
    "Table 1 in IEEE Std 1522-2004 defines aggregation functions.",
    "Table 1 in IEEE Std 1522-2004 defines action_set.",
    "Table 1 in IEEE Std 1522-2004 defines diagnosis_set.",
    "Table 1 in IEEE Std 1522-2004 defines failure_mode_set.",
    "Table 1 in IEEE Std 1522-2004 defines failure_set.",
    "Table 1 in IEEE Std 1522-2004 defines fault_set.",
    "Table 1 in IEEE Std 1522-2004 defines function_set.",
    "Table 1 in IEEE Std 1522-2004 defines repair_item_set.",
    "Table 1 in IEEE Std 1522-2004 defines repair_set.",
    "Table 1 in IEEE Std 1522-2004 defines resource_set.",
    "Table 1 in IEEE Std 1522-2004 defines cost functions.",
    "Table 1 in IEEE Std 1522-2004 defines probability_of_diagnosis.",
    "Table 1 in IEEE Std 1522-2004 defines probability_of_repair_item_set.",
    "Table 1 in IEEE Std 1522-2004 defines repair_context_non_time_cost.",
    "Table 1 in IEEE Std 1522-2004 defines repair_context_time_cost.",
    "Table 1 in IEEE Std 1522-2004 defines repair_level_non_time_cost.",
    "Table 1 in IEEE Std 1522-2004 defines repair_level_time_cost.",
    "Table 1 in IEEE Std 1522-2004 defines repair_non_time_cost.",
    "Table 1 in IEEE Std 1522-2004 defines repair_time_cost.",
    "Table 1 in IEEE Std 1522-2004 defines test_context_non_time_cost.",
    "Table 1 in IEEE Std 1522-2004 defines test_context_time_cost.",
    "Table 1 in IEEE Std 1522-2004 defines test_level_non_time_cost.",
    "Table 1 in IEEE Std 1522-2004 defines test_level_time_cost.",
    "Table 1 in IEEE Std 1522-2004 defines test_non_time_cost.",
    "Table 1 in IEEE Std 1522-2004 defines test_time_cost.",
    "Table 1 in IEEE Std 1522-2004 defines total_repair_non_time_cost.",
    "Table 1 in IEEE Std 1522-2004 defines total_repair_time_cost.",
    "Detection functions exist.",
    "Isolation functions exist.",
    "get_leaves is a function.",
    "get_signature is a function.",
    "get_ambig_group is a function.",
    "get_diag_ambig_group is a function.",
    "get_size_n_ambig_group is a function.",
    "get_size_n_diag_ambig_group is a function.",
    "convert_repair_to_diag_ambiguity is a function.",
    "convert_diag_to_repair_ambiguity is a function.",
    "repair_item_ambiguity is a function.",
    "diagnosis_ambiguity is a function.",
    "single_level_detection is a function.",
    "implicated_diagnosis_set is a function.",
    "detectable_failure_set is a function.",
    "detectable_fault_set is a function.",
    "isolatable_repair_item_set is a function.",
    "isolatable_diagnosis_set is a function.",
    "isolatable_failures_set is a function.",
    "isolatable_faults_set is a function.",
    "fault_ambig_set is a function.",
    "failure_ambig_set is a function.",
    "The text is licensed by IEEE.",
    "The license is authorized.",
    "The license is limited to Technische Universitat Kaiserslautern.",
    "The text was downloaded on August 21, 2024.",
    "The text was downloaded at 11:55:44 UTC.",
    "Restrictions apply to the text.",
    "IEEE defined Std 1522-2004.",
    "IEEE reserved all rights to Std 1522-2004.",
    "This subclause defines aggregation fundamentals.",
    "Aggregation fundamentals are used in complex metric definitions.",
    "Fundamental measures are based on the AI-ESTATE common element model.",
    "Fundamental measures are not tied to specific diagnostic models.",
    "Diagnostic models include FTM, DIM, and EDIM.",
    "AI-ESTATE defines an action as a specific test or repair.",
    "Actions are primary entities associated with costs.",
    "Costs are associated with actions.",
    "The diagnosis and repair process optimizes the sequence of actions to return a unit to service.",
    "The function action_set returns the set of all actions within a diagnostic model at a particular level.",
    "A diagnosis is defined as a lattice of diagnostic conclusions.",
    "A diagnosis typically consists of failures or faults.",
    "Diagnoses can be interconnected in a lattice to classify constituent units by function.",
    "The construct provides a generalized grouping of constituent units.",
    "The function diagnosis_set returns the set of all diagnoses within a diagnostic model at a particular level.",
    "A failure mode is defined by the information model to be a specific mode or means by which a unit or system can fail.",
    "A failure mode is associated with a diagnosis.",
    "A failure mode is associated with an item that has failed.",
    "The function failure_mode_set returns a set.",
    "Failure modes are associated with diagnoses within a diagnostic model.",
    "A level is determined by examining appropriate diagnoses.",
    "The function failure_mode_set takes a diagnostic model and a level as input.",
    "The function failure_mode_set returns a set of failure modes.",
    "Authorized licensed use is limited to Technische Universitat Kaiserslautern.",
    "IEEE Std 1522-2004 is a trial-use standard for testability.",
    "IEEE Std 1522-2004 is copyrighted by IEEE in 2005.",
    "IEEE reserves all rights to IEEE Std 1522-2004.",
    "Within AI-ESTATE, a failure is a manifestation of an anomaly within a system.",
    "A failure is an anomaly within a system according to the AI-ESTATE information model.",
    "A failure is defined by the AI-ESTATE information model.",
    "A failure is the failure of the system under test to perform some intended function when considering a functional model.",
    "The function failure_set returns the set of all failures within a diagnostic model at a particular level.",
    "Within AI-ESTATE, a fault is a physical cause of anomalous",
    "A fault corresponds to a physical breakdown in the system under test.",
    "A fault is a physical breakdown in the system under test.",
    "The function fault_set returns the set of all faults within a diagnostic model.",
    "The function fault_set returns the set of all faults within a diagnostic model at a particular level.",
    "The function fault_set returns a set of faults.",
    "The function fault_set returns a set of faults at a particular level.",
    "A function is any functional behavior represented within a system.",
    "A function provides a placeholder for functional information in the event the diagnostic or testability model is function-oriented.",
    "function_set returns the set of all functions within a diagnostic model at a particular level.",
    "function_set takes a diagnostic model and a level as input.",
    "function_set returns a set of functions.",
    "repair_item_set returns the set of all repair items within a diagnostic model at a particular level.",
    "repair_item_set takes a diagnostic model and a level as input.",
    "repair_item_set returns a set of repair items.",
    "A repair item is defined as some part of the system to be adjusted, calibrated, repaired, replaced, etc.",
    "A diagnosis leads the maintainer to the object of the maintenance action.",
    "The text is licensed by IEEE.",
    "The license is authorized.",
    "The license is limited to Technische Universitat Kaiserslautern.",
    "The text was downloaded on August 21, 2024.",
    "The text was downloaded at 11:55:44 UTC.",
    "The text was downloaded from IEEE Xplore.",
    "IEEE defined Std 1522-2004.",
    "IEEE reserved all rights.",
    "A repair is defined by the information model to be the process undertaken to return the unit to service.",
    "The function repair_set returns the set of all repairs within a diagnostic model at a particular level.",
    "The function repair_set takes two parameters: diagnostic_model and level.",
    "The function repair_set returns a set of repairs.",
    "A resource is defined within the information model to be something that any given action in the maintenance process is likely to require to perform that action.",
    "resource_set returns the set of all resources within a diagnostic model at a particular level.",
    "resource_set is a function.",
    "resource_set takes two parameters: mdl and lvl.",
    "mdl is a diagnostic model.",
    "lvl is a level.",
    "resource_set returns a set of resources.",
    "All fundamental measures are based on the AI-ESTATE common element model.",
    "Fundamental measures are not tied to specific diagnostic models.",
    "Specific diagnostic models include FTM, DIM, and EDIM.",
    "Costs are measurable quantities of time or resources.",
    "Costs can be measured in money or expendables.",
    "This standard applies the categories of cost types.",
    "The categories of cost types include time cost and non-time cost.",
    "The categories of cost types are specified in AI-ESTATE.",
    "Cost is computed over a set of tests or repairs.",
    "Cost is computed using associated test action costs.",
    "Cost is computed using repair action costs.",
    "Cost is computed using resource costs.",
    "All cost calculations use the same units of measure.",
    "All cost calculations are based on resource cost.",
    "No unit conversion is included in the definition.",
    "Measures are specified in AI-ESTATE.",
    "Measures are associated with a particular level and a particular required context.",
    "Measures are associated with a particular level but all contexts.",
    "Measures are associated with a particular required context but all levels.",
    "Measures are associated with no level and no required context.",
    "The context refers to the required set of conditions in AI-ESTATE.",
    "The text is authorized for use.",
    "The use is licensed.",
    "The license is limited to Technische Universitat Kaiserslautern.",
    "The text was downloaded from IEEE Xplore.",
    "The download occurred on August 21, 2024.",
    "The download occurred at 11:55:44 UTC.",
    "Restrictions apply to the use of the text.",
    "IEEE Std 1522-2004 is a trial-use standard for testability.",
    "IEEE Std 1522-2004 is copyrighted by IEEE in 2005.",
    "IEEE reserves all rights to IEEE Std 1522-2004.",
    "Within AI-ESTATE, a model structure captures failure rate information.",
    "The model structure captures failure rate information for a particular diagnosis.",
    "The model structure captures failure rate information in a diagnostic model.",
    "The entity specifies whether the failure rate is defined based on clock time.",
    "The entity specifies whether the failure rate is defined based on operating time.",
    "Clock time includes the time when the system is not in operation.",
    "Operating time does not include the time when the system is not in operation.",
    "The time basis attribute permits specification of a user-defined basis.",
    "The time basis attribute permits specification of a basis that is unknown.",
    "IEEE 1232-2002 lacks an attribute.",
    "The probability of diagnosis is required for calculating the probability of diagnosis.",
    "An extension to AI-ESTATE has been specified in Annex C to provide the required attribute.",
    "The function probability_of_diagnosis returns the conditional probability of a diagnosis given a specified set of diagnoses.",
    "The probability of diagnosis is typically calculated as the failure rate of the specified diagnosis divided by the sum of the failure rates of the diagnoses in the specified set.",
    "The probability of diagnosis can be derived from the underlying distribution (e.g., exponential or Weibull) at a specified point in time for the members of the set.",
    "The probability of diagnosis is computed by normalizing the probability derived from the underlying distribution.",
    "The measure is implemented over a specified set.",
    "The approach to calculating the measure must be specified.",
    "The probability of diagnosis is computed relative to a specified set of diagnoses.",
    "The diagnosis for which the probability is being calculated is a member of the specified diagnosis set.",
    "No diagnosis in the relative diagnosis set is a child of another diagnosis in the specified diagnosis set.",
    "The time basis is consistent for all members of the diagnosis set.",
    "The set of diagnoses does not mix faults and failures.",
    "The set of diagnoses does not mix faults and failures.",
    "The diagnoses in the specified set are probabilistically independent of one another.",
    "The probability of diagnosis is calculated using the extended diagnosis entity.",
    "The probability_of_diagnosis function takes a diagnosis, a set of diagnoses, and an optional time point and units as input.",
    "The probability_of_diagnosis function returns a real value.",
    "The measure probability_of_repair_item_set represents the probability that a set of repair items is diagnosed.",
    "The probability of a repair item is defined as the sum of the",
    "Probabilities of diagnosis are tied to repair items.",
    "The probability of a set of repair items is the sum of the probabilities of all diagnoses tied to the set of repair items.",
    "No diagnosis in a repair item is a child of another diagnosis in the same repair item.",
    "The time basis is consistent for all diagnoses in a repair item.",
    "A repair item does not mix faults and failures.",
    "The probability of a diagnosis is computed using the probability_of_diagnosis function.",
    "The diagnoses in the specified set are probabilistically independent of one another.",
    "The diagnoses in the specified set are probabilistically independent.",
    "The diagnoses in the specified set are independent of one another.",
    "IEEE published Std 1522-2004.",
    "IEEE reserved all rights to Std 1522-2004.",
    "The function probability_of_repair_item_set takes a set of repair items.",
    "The function probability_of_repair_item_set takes a set of EXTEND_diagnosis.",
    "The function probability_of_repair_item_set takes an optional time point.",
    "The function probability_of_repair_item_set takes an optional time unit.",
    "The function probability_of_repair_item_set returns a real value.",
    "The function repair_context_non_time_cost adds non-time costs of actions.",
    "The function repair_context_non_time_cost includes costs of required resources.",
    "The function repair_context_non_time_cost is limited to available resources and actions.",
    "The function repair_context_non_time_cost computes repair cost given a context.",
    "The function repair_context_non_time_cost computes repair cost given the specified context.",
    "The function repair_context_non_time_cost takes a set of repairs as input.",
    "The function repair_context_non_time_cost takes a required context as input.",
    "The function repair_context_non_time_cost takes a cost type as input.",
    "The function repair_context_non_time_cost returns a real value.",
    "The function repair_context_time_cost computes repair cost given the specified context.",
    "The function repair_context_time_cost takes a set of repairs as input.",
    "The function repair_context_time_cost takes a required context as input.",
    "The function repair_context_time_cost takes a cost type as input.",
    "The function repair_context_time_cost returns a real value.",
    "The function repair_context_time_cost adds the time cost of all actions associated with performing the indicated repair.",
    "The function repair_context_time_cost includes the costs of the actions' required resources.",
    "The function repair_context_time_cost is limited to the resources and actions available in the required context.",
    "The repair_level_non_time_cost function computes repair cost.",
    "The repair_level_non_time_cost function takes a set of repairs as input.",
    "The repair_level_non_time_cost function takes a level as input.",
    "The repair_level_non_time_cost function takes a cost type as input.",
    "The repair_level_non_time_cost function returns a real value.",
    "The repair_level_non_time_cost function adds non-time cost of all actions associated with performing the indicated repair.",
    "The repair_level_non_time_cost function includes costs of the actions' required resources.",
    "The repair_level_non_time_cost function is limited to resources and actions available at a particular level of indenture.",
    "The text is licensed by IEEE Xplore.",
    "The license is authorized.",
    "The license is limited to Technische Universitat Kaiserslautern.",
    "The text was downloaded on August 21, 2024.",
    "The text was downloaded at 11:55:44 UTC.",
    "Restrictions apply to the text.",
    "IEEE Std 1522-2004 is a trial-use standard for testability.",
    "IEEE Std 1522-2004 is a standard for the IEEE.",
    "The IEEE Std 1522-2004 standard is copyrighted by the IEEE.",
    "The IEEE reserves all rights to the IEEE Std 1522-2004 standard.",
    "The IEEE Std 1522-2004 standard includes a cost-related measure called repair_level_time_cost.",
    "The repair_level_time_cost measure adds the time cost of all actions associated with performing the indicated repair.",
    "The repair_level_time_cost measure includes the costs of the actions' required resources.",
    "The repair_level_time_cost measure is limited to the resources and actions available at a particular level of indenture.",
    "The repair_level_time_cost function computes repair cost given the specified level.",
    "The repair_level_time_cost function takes three parameters: rpr, lvl, and of_type.",
    "The rpr parameter is a set of repairs.",
    "The lvl parameter is a level.",
    "The of_type parameter is a cost type.",
    "The repair_level_time_cost function returns a real value.",
    "The repair_non_time_cost function adds the non-time cost of all actions.",
    "The non-time cost includes the costs of the actions' required resources.",
    "The repair_non_time_cost function is limited to the resources and actions available in the required context.",
    "The repair_non_time_cost function is limited to the resources and actions available at a particular level of indenture.",
    "The repair_non_time_cost function computes repair cost given the specified context.",
    "The repair_non_time_cost function computes repair cost given the specified level.",
    "The repair_non_time_cost function returns a real value.",
    "The repair cost function computes cost given a context and a level.",
    "The repair cost function computes cost given a specified context and a specified level.",
    "The repair cost function computes repair cost.",
    "The repair cost function is a function.",
    "The repair cost function takes a set of repairs as input.",
    "The repair cost function takes a required context as input.",
    "The repair cost function takes a level as input.",
    "The repair cost function takes a cost type as input.",
    "The repair cost function returns a real value.",
    "The non-time cost measure adds non-time cost of all actions.",
    "The non-time cost measure adds non-time cost of actions' required resources.",
    "The non-time cost measure is a cost-related measure.",
    "This function computes test cost given the specified context.",
    "This function is authorized for use by Technische Universitat Kaiserslautern.",
    "This function is licensed for use until August 21, 2024.",
    "This function is restricted by IEEE Xplore.",
    "IEEE published Std 1522-2004.",
    "IEEE reserved all rights in 2005.",
    "IEEE published a standard called Std 1522-2004.",
    "The standard Std 1522-2004 was published in 2005.",
    "IEEE defined a function called test_context_non_time_cost.",
    "The function test_context_non_time_cost takes three parameters: tst, cntxt, and of_type.",
    "The function test_context_non_time_cost returns a REAL value.",
    "The function test_context_time_cost adds time costs of actions.",
    "The function test_context_time_cost includes costs of required resources.",
    "The function test_context_time_cost is limited to available resources and actions.",
    "The function test_context_time_cost computes test cost given a context.",
    "IEEE defined a function called test_context_time_cost.",
    "The function test_level_non_time_cost computes test cost given a level.",
    "The function test_level_non_time_cost takes a set of tests as input.",
    "The function test_level_non_time_cost takes a level as input.",
    "The function test_level_non_time_cost takes a cost type as input.",
    "The function test_level_non_time_cost returns a real value.",
    "The function test_level_non_time_cost adds non-time cost of all actions associated with a test.",
    "The function test_level_non_time_cost includes costs of actions' required resources.",
    "The function test_level_non_time_cost is limited to resources and actions available at a particular level of indenture.",
    "The test_level_time_cost function adds the time cost of all actions.",
    "The test_level_time_cost function includes the costs of the actions' required resources.",
    "The test_level_time_cost function is limited to the resources and actions available at a particular level of indenture.",
    "The test_level_time_cost function computes test cost given the specified level.",
    "The test_level_time_cost function takes a set of tests as input.",
    "The test_level_time_cost function takes a level as input.",
    "The test_level_time_cost function takes a cost type as input.",
    "The test_level_time_cost function returns a real value.",
    "IEEE Std 1522-2004 is a trial-use standard.",
    "IEEE Std 1522-2004 is for testability and",
    "The cost-related measure test_non_time_cost adds non-time cost.",
    "The cost-related measure test_non_time_cost includes costs of required resources.",
    "The cost-related measure test_non_time_cost is limited to available resources and actions.",
    "The cost-related measure test_non_time_cost is limited to a particular level of indenture.",
    "The cost-related measure test_non_time_cost computes test cost given a context and a level.",
    "The cost-related measure test_non_time_cost computes test cost given a specified context and a specified level.",
    "The function test_non_time_cost returns a real value.",
    "test_time_cost is a function.",
    "test_time_cost computes test cost.",
    "test_time_cost takes a set of tests as input.",
    "test_time_cost takes a required context as input.",
    "test_time_cost takes a level as input.",
    "test_time_cost takes a cost type as input.",
    "test_time_cost returns a real value.",
    "test_time_cost is limited to the resources available in the context.",
    "test_time_cost is limited to the actions available in the context.",
    "test_time_cost is limited to the level of indenture.",
    "The total_repair_non_time_cost measure adds the non-time cost of all actions.",
    "The total_repair_non_time_cost measure includes the costs of the actions' required resources.",
    "The total_repair_non_time_cost measure includes the costs of the actions' required resources associated with performing the indicated repair.",
    "The total_repair_non_time_cost measure has no limits to the resources available.",
    "The total_repair_non_time_cost measure has no limits to the actions available.",
    "The total_repair_non_time_cost measure has no limits to the resources and actions available based on required level.",
    "The total_repair_non_time_cost measure has no limits to the resources and actions available based on context.",
    "The total_repair_time_cost measure adds the time cost of all actions.",
    "The total_repair_time_cost measure includes the costs of the actions' required resources.",
    "The total_repair_time_cost measure includes the costs of the actions' required resources associated with performing the indicated repair.",
    "The resources and actions are available based on the required level.",
    "The resources and actions are available based on the context.",
    "The total_repair_time_cost function takes a set of repairs as input.",
    "The total_repair_time_cost function takes a cost type as input.",
    "The total_repair_time_cost function returns a real value.",
    "The total_repair_time_cost function is defined in the given code snippet.",
    "The total_repair_time_cost function is an authorized licensed use.",
    "The total_repair_time_cost function is limited to the Technische Universitat Kaiserslautern.",
    "The total_repair_time_cost function was downloaded on August 21, 2024.",
    "The total_repair_time_cost function was downloaded at 11:55:44 UTC.",
    "The total_repair_time_cost function was downloaded from IEEE Xplore.",
    "Restrictions apply to the total_repair_time_cost function.",
    "IEEE published Std 1522-2004.",
    "IEEE reserved all rights in 2005.",
    "The cost-related measure total_test_non_time_cost adds non-time cost.",
    "The cost-related measure total_test_non_time_cost includes costs of required resources.",
    "The cost-related measure total_test_non_time_cost has no limits on resources and actions.",
    "The cost-related measure total_test_non_time_cost is associated with performing the indicated test.",
    "The cost-related measure total_test_time_cost adds time cost.",
    "The cost-related measure total_test_time_cost includes costs of actions.",
    "The cost-related measure total_test_time_cost includes costs of required resources.",
    "The actions' required resources have no limits.",
    "The actions' required resources are not based on the required level.",
    "The actions' required resources are not based on the context.",
    "The total test time cost is a function.",
    "The total test time cost function takes a set of tests as input.",
    "The total test time cost function takes a cost type as input.",
    "The total test time cost function returns a real value.",
    "The subclause defines each detection and isolation fundamental.",
    "Each detection and isolation fundamental is used in complex metric definitions.",
    "Each diagnostic model type is a subtype of the diagnostic_model entity.",
    "The diagnostic model types include FTM, DIM, and EDIM.",
    "The diagnostic model types are defined in the AI-ESTATE common element model.",
    "The model used for detectability and isolatability is of a specific type.",
    "The diagnostic models used to specify measures include an instance of the diagnosis entity corresponding to No Fault.",
    "The diagnosis entity corresponding to No Fault has the unique name 'no_fault'.",
    "The ability to define metrics based on detection and isolation within a diagnostic model requires identifying all diagnoses that are detectable or isolatable by the set of tests included in the model.",
    "The ability to define metrics in an unambiguous way requires that all metrics are defined in a specific way.",
    "Measures are computed based on a predefined universe of diagnoses.",
    "Measures are computed based on a predefined set of tests.",
    "Agreement and repeatability in determining detection or isolation measures cannot be ensured without a predefined universe of diagnoses and a predefined set of tests.",
    "Actual measures of isolation depend on the algorithms used to perform diagnosis.",
    "Actual measures of isolation also depend on the model used for diagnosis.",
    "The nature of the dependence of measures on the underlying diagnostic algorithm must be documented.",
    "Documentation of measures must be provided to users of the measures.",
    "Definition of fundamental measures, standard metrics, and extended metrics requires several items.",
    "Functions are defined in sections 5.4.1 through 5.4.20.",
    "Three derived types are defined to support these functions.",
    "Derived types represent ambiguity groups for diagnoses or repair items.",
    "Derived types represent test signatures.",
    "Derived type diagnosis_ambiguity is a set of diagnoses.",
    "Derived type repair_ambiguity is a set of repair items.",
    "IEEE Std 1522-2004 is a trial-use standard.",
    "IEEE Std 1522-2004 is for testability and type.",
    "The type signature is a set of test outcomes.",
    "The function get_leaves takes a step from a fault tree model.",
    "The function get_leaves returns a set of sets of diagnoses.",
    "The function get_leaves returns diagnosis ambiguity groups.",
    "The function get_leaves returns groups within a subtree.",
    "The function get_leaves returns groups at the leaves of a subtree.",
    "The function get_leaves returns groups within the corresponding subtree.",
    "The function get_signature takes a diagnosis.",
    "The function get_signature returns a set of test outcomes.",
    "The function get_signature identifies the specified diagnosis.",
    "The test signature for the diagnosis is a set of test outcomes.",
    "The function get_ambig_group takes a specific repair item as defined in 5.2.7.",
    "The function get_ambig_group returns a set of repair item ambiguity groups.",
    "The returned set includes the originally specified repair item.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "The function get_diag_ambig_group takes a specific diagnosis as defined in 5.2.2.",
    "The function get_diag_ambig_group returns a set of diagnosis ambiguity groups.",
    "The function get_diag_ambig_group includes the originally specified diagnosis in the returned set.",
    "The model specified must be a DIM.",
    "The model specified must be a FTM.",
    "The model specified must be an EDIM.",
    "The function get_diag_ambig_group takes a diagnostic model.",
    "The function get_diag_ambig_group takes a diagnosis.",
    "The function get_diag_ambig_group takes a level of indenture.",
    "The function get_diag_ambig_group returns a set of diagnosis ambiguity groups containing diagnoses that are ambiguous with it.",
    "The function get_diag_ambig_group returns a set of diagnosis ambiguity groups given a diagnostic model and level of indenture.",
    "The text is licensed by IEEE.",
    "The license is authorized.",
    "The license is restricted.",
    "The license applies to Technische Universitat Kaiserslautern.",
    "The text was downloaded on August 21, 2024.",
    "The text was downloaded at 11:55:44 UTC.",
    "The function get_size_n_ambig_group returns a set of repair item ambiguity groups.",
    "Each repair item ambiguity group contains exactly n repair items.",
    "The repair items are defined in 5.2.7.",
    "The function get_size_n_ambig_group requires a diagnostic model.",
    "The diagnostic model must be a DIM.",
    "The diagnostic model must be a FTM.",
    "The diagnostic model must be an EDIM.",
    "The function get_size_n_ambig_group requires a level of indenture.",
    "The function get_size_n_diag_ambig_group returns a set of diagnosis ambiguity groups.",
    "The function get_size_n_diag_ambig_group requires a diagnostic model.",
    "The function get_size_n_diag_ambig_group requires a level.",
    "The function get_size_n_diag_ambig_group requires an integer n.",
    "The function get_size_n_diag_ambig_group returns a set of diagnosis ambiguity.",
    "The function convert_repair_to_diag_ambiguity requires a diagnostic model.",
    "The function convert_repair_to_diag_ambiguity requires a level.",
    "The function convert_repair_to_diag_ambiguity requires a set of repair item ambiguity groups.",
    "The function convert_repair_to_diag_ambiguity returns a set of diagnosis ambiguity groups.",
    "A diagnostic model must be a DIM, a FTM, or an EDIM.",
    "Diagnosis and repair item are defined in 5.2.2 and 5.2.7, respectively.",
    "The function convert_repair_to_diag_ambiguity takes a diagnostic model.",
    "The function convert_repair_to_diag_ambiguity takes a level.",
    "The function convert_repair_to_diag_ambiguity takes a set of repair ambiguities.",
    "The function convert_repair_to_diag_ambiguity returns a set of diagnosis ambiguities.",
    "The function convert_diag_to_repair_ambiguity takes a diagnostic model.",
    "The function convert_diag_to_repair_ambiguity takes a level.",
    "The function convert_diag_to_repair_ambiguity takes a set of diagnosis ambiguities.",
    "The function convert_diag_to_repair_ambiguity returns a set of repair ambiguities.",
    "A diagnostic model must be a DIM, a FTM, or an EDIM.",
    "The text is licensed by IEEE.",
    "The license is authorized.",
    "The license is limited to Technische Universitat Kaiserslautern.",
    "The text was downloaded on August 21, 2024.",
    "The text was downloaded at 11:55:44 UTC.",
    "The text was downloaded from IEEE Xplore.",
    "Restrictions apply to the text.",
    "IEEE Std 1522-2004 is a trial-use standard.",
    "IEEE Std 1522-2004 is for testability.",
    "The predicate repair_item_ambiguity takes a diagnostic model as input.",
    "The predicate repair_item_ambiguity takes a target repair_item as input.",
    "The predicate repair_item_ambiguity takes a level of indenture as input.",
    "The predicate repair_item_ambiguity takes a group size n as input.",
    "The predicate repair_item_ambiguity returns TRUE if the repair item exists in a repair item ambiguity group of exactly size n.",
    "The predicate repair_item_ambiguity returns FALSE otherwise.",
    "The model specified must be a DIM.",
    "The model specified must be a FTM.",
    "The model specified must be an EDIM.",
    "The function diagnosis_ambiguity takes a diagnostic model as input.",
    "The function diagnosis_ambiguity takes a target diagnosis as input.",
    "The function diagnosis_ambiguity takes a level of indenture as input.",
    "The function diagnosis_ambiguity takes a group size n as input.",
    "The function diagnosis_ambiguity returns TRUE if the diagnosis exists in a diagnosis ambiguity group of exactly size n.",
    "The function diagnosis_ambiguity returns FALSE otherwise.",
    "The model specified for diagnosis_ambiguity must be a DIM.",
    "The model specified for diagnosis_ambiguity must be a FTM.",
    "The model specified for diagnosis_ambiguity must be an EDIM.",
    "The function single_level_detection takes a set of diagnoses as input.",
    "single_level_detection returns a set of diagnoses.",
    "single_level_detection takes a set of diagnoses and a level as input.",
    "single_level_detection finds all diagnoses at a specified level of indenture.",
    "single_level_detection excludes diagnoses with child diagnoses at the same level.",
    "single_level_detection excludes diagnoses with parents at the same level.",
    "implicated_diagnosis_set examines a diagnostic model.",
    "implicated_diagnosis_set returns the set of implicated diagnoses.",
    "implicated_diagnosis_set takes a diagnostic model and a level as input.",
    "implicated_diagnosis_set considers the tests defined for a level.",
    "A diagnosis is a candidate explanation associated with an indicated test failure.",
    "A diagnosis is identified as a candidate explanation.",
    "A test failure is indicated by a diagnosis.",
    "A diagnostic model must be a DIM.",
    "A diagnostic model must be a FTM.",
    "A diagnostic model must be an EDIM.",
    "The function detectable_failure_set examines a diagnostic model.",
    "The function detectable_failure_set returns the set of detectable failures.",
    "Detectable failures are a subtype of diagnosis.",
    "Detectable failures are within a diagnostic model.",
    "Detectable failures are at a specified level of indenture.",
    "Detectable failures are given the tests defined for the model.",
    "A detectable failure is also an implicated diagnosis.",
    "The detectable failure set is a subset of the implicated diagnosis set.",
    "The model specified must be a DIM.",
    "The model specified must be a FTM.",
    "The model specified must be an EDIM.",
    "The function detectable_failure_set takes a diagnostic model and a level as input.",
    "The function detectable_failure_set returns a set of diagnoses.",
    "The function detectable_fault_set examines a diagnostic model.",
    "The function detectable_fault_set returns the set of detectable faults within a model at a specified level.",
    "Detectable faults are a subtype of diagnosis.",
    "Detectable faults are a subset of implicated diagnoses.",
    "The detectable fault set is a subset of the implicated diagnosis set.",
    "A detectable fault is also an implicated diagnosis.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "The function isolatable_repair_item_set takes a diagnostic model as input.",
    "The function isolatable_repair_item_set takes a level of indenture as input.",
    "The function isolatable_repair_item_set takes a group size n as input.",
    "The function isolatable_repair_item_set takes a BOOLEAN argument to indicate whether to include ambiguity with No Fault in the analysis.",
    "The function isolatable_repair_item_set returns the set of repair item ambiguity groups.",
    "The function isolatable_repair_item_set returns the set of repair item ambiguity groups of exactly size n.",
    "The model specified must be a DIM.",
    "The model specified must be a FTM.",
    "The model specified must be an EDIM.",
    "The function isolatable_diagnosis_set takes a diagnostic model as input.",
    "The function isolatable_diagnosis_set takes a level of indenture as input.",
    "The function isolatable_diagnosis_set takes a group size n as input.",
    "The function isolatable_diagnosis_set returns the set of diagnosis ambiguity groups.",
    "The function isolatable_diagnosis_set returns the set of diagnosis ambiguity groups of exactly size n.",
    "The function isolatable_diagnosis_set includes ambiguity with No Fault in the analysis if the BOOLEAN argument is provided.",
    "The model specified for the function isolatable_diagnosis_set must be a DIM.",
    "The model specified for the function isolatable_diagnosis_set must be a FTM.",
    "The model specified for the function isolatable_diagnosis_set must be an EDIM.",
    "IEEE Std 1522-2004 is a trial-use standard.",
    "IEEE Std 1522-2004 is for testability and function.",
    "The isolatable_diagnoses_set function takes a diagnostic model, a level, and an INTEGER as input.",
    "The isolatable_diagnoses_set function returns a SET OF diagnosis_ambiguity.",
    "The isolatable_diagnoses_set function takes a BOOLEAN as input.",
    "The isolatable_diagnoses_set function returns a SET OF diagnosis_ambiguity of size n.",
    "The isolatable_diagnoses_set function returns a SET OF diagnosis_ambiguity of type 'failure'.",
    "The isolatable_diagnoses_set function returns a SET OF diagnosis_ambiguity of exactly size n.",
    "The isolatable_failures_set function takes a diagnostic model, a level of indenture, and a group size n as input.",
    "The isolatable_failures_set function returns the set of diagnosis ambiguity groups.",
    "The isolatable_failures_set function returns the set of diagnosis ambiguity groups of exactly size n.",
    "The analysis includes ambiguity with No Fault.",
    "The model specified must be a DIM.",
    "The model specified must be a FTM.",
    "The model specified must be an EDIM.",
    "The function isolatable_failures_set takes a diagnostic model as input.",
    "The function isolatable_failures_set takes a level as input.",
    "The function isolatable_failures_set takes a group size n as input.",
    "The function isolatable_failures_set takes a BOOLEAN argument as input.",
    "The function isolatable_failures_set returns a set of diagnosis ambiguity groups.",
    "The function isolatable_failures_set returns a set of diagnosis ambiguity groups of exactly size n.",
    "The function isolatable_failures_set returns a set of diagnosis ambiguity groups containing only diagnoses of type 'fault'.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "The function isolatable_faults_set takes a diagnostic model, a level, an integer, and a boolean as input.",
    "The function isolatable_faults_set returns a set of diagnosis ambiguity.",
    "The function fault_ambig_set takes a diagnostic model, a level of indenture, and a group size as input.",
    "The function fault_ambig_set returns the set of diagnosis ambiguity groups for which the constituent faults are associated with exactly n repair items.",
    "The constituent faults in the diagnosis ambiguity groups are associated with exactly n repair items.",
    "The input argument indicates whether to include ambiguity with No Fault in the analysis.",
    "The model specified must be a DIM.",
    "The model specified must be a FTM.",
    "The model specified must be an EDIM.",
    "Authorized licensed use is limited to Technische Universitat Kaiserslautern.",
    "The input was downloaded on August 21, 2024 at 11:55:44 UTC from IEEE Xplore.",
    "Restrictions apply to the input.",
    "The IEEE Std 1522-2004 document describes diagnostic characteristics and metrics.",
    "The function fault_ambig_set takes a diagnostic model, a level, and an integer as input.",
    "The function fault_ambig_set returns a set of diagnosis ambiguity.",
    "The function failure_ambig_set takes a diagnostic model, a level of indenture, and a group size as input.",
    "The function failure_ambig_set returns the set of diagnosis ambiguity groups for which the constituent failures are associated with exactly n repair items.",
    "The function failure_ambig_set includes ambiguity with No Fault in the set if the include_nf argument is TRUE.",
    "The function failure_ambig_set includes ambiguity with No Fault in the set if the include_nf argument is FALSE is not specified.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "The function failure_ambig_set takes mdl, lvl, n, and include_nf as parameters.",
    "The function failure_ambig_set returns a set of diagnosis_ambiguity.",
    "The function failure_ambig_set is defined during development of this standard.",
    "It became obvious that it would be impractical to delineate all possible metrics.",
    "Metrics can be tailored to answer specific questions about the testability of a system.",
    "This standard does not intend to exclude worthwhile metrics.",
    "A series of building blocks (the fundamentals) was developed instead of a list of metrics.",
    "All fundamentals are based on IEEE Std 1232-2002.",
    "The metrics in this clause use the fundamentals.",
    "Several metrics are included as informative.",
    "Metrics developed using the fundamentals can be submitted to the D&MC Subcommittee.",
    "The D&MC Subcommittee can include metrics in a later revision of this standard.",
    "This subclause provides definitions of testability and diagnosability metrics.",
    "Testability and diagnosability metrics quantify the fault detection capability of a diagnostic model.",
    "Each fault detection metric is described by an equation.",
    "There are two detection metrics for a diagnostic model.",
    "One detection metric describes a diagnostic model's fault detection capability.",
    "Detection capability can be expressed as an unweighted percentage.",
    "Detection capability can also be expressed as a percentage weighted by probability of diagnosis.",
    "The text is licensed for authorized use only.",
    "The text is restricted by IEEE Xplore.",
    "The text is subject to certain restrictions.",
    "IEEE Std 1522-2004 is a trial-use standard.",
    "IEEE Std 1522-2004 is for testability and copyright.",
    "IEEE has all rights reserved.",
    "Percentage of detection (PoD) is a metric.",
    "PoD is the percentage of possible diagnoses that can be detected.",
    "PoD is calculated within a specified diagnostic model.",
    "PoD is calculated at a particular level within a diagnostic model.",
    "PoD is calculated by a given set of tests.",
    "PoD is described by Equation (1).",
    "Equation (1) is used to calculate PoD.",
    "Equation (1) uses implicated_diagnosis_set (mdl,lvl).",
    "Equation (1) uses the diagnostic model (mdl).",
    "Equation (1) uses the level of the diagnostic model (lvl).",
    "EPoD is the failure probability-weighted percentage of possible diagnoses at a particular level within a specified diagnostic model.",
    "EPoD is calculated using Equation (2).",
    "EPoD is calculated for a given set of tests defined within a diagnostic model.",
    "EPoD is calculated for a specified diagnostic model.",
    "EPoD is calculated at a particular level within a diagnostic model.",
    "EPoD is calculated using the ith diagnosis in the set returned by single_level_detection(ids, lvl).",
    "EPoD is calculated using the set returned by single_level_detection(ids, lvl).",
    "EPoD is calculated using the set returned by single_level_detection(ds, lvl).",
    "EPoD is calculated using the set returned by implicated_diagnosis_set(mdl, lvl).",
    "EPoD is calculated using the set returned by diagnosis_set(mdl, lvl).",
    "EPoD is calculated using the diagnostic model for which this metric is to be calculated.",
    "This subclause provides definitions of testability and diagnosability metrics.",
    "The subclause defines six fault isolation metrics.",
    "The six fault isolation metrics are: percentage of isolation, expected percentage of isolation, expected ambiguity group size, isolation effectiveness, projected effect of ambiguity upon false positives, and projected effect of ambiguity upon false negatives.",
    "Each fault isolation metric has an equation that describes it.",
    "The diagnostic model is used to calculate the metric.",
    "The level of the diagnostic model is lvl.",
    "Diagnoses are counted at the lvl level of the diagnostic model.",
    "The removals and repair item involvement ratio is a metric.",
    "The first and sixth metrics are unweighted.",
    "The first metric is the percentage of isolation.",
    "The sixth metric is the repair item involvement ratio.",
    "The other four metrics are weighted using probability of diagnosis.",
    "The probability of diagnosis is used to weight the metrics.",
    "The PoD model level is used to calculate the probability of diagnosis.",
    "The single level detection IDs are used to calculate the probability of diagnosis.",
    "The diagnosis set model level is used to calculate the probability of diagnosis.",
    "The EPoD model level is calculated using the probability of diagnosis.",
    "The probability of diagnosis is calculated using the diagnosis set model level and single level detection IDs.",
    "IEEE Std 1522-2004 describes diagnostic characteristics and metrics.",
    "Percentage of isolation consists of two individual equations.",
    "Incremental percentage of fault isolation is a metric.",
    "Incremental percentage of fault isolation is calculated for a specified model.",
    "Incremental percentage of fault isolation is calculated for a particular level of a specified model.",
    "Incremental percentage of fault isolation is the percentage of all diagnosis ambiguity groups that can be isolated.",
    "Incremental percentage of fault isolation is calculated using tests defined within a model.",
    "Incremental percentage of fault isolation is calculated using tests that contain a specified number of repair items.",
    "Cumulative percentage of isolation is a metric.",
    "Equation (3) describes the incremental percentage of fault isolation metric.",
    "lvl is the level of the diagnostic model.",
    "Faults are to be counted at lvl.",
    "n is the specified number of repair items.",
    "size is the maximum size of an ambiguity group in the model.",
    "Cumulative percentage of isolation (CPoI) is a metric.",
    "CPoI is calculated for a particular level of a specified diagnostic model.",
    "CPoI is the percentage of all diagnosis ambiguity groups that can be isolated.",
    "CPoI is calculated using the tests defined within the model.",
    "CPoI is calculated for ambiguity groups with no more than n repair items.",
    "CPoI is described by Equation (4).",
    "n is the specified number of repair items.",
    "Expected percentage of isolation consists of two individual equations.",
    "The incremental expected percentage of isolation is a metric.",
    "The incremental expected percentage of isolation is described by Equation (5).",
    "The incremental expected percentage of isolation is the failure probability-weighted percentage of all diagnosis ambiguity groups.",
    "The incremental expected percentage of isolation is the percentage of all diagnosis ambiguity groups that can be isolated using the tests defined within a diagnostic model.",
    "The incremental expected percentage of isolation contains a specified number of repair items.",
    "The cumulative expected percentage of isolation is an individual equation.",
    "AGn is the set union of RDn.",
    "RDn is a set.",
    "AGn is the union of RDn.",
    "RDn is the result of convert_repair_to_diag_ambiguity(mdl, lvl, RAGn).",
    "RAGn is the result of get_size_n_ambig_group(mdl, lvl, n).",
    "Di is the ith diagnosis in AGn.",
    "P(Di) is the probability of diagnosis Di given isld.",
    "isld is the set returned by single_level_detection(ids, lvl).",
    "ids is the implicated diagnosis set of mdl at level lvl.",
    "mdl is the diagnostic model.",
    "lvl is the level of the diagnostic model.",
    "n is the size of the ambiguity group.",
    "fault_ambig_set mdl lvl n is the set of faults at level lvl in mdl with n ambiguities.",
    "fault_ambig_set mdl lvl size is the set of faults at level lvl in mdl with size ambiguities.",
    "The size of fault_ambig_set mdl lvl n is n.",
    "The size of fault_ambig_set mdl lvl size is size.",
    "The text is licensed by IEEE.",
    "The license is authorized.",
    "The license is restricted.",
    "The license applies to Technische Universitat Kaiserslautern.",
    "The license was downloaded on August 21, 2024.",
    "The license was downloaded at 11:55:44 UTC.",
    "IEEE published IEEE Std 1522-2004.",
    "IEEE Std 1522-2004 is a trial-use standard.",
    "IEEE Std 1522-2004 is for testability.",
    "n is the specified number of repair items.",
    "Repair item ambiguity groups of size n must be found.",
    "The probability of isolating to one ambiguity group is the sum of the probabilities of the diagnoses associated with the repair items that caused the ambiguity.",
    "The incremental expected probability of isolating to one ambiguity group is the sum of the probabilities of all diagnoses causing the collection of repair item ambiguity groups.",
    "IEPoI provides the probability of isolating to a repair item ambiguity group.",
    "CEPoI is a metric for a diagnostic model.",
    "CEPoI is the failure probability-weighted percentage of all diagnosis ambiguity groups that can be isolated using the tests defined within a diagnostic model.",
    "CEPoI provides the probability of isolating to a repair item ambiguity group of size n or less.",
    "CEPoI is described by Equation (6).",
    "Equation (6) is used to calculate CEPoI for a diagnostic model.",
    "Equation (6) uses the diagnostic model (mdl) for calculation.",
    "Equation (6) uses the level of the diagnostic model (lvl) for calculation.",
    "Equation (6) uses the specified number of repair items (n) for calculation.",
    "The specified number of repair items is n.",
    "The Expected Ambiguity Group Size (EAGS) is the failure probability-weighted average number of repair items.",
    "EAGS is calculated for a particular level of a diagnostic model.",
    "EAGS is calculated using the tests defined within the diagnostic model.",
    "The diagnostic model is described by Equation (7).",
    "Equation (7) is: mdl is the diagnostic model, lvl is the level of the diagnostic model, and n is the maximum number of repair items in an ambiguity group.",
    "This subclause is informative only.",
    "This subclause is not a normative part of this standard.",
    "Isolation effectiveness is a measure of how well repair item ambiguity groups can be isolated.",
    "Isolation effectiveness is a measure of how well repair item ambiguity groups conform to a specified diagnostic goal.",
    "A specified diagnostic goal is expressed as a lower bound/minimum.",
    "Typical diagnostic goals include the ambiguity group size.",
    "Typical diagnostic goals include the cost/time to isolate, replace or repair ambiguity groups.",
    "Let be the deviation of a function of x relative to the goal y.",
    "CEPoI is a function of x relative to the goal y.",
    "IEPoI is a measure of isolation effectiveness for a particular level of a diagnostic model.",
    "IEPoI is a measure of isolation effectiveness for a diagnostic model at level n.",
    "IEPoI is a measure of isolation effectiveness for a diagnostic model at level i.",
    "EAGS is a sum of IEPoI for a diagnostic model at level i.",
    "IEPoI is a product of f(x) and the sum of EAGS for a diagnostic model at level i.",
    "The text is licensed by IEEE.",
    "The text is restricted to use at Technische Universitat Kaiserslautern.",
    "The text was downloaded on August 21, 2024.",
    "The text was downloaded at 11:55:44 UTC.",
    "IEEE Std 1522-2004 describes the general form of a metric.",
    "The general form of the metric is described by Equation (8).",
    "Equation (8) is described by the following formula: AGi is the ith repair item ambiguity group goal is the goal (expressed as a lower bound/minimum) to which the calculated value for each ambiguity group is to be compared (such as the target ambiguity group size or repair cost) f(AGi) is the value of the measure for AGi that is to be compared with the specified goal (such as the actual ambiguity group size or repair time for AGi) P(AGi) is the probability_of_repair_item_set(AGi), i.e., the probability that AGi is isolated mdl",
    "The metric has a specified goal.",
    "The goal is expressed as a lower bound/minimum.",
    "The goal is to be compared with the calculated value for each ambiguity group.",
    "The calculated value for each ambiguity group is to be compared with the specified goal.",
    "The specified goal is compared with the value of the measure for AGi.",
    "The value of the measure for AGi is compared with the specified goal.",
    "The probability of repair item set (AGi) is the probability that AGi is isolated.",
    "The probability of repair item set (AGi) is denoted as P(AGi).",
    "lated mdl is the diagnostic model for which this metric is to be calculated.",
    "lvl is the level of the diagnostic model at which faults are to be counted.",
    "n is the total number of repair item ambiguity groups for the lvl and mdl.",
    "When all repair item ambiguity groups meet the specified goal, ((f(AGi),goal) will be equal to zero for all ambiguity groups.",
    "The isolation effectiveness metric will calculate to a value of 1.0 (100% effectiveness) when all repair item ambiguity groups meet the specified goal.",
    "The isolation effectiveness metric is used as an indication of how well a diagnostic model can achieve isolation to a maximum size.",
    "A diagnostic model can achieve isolation to a maximum size of a single failed repair item.",
    "x is equal to AGi.",
    "f of AGi equals the size of AGi.",
    "y specifies the maximum size.",
    "The specific form of the isolation effectiveness metric is IEisol.",
    "AGi is the ith repair item ambiguity group.",
    "The size of AGi is the goal specifying the maximum size of an ambiguity group.",
    "The actual size of AGi equals |AGi|.",
    "The probability that AGi is isolated equals P(AGi).",
    "The diagnostic model for which this metric is to be calculated equals mdl.",
    "The level of the diagnostic model at which faults are to be counted equals lvl.",
    "The metric is to be calculated at level n.",
    "n is the total number of repair item ambiguity groups for the lvl and mdl.",
    "Setting size = 1 will test the ability to isolate to a single repair item.",
    "Isolation effectiveness can be used to identify the effect of diagnostic ambiguity on a particular maintenance goal such as maximum repair time.",
    "Letting x = AGi and defining f(AGi) to IE mld lvl goal , ( , ) P AGi ( ) f AGi ( ) goal ( , ) ∆ × i = n ∑ P AGi ( ) i = n ∑ f AGi ( ) × is an example of isolation effectiveness.",
    "IEisol mdl lvl size , ( , ) P AGi ( ) AGi size ( , ) ∆ × i = n ∑ P AGi ( ) i = n ∑ AGi × is a formula for isolation effectiveness.",
    "The text is licensed by IEEE.",
    "The license is authorized.",
    "The license is restricted.",
    "The license applies to Technische Universitat Kaiserslautern.",
    "The license was downloaded on August 21, 2024.",
    "The license was downloaded at 11:55:44 UTC.",
    "IEEE Std 1522-2004 is a trial-use standard for testability.",
    "Copyright 2005 IEEE. All rights are reserved.",
    "The repair time associated with AGi is denoted as RT(AGi).",
    "Equation (9) gives a variant of IE denoted as IERT.",
    "AGi is the ith repair item ambiguity group.",
    "Time is the goal specifying the maximum repair time of an ambiguity group.",
    "RT(AGi) is the actual repair time of AGi.",
    "P(AGi) is the probability of repair item set AGi.",
    "P(AGi) is the probability that AGi is isolated.",
    "mdl is the diagnostic model for which this metric is to be calculated.",
    "lvl is the level of the diagnostic model at which faults are to be counted.",
    "n is the total number of repair item ambiguity groups for the lvl and mdl.",
    "The delta function returns zero if the repair time for an ambiguity group is less than 60 minutes.",
    "The delta function returns zero when the goal is not exceeded.",
    "The delta function returns the absolute value of the difference when the goal is exceeded.",
    "This subclause is informative only.",
    "This subclause is not a normative part of this standard.",
    "PEAFR is a measure of the effect of ambiguous isolation on false removals.",
    "PEAFR is calculated for a particular level of a diagnostic model.",
    "PEAFR is calculated using the set of repair item ambiguity groups that can be isolated using tests defined within the model.",
    "PEAFR is described by Equation (10).",
    "Equation (10) describes PEAFR as a function of AGi, |AGi|, P(AGi), mdl, lvl, and n.",
    "AGi is the ith repair item ambiguity group.",
    "The size of AGi is |AGi|.",
    "P(AGi) is the probability that AGi is isolated.",
    "The diagnostic model for which PEAFR is to be calculated is mdl.",
    "The level of the diagnostic model at which faults are to be counted is lvl.",
    "The number of faults to be counted is n.",
    "n is the total number of repair item ambiguity groups for the lvl and mdl.",
    "PEAFR gives the worst-case percentage of false removals because of diagnostic ambiguity for the specified level of the given diagnostic model.",
    "PEAFR projects the relative likelihood of false removals when malfunctions occur.",
    "PEAFR is calculated using the formula: PEAFR = (1/n) * ∑(P AGi) - (1/n) * ∑(RT AGi) * time.",
    "PEAFR is calculated using the formula: PEAFR = (1/n) * ∑(P AGi) - (1/n) * ∑(AGi) * time.",
    "PEAFR is calculated for the specified level of the given diagnostic model.",
    "PEAFR is calculated for the lvl and mdl PEAFR.",
    "The text is licensed by IEEE Xplore.",
    "The license is authorized.",
    "The license is limited to Technische Universitat Kaiserslautern.",
    "The text was downloaded on August 21, 2024.",
    "The text was downloaded at 11:55:44 UTC.",
    "Restrictions apply to the license.",
    "IEEE Std 1522-2004 defines diagnostability characteristics and metrics.",
    "Ambiguity groups occur singly during maintenance.",
    "Ambiguity groups are replaced as a block.",
    "Isolated ambiguity groups contain multiple faulty repair items.",
    "Ambiguity groups are maintained using serial (prioritized) replacement.",
    "The actual percentage of false removals is lower when ambiguity groups are maintained using serial (prioritized) replacement.",
    "False removals can result from factors other than ineffective fault isolation.",
    "PEAFR quantifies the effect of diagnostic ambiguity on false removals.",
    "PEAFR is equal to 1 minus IE with respect to isolation to a single failed repair item.",
    "PEAFR is equal to 1 minus IE with respect to isolation to a single failed repair item.",
    "The RIIR is the number of repair item ambiguity groups divided by the total number of ambiguity groups.",
    "The RIIR is described by Equation (11).",
    "The RIIR is calculated using the get_ambig_group function.",
    "The get_ambig_group function takes three parameters: mdl, RI, and lvl.",
    "The get_ambig_group function returns a set of ambiguity groups.",
    "The size of the set of ambiguity groups is |AGRI|.",
    "The RIIR is calculated for a given repair item RI.",
    "The RIIR is calculated for a given diagnostic model mdl.",
    "The RIIR is calculated for a given level lvl of the diagnostic model.",
    "This subclause is informative only.",
    "This subclause is not a normative part of this standard.",
    "Fault detection and isolation metrics can be calculated over an entire design.",
    "Fault detection and isolation metrics can be calculated over an explicitly defined functional subset of that design.",
    "The following list provides some typical types of subsets that may be used to constrain the fault detection metrics for a design.",
    "Functionality can be used to constrain the fault detection metrics for a design.",
    "Avionics can be used to constrain the fault detection metrics for a design.",
    "Weapon systems can be used to constrain the fault detection metrics for a design.",
    "Survivability can be used to constrain the fault detection metrics for a design.",
    "Technology can be used to constrain the fault detection metrics for a design.",
    "Electronic technology can be used to constrain the fault detection metrics for a design.",
    "Mechanical technology can be used to constrain the fault detection metrics for a design.",
    "Hydraulic technology can be used to constrain the fault detection metrics for a design.",
    "Operational usage can be used to constrain the fault detection metrics for a design.",
    "Operational hardware can be used to constrain the fault detection metrics for a design.",
    "Built-in test hardware/sensors can be used to constrain the fault detection metrics for a design.",
    "Hardware source can be customer-furnished equipment or commercial off-the-shelf.",
    "Operating mode can be takeoff, autopilot, on-line, off-line, or in storage.",
    "Test domain can be hardware functions intended to be tested by startup BIT.",
    "Fault universe can include specific fault types over which detection is to be calculated.",
    "The equations defined in this clause can be used to calculate metrics for a particular functional subset of a design.",
    "The model (mdl) must be constructed such that only the desired subset is represented.",
    "PEFR mdl lvl can be calculated using the equations defined in this clause.",
    "IEisol mdl lvl can be calculated using the equations defined in this clause.",
    "RIIR mdl lvl can be calculated using the equations defined in this clause.",
    "AGRI can be equal to AGRI RI for all RI.",
    "The text is licensed by IEEE.",
    "The license is authorized.",
    "The license is limited to Technische Universitat Kaiserslautern.",
    "The text was downloaded on August 21, 2024.",
    "The text was downloaded at 11:55:44 UTC.",
    "Restrictions apply to the text.",
    "IEEE Std 1522-2004 is a trial-use standard.",
    "IEEE Std 1522-2004 is for testability and Copyright is reserved by IEEE in 2005.",
    "Fault detection and isolation metrics are constrained by test class.",
    "Fault detection and isolation metrics are used to calculate fault coverage.",
    "Fault coverage is associated with different subsets of tests within the design.",
    "Test classes constrain analysis.",
    "BIT type is a common test class.",
    "Diagnostic usage is a common test class.",
    "Test implementations are a common test class.",
    "BIT type includes startup, continuous, and periodic.",
    "Diagnostic usage includes embedded diagnostics and technical manual tests.",
    "Test implementations include current BIT, proposed BIT, and proposed technical manual tests.",
    "Metrics are calculated for a particular subset of tests within a design.",
    "Equations are defined in IEEE Std 1522-2004 for metrics calculation.",
    "The model is constructed to represent only the desired subset.",
    "The diagnosis failure probabilities are derived from failure rates.",
    "Failure rates describe expected rates of failure.",
    "Failure rates are usually expressed in terms of failures per million hours.",
    "The metric equation can be used to calculate EPoD and EPoI over a specific time interval.",
    "All failure rates in the diagnostic model represent the number of failures.",
    "Failures are expected within a given time interval.",
    "Failures are not expected per million hours.",
    "Authorized licensed use is limited to Technische Universitat Kaiserslautern.",
    "The document was downloaded on August 21, 2024.",
    "The document was downloaded at 11:55:44 UTC.",
    "Restrictions apply to the document.",
    "IEEE published Std 1522-2004.",
    "IEEE reserved all rights to Std 1522-2004.",
    "Annex A of Std 1522-2004 is informative.",
    "DePaul published 'Logic modeling as a tool for testability' in 1985.",
    "DePaul's paper was published in the Proceedings of the IEEE AUTOTESTCON.",
    "DePaul's paper was published by IEEE Press in New York.",
    "Gould published 'Serial replacement maintenance philosophies and multiple-failure diagnostic strategies' in 1997.",
    "Gould's paper was published in the Proceedings of the IEEE AUTOTESTCON.",
    "Gould's paper was published by IEEE Press in New York.",
    "Gould and Hartop published 'Thinking beyond the group size fetish: Towards a new testability'.",
    "The IEEE AUTOTESTCON proceedings were published in 1999.",
    "The IEEE AUTOTESTCON proceedings were published by IEEE Press.",
    "The IEEE AUTOTESTCON proceedings were published in New York.",
    "The IEEE AUTOTESTCON proceedings were published on pages 673–684.",
    "The IEEE 100 dictionary was published in 1999.",
    "The IEEE 100 dictionary was published by IEEE Press.",
    "The IEEE 100 dictionary was published in New York.",
    "The IEEE 100 dictionary was published on pages 673–684.",
    "Keiner presented a Navy approach to integrated diagnostics at the IEEE AUTOTESTCON in 1990.",
    "Keiner's presentation was published in the IEEE AUTOTESTCON proceedings in 1990.",
    "Keiner's presentation was published by IEEE Press in 1990.",
    "Keiner's presentation was published in New York in 1990.",
    "Keiner's presentation was published on pages 443–450 in 1990.",
    "The Naval Sea Systems Command published the Testability Analysis Handbook in 1989.",
    "Qualtech Systems Inc. published the Teams: Testability Engineering and Maintenance System Users Guide 4.1.",
    "Simpson, Bailey, Barto, and Esker presented a paper on organizational-level testability prediction at the U.S. Air Force in 1985.",
    "Simpson and Sheppard published the book System Test and Diagnosis in 1999.",
    "Simpson and Sheppard's book was published by Kluwer Academic in 1999.",
    "Simpson and Sheppard's book was published in Norwell, MA in 1999.",
    "IEEE publications are available from the Institute of Electrical and Electronics Engineers.",
    "IEEE publications are available at 445 Hoes Lane.",
    "IEEE publications are available at P.O. Box 1331.",
    "IEEE publications are available in Piscataway, NJ.",
    "IEEE publications are available in USA.",
    "IEEE publications are available at http://standards.ieee.org/",
    "Authorized licensed use is limited to Technische Universitat Kaiserslautern.",
    "IEEE publications were downloaded on August 21, 2024.",
    "IEEE publications were downloaded at 11:55:44 UTC.",
    "Restrictions apply to IEEE publications.",
    "IEEE Std 1522-2004 is a trial-use standard.",
    "IEEE Std 1522-2004 is for testability and",
    "Copyright 2005 IEEE. All rights reserved.",
    "Annex B of IEEE Std 1522-2004 is informative.",
    "Annex B of IEEE Std 1522-2004 is about product life cycle and metric applicability.",
    "The domain of discourse for IEEE Std 1522-2004 is diagnostic design and development.",
    "Diagnostic design and development is an integral part of the system engineering process.",
    "Diagnostic design and development is part of product design, development, and use.",
    "This annex describes a usage scenario for IEEE Std 1522-2004.",
    "The product life cycle process is related to diagnostic analysis and design.",
    "A comprehensive diagnostic analysis and design program requires a dedicated effort.",
    "A comprehensive diagnostic analysis and design program requires a dedicated effort throughout all phases of the system life cycle.",
    "A comprehensive diagnostic analysis and design program is necessary to satisfy customer needs and expectations.",
    "A comprehensive diagnostic analysis and design program is necessary to satisfy customer needs and expectations relative to diagnostic performance.",
    "The diagnostic design life cycle is organized around five phases.",
    "The diagnostic design life cycle has five phases: Requirements definition, Architecture design, Detailed test design, Verification and validation, and Diagnostic maturation.",
    "Requirements definition is a phase of the diagnostic design life cycle.",
    "Architecture design is a phase of the diagnostic design life cycle.",
    "Detailed test design is a phase of the diagnostic design life cycle.",
    "Verification and validation is a phase of the diagnostic design life cycle.",
    "Diagnostic maturation is a phase of the diagnostic design life cycle.",
    "A brief description of each phase is provided in B.1–B.7.",
    "Requirements definition is the first step in an effective testability program.",
    "Requirements definition is used to manage diagnostic analysis and development.",
    "Requirements definition assures that the product will satisfy customer needs and expectations.",
    "Diagnostic requirements are expressed in performance terms.",
    "Diagnostic requirements express the desired outcome without directing how to achieve it.",
    "Diagnostic requirements center around fault detection.",
    "Diagnostic requirements center around fault isolation.",
    "Diagnostic requirements center around fault isolation resolution.",
    "Diagnostic requirements center around operational isolation.",
    "Mission reliability is a key consideration in the design phase of a program.",
    "Mission reliability is typically verified through the reliability of reconfigurable, redundant, or safety-critical systems.",
    "Mission reliability is now being used to measure a system's prognostic capability.",
    "A system's prognostic capability is used to satisfy mission requirements with a satisfactory measure of confidence.",
    "System prognostics are analytically shown to predict an interval of operation without malfunction.",
    "Mean time between failure (MTBF) is a system-level metric.",
    "Operational metrics are specified at the system level.",
    "Availability is a metric.",
    "The CND/NEOF rate is a metric.",
    "The MTBUMA is a metric.",
    "Derivative requirements include MTTR.",
    "Derivative requirements include maintenance frequency.",
    "Derivative requirements include skill levels of repair personnel.",
    "Derivative requirements include time required for maintenance.",
    "Derivative requirements include man-hours.",
    "Derivative requirements include flight hours.",
    "Derivative requirements include turnaround time.",
    "Derivative requirements include fault isolation time.",
    "Derivative requirements include repair and replace time.",
    "Customer warranties may be executed on MTBF.",
    "Customer warranties may be executed on operational availability.",
    "Customer warranties may be executed on total operating hours.",
    "IEEE published Std 1522-2004 in 2005.",
    "IEEE reserved all rights to Std 1522-2004.",
    "The intent in the architecture design phase is to develop a preliminary design framework.",
    "The preliminary design framework allocates diagnostic program requirements in a top-down manner.",
    "Diagnostic program requirements are allocated to physical system components.",
    "A basic diagnostic subsystem architecture is laid out in conjunction with trade studies.",
    "Trade studies include fault tolerance.",
    "Trade studies include fault reporting.",
    "Trade studies include field update approaches.",
    "Trade studies include prognostic vs. diagnostic approaches.",
    "The system's fault tolerance is evaluated against cost.",
    "The system's fault tolerance is evaluated against weight.",
    "The system's fault tolerance is evaluated against power.",
    "The system's fault tolerance is evaluated against MTBF.",
    "Subsystem requirements are allocated to individual hardware elements.",
    "Hardware elements are typically boxes and/or modules.",
    "System-level testability models are created to support analysis.",
    "System-level testability models are created in conjunction with FMECA.",
    "System-level testability models evolve with the design.",
    "Testability analysis is performed on the design models in a top-down manner.",
    "Functional/physical partitioning is verified in testability analysis.",
    "Diagnostic requirements allocation is verified in testability analysis.",
    "Diagnostic requirements allocation satisfies top-level requirements.",
    "The analysis uses the same metrics as identified in B.1.",
    "The analysis provides guidance for diagnostic design influence.",
    "Diagnostic design influence assures that diagnostic design features meet testability requirements.",
    "Diagnostic design features are identified and incorporated into the product design.",
    "An elementary framework for a test strategy begins to emerge during diagnostic design influence.",
    "The purpose of the detailed test design phase is to meet all diagnostic program requirements.",
    "The detailed test design phase develops a detailed design solution.",
    "The detailed design solution meets all diagnostic program requirements.",
    "Detailed hardware and software designs are created during the detailed test design phase.",
    "The physical design is reflected in the analysis models.",
    "The hardware aspects are linked to their functional elements.",
    "The basic diagnostic subsystem architecture is modified as design and support system details emerge.",
    "Diagnostic and reliability trade studies are iterated as required.",
    "Diagnostic and reliability trade studies affect cost.",
    "Diagnostic and reliability trade studies affect weight.",
    "Diagnostic and reliability trade studies affect power.",
    "Diagnostic and reliability trade studies affect MTBCF.",
    "Diagnostic and reliability trade studies affect MTBF.",
    "Fault tolerance is iterated as required.",
    "Fault reporting is iterated as required.",
    "Prognostics and field update approaches are iterated as required.",
    "FD allocations are adjusted as necessary.",
    "FI allocations are adjusted as necessary.",
    "FIR allocations are adjusted as necessary.",
    "Preliminary test verticality is performed during this phase.",
    "Preliminary test verticality involves cone of tolerance analysis.",
    "The results of preliminary test verticality include comparative margins and tolerances.",
    "The results of preliminary test verticality include test consistency between BIT and ATE.",
    "The results of preliminary test verticality include test consistency between Factory and field tests.",
    "The results of preliminary test verticality include worst-case tolerance variations.",
    "The results of preliminary test verticality include detection of latent manufacturing defects.",
    "The purpose of the verification and validation phase is to validate the detailed design solution.",
    "The detailed design solution was verified by analysis to assure compliance with specification requirements.",
    "The detailed design solution will actually achieve all specification requirements.",
    "Diagnostic requirements are verified on delivery.",
    "Diagnostic requirements are verified through test and demonstration.",
    "Diagnostic support equipment is tested or demonstrated.",
    "Support system contributions to diagnostics are tested or demonstrated.",
    "Operational and maintenance scenarios include testing or demonstrating diagnostic support equipment.",
    "Operational and maintenance scenarios include testing or demonstrating support system contributions to diagnostics.",
    "Quantitative testability allocations are verified through analysis.",
    "Inherent design requirements are verified through analysis.",
    "Diagnostic requirements are verified through inspection methods.",
    "IEEE published IEEE Std 1522-2004.",
    "IEEE Std 1522-2004 is a trial-use standard.",
    "IEEE Std 1522-2004 is for testability and",
    "Two primary validation efforts are performed during this phase.",
    "The validity of the fault detection model is assessed.",
    "The validity of the fault isolation model is assessed.",
    "Fault detection and fault isolation models are assessed through static fault insertion.",
    "Static fault insertion is performed through BIT demonstration.",
    "Susceptibility to false alarms is evaluated during field testing.",
    "Susceptibility to duplicates is evaluated during field testing.",
    "Diagnostic software performs its intended job in the presence of failures.",
    "Fault insertion is the only controlled opportunity for exercising the complete embedded hardware/software.",
    "Faults are inserted into the hardware design.",
    "Faults are nondestructive.",
    "Faults are properly detected and reported.",
    "Diagnostic software is executed to verify the tests.",
    "Faults are chosen based on highest failure probability.",
    "Faults are chosen based on maximum amount of diagnostic software exercised.",
    "Faults are chosen based on least potential damage to the unit under test.",
    "Corrective actions are implemented for FD/FI deficiencies.",
    "Corrective actions are validated for FD/FI deficiencies.",
    "False alarms and cannot duplicates are undesirable design characteristics.",
    "False alarms and cannot duplicates cannot be truly predicted.",
    "False alarms and cannot duplicates cannot be systematically tested.",
    "Risk reduction activities can be performed to mitigate the risk of false alarms and cannot duplicates.",
    "Development and qualification tests exercise the hardware under simulated environmental and life conditions.",
    "Anomalies can be corrected in a test, analyze, and fix methodology.",
    "Specification compliance cannot be truly evaluated.",
    "Specification compliance cannot be truly evaluated.",
    "Laboratory and field tests are performed using simulated or actual interfaces.",
    "Diagnostic anomalies can be corrected during laboratory and field tests.",
    "The purpose of the maturation phase is to measure actual product performance.",
    "Corrective actions are implemented as required during the maturation phase.",
    "The effort to mature a design begins at the conceptual design stage.",
    "The effort to mature a design continues throughout the system life cycle.",
    "A maturation plan must be constructed to document diagnostics performance.",
    "A maturation plan must document diagnostics performance within actual operational environments.",
    "Maintenance environments will be collected.",
    "Maintenance environments will be measured.",
    "Maintenance environments will be evaluated.",
    "Maintenance environments will be acted on.",
    "The state of the diagnostic design will be demonstrated at the completion of the validation phase.",
    "The diagnostic design will meet the diagnostic and health management requirements at the completion of the validation phase.",
    "The diagnostic and health management requirements have evolved before delivery of the first unit.",
    "The diagnostic design will degrade due to unexpected system-level design interactions.",
    "The diagnostic design will degrade due to operational stresses.",
    "The diagnostic design will degrade due to environmental stresses.",
    "The diagnostic design will degrade due to other influences.",
    "The performance of the diagnostic design will degrade from what was predicted.",
    "Remedial actions must be taken for unacceptable product performance or other cost of ownership problems.",
    "Root cause analysis must be performed to identify potential adjustments.",
    "Root cause analysis must be performed to identify potential improvements.",
    "Root cause analysis must be performed to identify potential refinements.",
    "Potential adjustments are to diagnostic elements.",
    "Potential improvements are to support elements.",
    "Potential refinements are to operational elements.",
    "IEEE Std 1522-2004 defines the probability_of_diagnosis and probability_of_repair_item_set measures.",
    "The AI-ESTATE standard is extended by IEEE Std 1522-2004.",
    "The AI-ESTATE standard is defined within IEEE Std 1232-2002.",
    "The AI-ESTATE standard allows a failure rate value to be assigned to each diagnosis.",
    "IEEE Std 1522-2004 contains the specification for extensions of the AI-ESTATE information models.",
    "EXTEND_failure_rate is an abstract entity.",
    "EXTEND_failure_rate is a subtype of failure_rate.",
    "EXTEND_failure_rate contains the frequency value for the associated failure rate.",
    "EXTEND_failure_rate has two subtypes: EXTEND_weibull_failure_rate and EXTEND_exponential_failure_rate.",
    "EXTEND_failure_rate is associated with a frequency.",
    "SUBTYPE OF failure_rate is a type of entity.",
    "failure_rate has an associated frequency.",
    "The associated frequency is a type of frequency.",
    "IEEE published IEEE Std 1522-2004.",
    "IEEE published a trial-use standard for testability in 2004.",
    "IEEE published a standard for testability in 2004.",
    "IEEE reserved all rights to the standard in 2005.",
    "IEEE defined the attribute associated_frequency in 2004.",
    "The attribute associated_frequency specifies the rate of failures associated with a diagnosis over a given time span.",
    "The attribute associated_frequency is used to specify the rate of failures associated with a diagnosis over a given time span.",
    "The entity EXTEND_weibull_failure_rate is a subtype of EXTEND_failure_rate.",
    "EXTEND_weibull_failure_rate is used when the associated failure rate is the result of a Weibull distribution.",
    "EXTEND_weibull_failure_rate has an alpha attribute.",
    "EXTEND_weibull_failure_rate has a beta attribute.",
    "The alpha attribute of EXTEND_weibull_failure_rate is a real number.",
    "The beta attribute of EXTEND_weibull_failure_rate is a real number.",
    "The Weibull distribution is associated with the given failure rate.",
    "The alpha parameter is used to specify the Weibull distribution.",
    "The beta parameter is used to specify the Weibull distribution.",
    "The entity EXTEND_exponential_failure_rate is a subtype of EXTEND_failure_rate.",
    "The failure rate is the result of an exponential distribution.",
    "The text expresses a distribution.",
    "The distribution is an authorized licensed use.",
    "The authorized licensed use is limited to Technische Universitat Kaiserslautern.",
    "The text was downloaded from IEEE Xplore on August 21, 2024.",
    "Restrictions apply to the text.",
    "EXTEND_diagnosis is a subtype of the diagnosis entity in the AI-ESTATE common element model.",
    "EXTEND_diagnosis contains the failure rate for the associated diagnosis.",
    "EXTEND_diagnosis is a subtype of the EXTEND_failure_rate entity.",
    "EXTEND_diagnosis has a new_rate attribute.",
    "The new_rate attribute is used to specify the failure rate associated with the given diagnosis.",
    "The text is licensed by IEEE.",
    "The license is authorized.",
    "The license is limited to Technische Universitat Kaiserslautern.",
    "The text was downloaded on August 21, 2024.",
    "The text was downloaded at 11:55:44 UTC.",
    "Restrictions apply to the text."
  ],
  "created_at": "20260120_212912Z",
  "meta": {
    "mode": "chunks",
    "num_docs": 184
  }
}