{
  "num_qualities": 329,
  "qualities": [
    "IEEE Std 1522-2004 is a trial-use standard.",
    "IEEE Std 1522-2004 is for testability and diagnosability characteristics and metrics.",
    "IEEE Standards Coordinating Committee 20 sponsored IEEE Std 1522-2004.",
    "IEEE Std 1522-2004 was approved on 23 September 2004.",
    "IEEE Std 1522-2004 provides standard definitions of testability and diagnosability metrics and characteristics.",
    "IEEE Std 1522-2004 builds on IEEE Std 1232-2002.",
    "IEEE Std 1522-2004 is related to test and diagnosis.",
    "IEEE Std 1522-2004 uses aggregation fundamentals.",
    "IEEE Std 1522-2004 uses cost-related fundamentals.",
    "IEEE Std 1522-2004 is related to diagnosability.",
    "IEEE Std 1522-2004 is related to diagnostic inference.",
    "IEEE Std 1522-2004 is related to fault tree models.",
    "IEEE Standards documents are developed within the IEEE Societies.",
    "IEEE Standards documents are developed within the Standards Coordinating Committees of the IEEE Standards Association (IEEE-SA) Standards Board.",
    "The IEEE develops its standards through a consensus development process.",
    "The consensus development process is approved by the American National Standards Institute.",
    "Volunteers represent varied viewpoints and interests in the consensus development process.",
    "Volunteers serve without compensation.",
    "The IEEE administers the process and establishes rules to promote fairness.",
    "The IEEE does not independently evaluate the accuracy of its standards.",
    "The IEEE does not independently test its standards.",
    "The IEEE does not independently verify the accuracy of its standards.",
    "Use of an IEEE Standard is wholly voluntary.",
    "The IEEE disclaims liability for personal injury or property damage.",
    "The IEEE disclaims liability for personal injury or property damage.",
    "The IEEE disclaims liability for indirect or consequential damage.",
    "The IEEE disclaims liability for compensatory damage.",
    "The IEEE does not warrant the accuracy of the material contained in its standards.",
    "The IEEE does not represent the content of the material contained in its standards.",
    "The IEEE disclaims any express or implied warranty.",
    "The IEEE disclaims any implied warranty of merchantability.",
    "The IEEE disclaims any implied warranty of fitness for a specific purpose.",
    "The use of the material contained in an IEEE Standard is not free from patent infringement.",
    "IEEE Standards documents are supplied 'AS IS'.",
    "The existence of an IEEE Standard does not imply that there are no other ways to produce goods and services.",
    "The viewpoint expressed in an IEEE Standard is subject to change.",
    "Every IEEE Standard is subjected to review at least every five years.",
    "IEEE Standards are reviewed for revision or reaffirmation.",
    "A document is more than five years old if it has not been reaffirmed.",
    "A document that is more than five years old may not reflect the present state of the art.",
    "Users should check to determine that they have the latest edition of an IEEE Standard.",
    "The IEEE is not suggesting or rendering professional services for any person or entity.",
    "The IEEE is not undertaking to perform any duty owed by any other person or entity.",
    "Any person utilizing an IEEE Standard should rely upon the advice of a professional.",
    "Any person utilizing an IEEE Standard should rely upon the advice of a professional.",
    "IEEE provides interpretations of standards.",
    "Interpretations of IEEE standards require concurrence of a balance of interests.",
    "IEEE Standards Coordinating Committees provide responses to interpretation requests.",
    "IEEE cannot provide instant responses to interpretation requests.",
    "Individuals presenting IEEE standards information must disclose their personal views.",
    "Comments for revision of IEEE Standards are welcome from any interested party.",
    "Suggestions for changes in documents should be in the form of a proposed change of text.",
    "Comments on standards and requests for interpretations should be addressed to the IEEE-SA Standards Board.",
    "Authorization to photocopy portions of any individual standard is granted by IEEE.",
    "Permission to photocopy portions of any individual standard for educational classroom use can be obtained through the Copyright Clearance Center.",
    "Implementation of this standard may require use of subject matter covered by patent rights.",
    "IEEE is not responsible for identifying patents for which a license may be required by an IEEE standard.",
    "IEEE Standards Coordinating Committees cannot provide instant responses to interpretation requests.",
    "Individuals presenting IEEE standards information must disclose their personal views.",
    "Comments for revision of IEEE Standards are welcome from any interested party.",
    "Suggestions for changes in documents should be in the form of a proposed change of text.",
    "Comments on standards and requests for interpretations should be addressed to the IEEE-SA Standards Board.",
    "Authorization to photocopy portions of any individual standard is granted by IEEE.",
    "Permission to photocopy portions of any individual standard for educational classroom use can be obtained through the Copyright Clearance Center.",
    "Implementation of this standard may require use of subject matter covered by patent rights.",
    "IEEE is not responsible for identifying patents for which a license may be required by an IEEE standard.",
    "Comments should be addressed to the Secretary, IEEE-SA Standards Board.",
    "The IEEE-SA Standards Board address is 445 Hoes Lane, Piscataway, NJ 08855-1331, USA.",
    "The Copyright Clearance Center address is 222 Rosewood Drive, Danvers, MA 01923, USA.",
    "Comments for revision of IEEE Standards are welcome from any interested party.",
    "Suggestions for changes in documents should be in the form of a proposed change of text.",
    "Comments on standards and requests for interpretations should be addressed to the IEEE-SA Standards Board.",
    "Authorization to photocopy portions of any individual standard is granted by IEEE.",
    "Permission to photocopy portions of any individual standard for educational classroom use can be obtained through the Copyright Clearance Center.",
    "Implementation of this standard may require use of subject matter covered by patent rights.",
    "IEEE is not responsible for identifying patents for which a license may be required by an IEEE standard.",
    "The IEEE-SA Standards Board address is 445 Hoes Lane, Piscataway, NJ 08855-1331, USA.",
    "The Copyright Clearance Center address is 222 Rosewood Drive, Danvers, MA 01923, USA.",
    "The Copyright Clearance Center phone number is +1 978 750 8400.",
    "The Copyright Clearance Center address is 222 Rosewood Drive, Danvers, MA 01923, USA.",
    "The IEEE-SA Standards Board address is 445 Hoes Lane, Piscataway, NJ 08855-1331, USA.",
    "Implementation of this standard may require use of subject matter covered by patent rights.",
    "IEEE is not responsible for identifying patents for which a license may be required by an IEEE standard.",
    "Permission to photocopy portions of any individual standard for educational classroom use can be obtained through the Copyright Clearance Center.",
    "The Copyright Clearance Center address is 222 Rosewood Drive, Danvers, MA 01923, USA.",
    "The Copyright Clearance Center phone number is +1 978 750 8400.",
    "The IEEE-SA Standards Board address is 445 Hoes Lane, Piscataway, NJ 08855-1331, USA.",
    "Comments should be addressed to the Secretary, IEEE-SA Standards Board.",
    "Authorization to photocopy portions of any individual standard is granted by IEEE.",
    "Suggestions for changes in documents should be in the form of a proposed change of text.",
    "Comments on standards and requests for interpretations should be addressed to the IEEE-SA Standards Board.",
    "Comments for revision of IEEE Standards are welcome from any interested party.",
    "Individuals presenting IEEE standards information must disclose their personal views.",
    "Authorized licensed use limited to Technische Universitat Kaiserslautern.",
    "Downloaded on August 21,2024 at 11:55:44 UTC from IEEE Xplore.",
    "Restrictions apply.",
    "Copyright 2005 IEEE.",
    "All rights reserved.",
    "This introduction is not part of IEEE Std 1522-2004.",
    "IEEE Trial-Use Standard for Testability and Diagnosability Characteristics and Metrics is not part of this introduction.",
    "Systems became more complex costly and difficult to diagnose and repair.",
    "Initiatives were started to address these problems.",
    "The objective of one initiative was to make systems easier to test.",
    "This commercial standard must provide specific unambiguous definitions of criteria for assessing system testability.",
    "IEEE has started initiatives to standardize test architectures.",
    "The IEEE 1232TM Artificial Intelligence Exchange and Service Tie to All Test Environments series of standards provide the foundation for precise and unambiguous testability and diagnosability metrics.",
    "The IEEE 1232TM Artificial Intelligence Exchange and Service Tie to All Test Environments series of standards provide the foundation for precise and unambiguous testability and diagnosability metrics.",
    "It is the objective of this standard to provide notionally correct and inherently useful but mathematically precise definitions of testability measures.",
    "Notionally correct means that the measures are not in conflict with intuitive and historical representations.",
    "Notice to users Errata can be accessed at the following URL http:// standards.ieee.org/reading/ieee/updates/errata/index.html.",
    "Users are encouraged to check this URL for errata periodically.",
    "Current interpretations can be accessed at the following URL http://standards.ieee.org/reading/ieee/interp/ index.html.",
    "Implementation of this standard may require use of subject matter covered by patent rights.",
    "By publication of this standard no position is taken with respect to the existence or validity of patent rights.",
    "Metrics are derived from actual maintenance data.",
    "Metrics determine testability achieved during factory and field testing.",
    "Metrics are used to determine testability of a system.",
    "Testability is determined during factory and field testing.",
    "Metrics are derived from actual data.",
    "Metrics are used to determine testability.",
    "Testability is determined using metrics.",
    "Metrics are used to measure testability.",
    "Testability is measured using metrics.",
    "Metrics are used to assess testability.",
    "Testability is assessed using metrics.",
    "Metrics are used to evaluate testability.",
    "Predictive testability and diagnosability metrics are defined.",
    "Metrics are defined based on IEEE Std 1232-2002.",
    "Entities are required to define metrics.",
    "Information models are used to define metrics.",
    "Metrics are not computed using implementation-specific requirements.",
    "Metrics must be mathematically equivalent to definitions.",
    "Metrics are based on the assumption of a single independent fault.",
    "Multiple fault metrics are outside the scope of this standard.",
    "Industry consensus is lacking for multiple fault metrics.",
    "Metrics are technology-independent.",
    "Testability and diagnosability characteristics are defined.",
    "Metrics are based on relevant standard information models.",
    "Metrics are defined in this standard.",
    "Metrics are based on standard information models.",
    "Testability and diagnosability characteristics are defined.",
    "Metrics are technology-independent.",
    "Metrics are based on relevant standard information models.",
    "This standard provides consistent definitions.",
    "This standard provides unambiguous definitions.",
    "A common basis for system testability and diagnosability assessment is provided.",
    "Specifications are given in the EXPRESS language.",
    "Specifications are presented in the Courier type font.",
    "Entity and attribute names are referenced in the supporting text.",
    "Relevant IEEE standards are used.",
    "This standard provides consistent definitions.",
    "This standard provides unambiguous definitions.",
    "A common basis for system testability and diagnosability assessment is provided.",
    "Specifications are given in the EXPRESS language.",
    "Specifications are presented in the Courier type font.",
    "Entity and attribute names are referenced in the supporting text.",
    "Relevant IEEE standards are used.",
    "Conflict of standards is addressed.",
    "Vocabulary and definitions of relevant IEEE standards are used.",
    "Specifications are presented in a consistent format.",
    "Specifications are presented in a clear format.",
    "Specifications are easy to understand.",
    "Authorized licensed use limited to: Technische Universitat Kaiserslautern.",
    "Downloaded on August 21,2024 at 11:55:44 UTC from IEEE Xplore.",
    "Restrictions apply.",
    "IEEE DIAGONOSABLITY CHARACTERISTICS AND METRICS Std 1522-2004 Copyright",
    "All rights reserved.",
    "This subclause provides the definition of each aggregation fundamental to be used in more complex metric definitions.",
    "All fundamental measures are based on the AI-ESTATE common element model and need not be tied to specific diagnostic models (i.e., FTM, DIM, or EDIM).",
    "Within AI-ESTATE, an action is defined by the information model to be “A specific action taken to either test or repair an item.",
    "Actions are the primary entities against which costs are associated.",
    "Ultimately",
    "the diagnosis and repair process is concerned with optimizing the sequence of actions required to return a unit to service.",
    "The function action_set returns the set of all actions within a diagnostic model at a particular level.",
    "FUNCTION action_set (mdl : diagnostic_model; lvl : level) : SET OF action; END_FUNCTION;",
    "Within AI-ESTATE, a diagnosis is defined by the information model to be “a lattice of diagnostic conclusions.",
    "Typically, a diagnosis consists of failures or fault (sic.).",
    "The diagnoses can be interconnected in a lattice to classify constituent units, e.g., by function.",
    "This construct provides a generalized grouping mechanism for the constituents of the unit under test and their failure modes.”",
    "The function diagnosis_set returns the set of all diagnoses within a diagnostic model at a particular level.",
    "FUNCTION diagnosis_set (mdl : diagnostic_model; lvl : level) : SET OF diagnosis; END_FUNCTION;",
    "Within AI-ESTATE, a failure mode is defined by the information model to be “A specific mode or means by which a unit or system can fail.",
    "The specific failure mode is associated, first with the diagnosis, then (by way of the appropriate subtype) to the item that has failed.",
    "The function failure_mode_set returns the set of all failure modes within a diagnostic model at a particular level.",
    "Authorized licensed use limited to: Technische Universitat Kaiserslautern.",
    "Downloaded on August 21,2024 at 11:55:44 UTC from IEEE Xplore.",
    "Restrictions apply.",
    "IEEE Std 1522-2004 IEEE TRIAL-USE STANDARD FOR TESTABILITY AND Copyright",
    "All rights reserved.",
    "n is the specified number of repair items",
    "IEEPoI is the probability of isolating to one ambiguity group",
    "IEEPoI is the sum of the probabilities of the diagnoses associated with the repair items that caused the ambiguity",
    "IEEPoI is the sum of the probabilities of all diagnoses causing the collection of repair item ambiguity groups",
    "IEEPoI provides the probability of isolating to a repair item ambiguity group",
    "CEPoI is the probability-weighted percentage of all diagnosis ambiguity groups that can be isolated using the tests defined within that model",
    "CEPoI provides the probability of isolating to a repair item ambiguity group of size n or less",
    "CEPoI is described by Equation (6)",
    "Equation (6) is used to calculate CEPoI",
    "mdl is the diagnostic model for which this metric is to be calculated",
    "lvl is the level of the diagnostic model at which faults are to be counted",
    "n is the specified number of repair items",
    "EAGS is the failure probability-weighted average number of repair items in all repair item ambiguity groups",
    "EAGS is described by Equation (7)",
    "Equation (7) is used to calculate EAGS",
    "mdl is the diagnostic model for which this metric is to be calculated",
    "lvl is the level of the diagnostic model at which faults are to be counted",
    "n is the maximum number of repair items in an ambiguity group in the model",
    "let x = AGi.",
    "f(AGi) = |AGi|.",
    "size specifies the maximum size.",
    "IEisol is the specific form of the isolation effectiveness metric.",
    "AGi is the ith repair item ambiguity group.",
    "|AGi| is the actual size of AGi.",
    "P(AGi) is the probability of repair item set AGi.",
    "mdl is the diagnostic model.",
    "lvl is the level of the diagnostic model.",
    "n is the total number of repair item ambiguity groups.",
    "n is the total number of repair item ambiguity groups for lvl and mdl.",
    "setting size = 1 will test the ability to isolate to a single repair item.",
    "isolation effectiveness can be used to identify the effect of diagnostic ambiguity on a particular maintenance goal.",
    "be the repair time associated with AGi.",
    "IERT is a variant of IE.",
    "AGi is the ith repair item ambiguity group.",
    "time is the goal specifying the maximum repair time of an ambiguity group.",
    "RT(AGi) is the actual repair time of AGi.",
    "P(AGi) is the probability of repair item set AGi.",
    "mdl is the diagnostic model.",
    "lvl is the level of the diagnostic model.",
    "n is the total number of repair item ambiguity groups for the lvl and mdl",
    "The delta function returns zero if the repair time for an ambiguity group is less than the specified goal of 60 minutes",
    "An alternative version of this metric could penalize for exceeding the goal by too much",
    "This subclause is informative only and is not a normative part of this standard",
    "Projected effect of ambiguity on false removals (PEAFR) is a measure of the effect that ambiguous isolation has on the frequency of false removals",
    "PEAFR is described by Equation (10)",
    "AGi is the ith repair item ambiguity group",
    "P(AGi) is the probability of repair item set (AGi)",
    "mdl is the diagnostic model for which this metric is to be calculated",
    "lvl is the level of the diagnostic model at which faults are to be counted",
    "n is the total number of repair item ambiguity groups for the lvl and mdl",
    "PEAFR gives the worst-case percentage of false removals because of diagnostic ambiguity for the specified level of the given diagnostic model",
    "PEAFR projects the relative likelihood of false removals when malfunctions occur",
    "PEAFR is calculated using the formula: PEAFR = (1/n) * Σ(P(AGi) * RT(AGi))",
    "PEAFR is calculated using the formula: PEAFR = (1/n) * Σ(P(AGi) * AGi)",
    "The product life cycle process is related to diagnostic analysis and design.",
    "A comprehensive diagnostic analysis and design program requires a dedicated effort.",
    "The diagnostic design life cycle is organized around five phases.",
    "The five phases are: Requirements definition, Architecture design, Detailed test design, Verification and validation, and Diagnostic maturation.",
    "Each phase is described in a separate section.",
    "Requirements definition is the first step in an effective testability program.",
    "Diagnostic requirements are expressed in performance terms.",
    "Diagnostic requirements express the desired outcome without directing how to achieve it.",
    "Goals are specified for fault detection, fault isolation, and fault isolation resolution.",
    "Mission reliability is a related requirement examined early in the design phase.",
    "Mission reliability measures the prognostic capability of a system to satisfy mission requirements.",
    "Mean time between failure, operational availability, and other metrics may be specified at this time.",
    "Requirements definition is the first step in an effective testability program.",
    "Diagnostic requirements are expressed in performance terms.",
    "Diagnostic requirements express the desired outcome without directing how to achieve it.",
    "Goals are specified for fault detection, fault isolation, and fault isolation resolution.",
    "Diagnostic requirements are typically expressed in performance terms.",
    "Requirements are used to manage diagnostic analysis and development.",
    "Requirements assure that the product will satisfy customer needs and expectations.",
    "Diagnostic requirements are related to fault detection, fault isolation, and fault isolation resolution.",
    "Mission reliability is a related requirement examined early in the design phase.",
    "Mission reliability measures the prognostic capability of a system to satisfy mission requirements.",
    "Mean time between failure, operational availability, and other metrics may be specified at this time.",
    "Requirements are used to manage diagnostic analysis and development.",
    "Mission reliability is a related requirement examined early in the design phase.",
    "Mission reliability measures the prognostic capability of a system to satisfy mission requirements.",
    "Mean time between failure, operational availability, and other metrics may be specified at this time.",
    "Mean time between failure is a system-level metric.",
    "Operational availability is a system-level metric.",
    "Can not duplicate/no evidence of failure rate is a system-level metric.",
    "Mean time between unscheduled maintenance actions is a system-level metric.",
    "Derivative requirements include mean time to repair and maintenance frequency.",
    "Customer warranties may be executed on some metrics.",
    "Customer warranties may be executed on mean time between failure.",
    "Customer warranties may be executed on operational availability.",
    "Customer warranties may be executed on total operating hours.",
    "IEEE Std 1522-2004 is a standard.",
    "The standard is copyrighted by IEEE.",
    "The standard is from 2004.",
    "The standard has annex C.",
    "Annex C is normative.",
    "Annex C contains extensions to the AI-ESTATE standard.",
    "The AI-ESTATE standard is required by the probability_of_diagnosis and probability_of_repair_item_set measures.",
    "The AI-ESTATE standard is defined within IEEE Std 1232-2002.",
    "The AI-ESTATE standard allows a failure rate value to be assigned to each diagnosis.",
    "The AI-ESTATE standard is extended in annex C.",
    "The extension redefines the diagnosis entity in the common element model.",
    "The common element model is defined within IEEE Std 1232-2002.",
    "The AI-ESTATE common element model is used in the extension.",
    "The extension is for the failure rate entity.",
    "The failure rate entity is a subtype of the failure_rate entity.",
    "The failure_rate entity is in the AI-ESTATE common element model.",
    "The failure_rate entity has a subtype called EXTEND_failure_rate.",
    "EXTEND_failure_rate is an abstract entity.",
    "EXTEND_failure_rate is a subtype of the failure_rate entity.",
    "EXTEND_failure_rate contains the frequency value for the associated failure rate.",
    "EXTEND_failure_rate has two subtypes: EXTEND_weibull_failure_rate and EXTEND_exponential_failure_rate.",
    "EXTEND_failure_rate is a subtype of the failure_rate entity.",
    "EXTEND_failure_rate is in the AI-ESTATE common element model.",
    "EXTEND_failure_rate contains the frequency value for the associated failure rate.",
    "EXTEND_failure_rate has a subtype called EXTEND_weibull_failure_rate.",
    "EXTEND_weibull_failure_rate is a subtype of the EXTEND_failure_rate entity.",
    "EXTEND_weibull_failure_rate is used when the associated failure rate is the result of a Weibull distribution.",
    "EXTEND_weibull_failure_rate has two attributes: alpha and beta.",
    "IEEE Std 1522-2004 is a standard for testability and trial-use.",
    "The standard is copyrighted by IEEE.",
    "The standard is from 2005.",
    "The standard has attribute definitions.",
    "The attribute definitions are for the associated_frequency attribute.",
    "The associated_frequency attribute is used to specify the rate of failures associated with a diagnosis.",
    "The associated_frequency attribute is used over a given time span.",
    "EXTEND_weibull_failure_rate is a subtype of the EXTEND_failure_rate entity.",
    "EXTEND_weibull_failure_rate has two attributes: alpha and beta.",
    "beta is a REAL.",
    "beta is an attribute.",
    "alpha is an attribute.",
    "alpha is used to specify the alpha parameter of the Weibull distribution.",
    "beta is used to specify the beta parameter of the Weibull distribution.",
    "EXTEND_exponential_failure_rate is a subtype of EXTEND_failure_rate.",
    "EXTEND_exponential_failure_rate is used when the associated failure rate is the result of an exponential distribution.",
    "EXTEND_exponential_failure_rate is a subtype of EXTEND_failure_rate.",
    "EXTEND_exponential_failure_rate is used when the associated failure rate is the result of an exponential distribution.",
    "EXTEND_diagnosis is a subtype of diagnosis.",
    "EXTEND_diagnosis contains the failure rate for the associated diagnosis.",
    "new_rate is an attribute.",
    "new_rate is used to specify the failure rate associated with the given diagnosis."
  ],
  "created_at": "20260121_124618Z",
  "meta": {
    "mode": "chunks",
    "num_docs": 184,
    "use_batch_decomposer": true,
    "batch_size": 4,
    "num_batches": 46,
    "parallel": true,
    "max_workers": 2
  }
}