{
  "num_qualities": 137,
  "qualities": [
    "The Handreichung zur Einsichtnahme in Prüfungen und Prüfungsbewertungen is a DeepL translation.",
    "DeepL is excellent at translating.",
    "There is no guarantee that a DeepL translation is 100% correct.",
    "A DeepL translation may not be correct in a legal sense.",
    "The Handreichung zur Einsichtnahme in Prüfungen und Prüfungsbewertungen is a handout for students.",
    "Students have the right to inspect exam documents.",
    "Students can assert their right to inspect exam documents.",
    "Students have obligations associated with inspecting exam documents.",
    "The inspection of examinations provides students with information about gaps in knowledge and understanding.",
    "The inspection of examinations makes the assessment of the examination comprehensible.",
    "The inspection of examinations involves a critical examination of the assessment.",
    "Students can raise substantiated objections against the assessment in cases of doubt.",
    "Explanations with examiners are not part of the inspection.",
    "The inspection concerns all examination formats.",
    "The inspection mainly concerns the assessment of written examinations.",
    "Every student has the right to inspect their own examinations.",
    "Every student has the right to inspect their own evaluations.",
    "The right to inspection exists for every independent part of an examination.",
    "The right to inspection exists if the examination is a prerequisite for subsequent modules.",
    "The right to inspection exists if the grade is mentioned in subsequent modules.",
    "Certificates or overall grades are formed from the examination.",
    "The inspection takes place after the conclusion of the examination procedure.",
    "The inspection takes place after the performance has been completely determined and announced.",
    "The inspection takes place before a repeat examination.",
    "The inspection takes place with sufficient advance notice before an oral supplementary examination.",
    "The right to inspection exists only if the student has a legitimate interest in inspection.",
    "A legitimate interest in inspection exists if the findings of an inspection can be used to claim a reconsideration of the examination.",
    "There is no entitlement to inspection if the examination was graded 1.0.",
    "The right of inspection includes examiner's notes.",
    "The right of inspection includes expert opinions.",
    "The right of inspection includes minutes of the evaluation.",
    "The right of inspection includes statements.",
    "The right of inspection includes possible counter-opinions.",
    "The right of inspection does not include notes.",
    "The right of inspection does not include sketches.",
    "The right of inspection does not include recordings.",
    "The right of inspection does not include solution notes.",
    "The right of inspection does not include evaluation schemes.",
    "There is no right to inspect sample solutions.",
    "An exception exists if the examiner refers to documents beforehand.",
    "It is not possible to inspect examination files of other examinees.",
    "Students should contact the examiner as soon as possible after learning of the examination result.",
    "Students should informally request inspection from the examiner.",
    "The request for inspection does not have to be in any particular form.",
    "Students can request inspection by email or telephone.",
    "In distance learning programs, the request for inspection must be sent directly to the DISC.",
    "Inspection should be made possible promptly after the announcement of the evaluation.",
    "The inspection takes place on the premises of the TU Kaiserslautern.",
    "The inspection takes place during the usual office hours.",
    "The inspection is scheduled for written examinations.",
    "The inspection is scheduled at the latest with the scheduling of the written examination.",
    "Candidates must make it clear within one week that they feel they have been assessed unfairly.",
    "Candidates must make it clear within one week that they cannot understand the assessment.",
    "Candidates must make it clear within one week that they are considering raising objections to the assessment.",
    "Departments are free to organize the inspection collectively as a group inspection.",
    "Students have to inform themselves in time how the inspection is organized in their field of teaching.",
    "Students must be given sufficient time for the inspection.",
    "The duration of the inspection should depend on the scope of the examination.",
    "Students can inform themselves sufficiently about the content of the examination evaluation under reasonable conditions.",
    "Students who stay abroad are unable to attend the regular appointments.",
    "Students who have a verifiable illness are unable to attend the regular appointments.",
    "Students must be offered an additional appointment upon informal request.",
    "Students must be allowed to make copies.",
    "Students must be allowed to make photocopies at their own expense.",
    "Students may make their own notes during the inspection.",
    "Students are permitted to make a photocopy in the form of photographs.",
    "The department decides whether copies are sent by post.",
    "There is no obligation to hand out a copy or photocopy during the inspection appointment.",
    "Students have the opportunity to receive copies promptly from the teaching area.",
    "Students have no right to electronic transmission of the copy.",
    "Electronic transmission of the copy is at the discretion of the department.",
    "Electronic transmission of the copy must be done in a secure way.",
    "Electronic transmission of the copy can be done via signed and encrypted e-mail.",
    "Electronic transmission of the copy can be done via download from an access-secured server.",
    "Sending to the RHRK account is a secure way to transmit the copy.",
    "Students bear the costs incurred by making the copies.",
    "Students must bear the costs of making copies.",
    "Students will be charged for making copies based on the TU's scale of charges.",
    "Students will receive a separate invoice for making copies.",
    "Students can only use photocopies to check the assessment.",
    "Examinations, reports, minutes, etc. are protected by copyright.",
    "Questions and comments in examinations, reports, minutes, etc. are protected by copyright.",
    "Dissemination of copyrighted materials is not permitted.",
    "Public reproduction of copyrighted materials is not permitted.",
    "Use of copyrighted materials is not permitted.",
    "Disclosure of copyrighted materials to third parties is not permitted.",
    "Violations of copyright can have consequences under civil law.",
    "Violations of copyright can have consequences under criminal law.",
    "Examiners do not have to supervise the inspection themselves.",
    "Examiners do not have to accompany the inspection themselves.",
    "Examiners may appoint competent staff members for inspection.",
    "Staff members can provide initial expert information.",
    "It is possible to represent a student in the inspection procedure.",
    "A student can be represented in the inspection procedure in case of hospitalization.",
    "A student can be represented in the inspection procedure in case of a stay abroad.",
    "Authorization includes filing the application.",
    "Authorization includes receiving a copy.",
    "Authorization does not include discussing the examination during inspection.",
    "Discussion of the examination during inspection is a personal matter.",
    "Authorized attorneys are exempt from this rule.",
    "Authorized attorneys are exempt from this rule.",
    "Authorized representatives must be able to identify themselves at the appointment.",
    "Authorized representatives must present a power of attorney at the appointment.",
    "The original grade should not be changed to the student's disadvantage during the review process.",
    "After inspection, students are free to approach the department/examiner or DISC with a reconsideration request.",
    "The student must state objections to the evaluation.",
    "Objections can only be considered if they are substantiated.",
    "Objections must be substantiated in a concrete and comprehensible manner.",
    "The substantiation must clearly state the examiner's misjudgement.",
    "A general reference to other students' evaluations is not sufficient.",
    "Students who received a notice of examination result must state objections in writing.",
    "The time limit for appeal is one month from the date of notification.",
    "The time limit for appeal is stated in the instructions on appeal.",
    "No extension of the time limit for appeal occurs by inspection and independent request for reconsideration.",
    "An objection can be filed in parallel within the time limit.",
    "The reconsideration procedure can be continued within the time limit.",
    "Students can have justified doubts about the examiner's decision.",
    "Students can discuss the examiner's decision with the examiner.",
    "An appeal can be made against the assessment.",
    "The evaluation is reviewed again via an internal administrative procedure.",
    "The examiner leaves the assessment unchanged if there are no procedural errors or assessment deficiencies.",
    "The objection is rejected if the examiner leaves the assessment unchanged.",
    "The objection is rejected if there are no procedural errors or assessment deficiencies.",
    "Students have the right to take legal action before the administrative court after the appeal procedure.",
    "Appeal proceedings are subject to a fee.",
    "The costs of appeal proceedings are based on the time and effort required to prepare and justify the notice of appeal.",
    "The rights of the students may not be restricted by the implementation of a digitally conducted examination.",
    "The rights of the students may not be restricted by the implementation of a digital inspection.",
    "The right to comprehensive inspection is a right of the students.",
    "The right to copying for their own purposes is a right of the students.",
    "The implementation of a digitally conducted examination is in the teaching area of Main department 4.",
    "Marc Frey is in Main department 4.",
    "Miriam Gärtner is in Main department 4.",
    "Katharina Franck is in Main department 4.",
    "Marc Frey's phone number is 0631 205 2215.",
    "Miriam Gärtner's phone number is 0631 205 4087.",
    "Katharina Franck's phone number is 0631 205 5767."
  ],
  "created_at": "20260120_145630Z",
  "meta": {
    "mode": "chunks",
    "num_docs": 18
  }
}