{
  "num_qualities": 954,
  "qualities": [
    "IEEE Std 1522-2004 is a trial-use standard.",
    "IEEE Std 1522-2004 is for testability and diagnosability characteristics and metrics.",
    "IEEE Standards Coordinating Committee 20 sponsored IEEE Std 1522-2004.",
    "IEEE Std 1522-2004 was approved on 23 September 2004.",
    "IEEE Std 1522-2004 provides standard definitions of testability and diagnosability metrics and characteristics.",
    "IEEE Std 1522-2004 is related to aggregation fundamentals.",
    "IEEE Std 1522-2004 is related to cost-related fundamentals.",
    "IEEE Std 1522-2004 is related to diagnosability.",
    "IEEE Std 1522-2004 is related to diagnostic inference model.",
    "IEEE Std 1522-2004 is related to fault tree model.",
    "IEEE Std 1522-2004 is related to metrics.",
    "IEEE Std 1522-2004 is related to testability.",
    "IEEE Standards documents are developed within IEEE Societies.",
    "IEEE Standards documents are developed within Standards Coordinating Committees of IEEE-SA Standards Board.",
    "IEEE develops its standards through a consensus development process.",
    "The consensus development process is approved by the American National Standards Institute.",
    "Volunteers represent varied viewpoints and interests in the consensus development process.",
    "Volunteers serve without compensation in the consensus development process.",
    "IEEE disclaims liability for any personal injury.",
    "IEEE disclaims liability for any property damage.",
    "IEEE disclaims liability for any other damage.",
    "IEEE does not warrant or represent the accuracy of the material contained herein.",
    "IEEE does not warrant or represent the content of the material contained herein.",
    "IEEE disclaims any express or implied warranty.",
    "IEEE disclaims any implied warranty of merchantability.",
    "IEEE disclaims any implied warranty of fitness for a specific purpose.",
    "The use of the material contained herein is free from patent infringement.",
    "IEEE Standards documents are supplied AS IS.",
    "The existence of an IEEE Standard does not imply that there are no other ways to produce goods and services.",
    "The viewpoint expressed at the time a standard is approved and issued is subject to change.",
    "Comments received from users of the standard can bring about changes in the standard.",
    "Every IEEE Standard is subjected to review at least every five years.",
    "When a document is more than five years old, it is reasonable to conclude that its contents do not wholly reflect the present state of the art.",
    "Users are cautioned to check to determine that they have the latest edition of any IEEE Standard.",
    "The IEEE is not suggesting or rendering professional or other services for any person or entity.",
    "The IEEE is not undertaking to perform any duty owed by any other person or entity to another.",
    "Any person utilizing this, and any other IEEE Standards document, should rely upon the advice of a competent professional.",
    "Interpretations of standards should have also received the concurrence of a balance of interests.",
    "IEEE and the members of its societies and Standards Coordinating Committees are not able to provide an instant response to interpretation requests.",
    "At lectures, symposia, seminars, or educational courses, an individual presenting information on IEEE standards should make it clear that his or her views should be considered the personal views of that individual.",
    "Comments for revision of IEEE Standards are welcome from any interested party.",
    "At lectures, symposia, seminars, or educational courses, an individual presenting information on IEEE standards should make it clear that his or her views should be considered the personal views of that individual.",
    "IEEE provides guidelines for suggested changes in documents.",
    "Comments on standards and requests for interpretations should be addressed to the IEEE-SA Standards Board.",
    "Authorization to photocopy portions of any individual standard is granted by the Institute of Electrical and Electronics Engineers, Inc.",
    "Permission to photocopy portions of any individual standard for educational classroom use can also be obtained through the Copyright Clearance Center.",
    "The IEEE shall not be responsible for identifying patents for which a license may be required by an IEEE standard.",
    "Danvers, MA 01923 USA is the address for the Copyright Clearance Center.",
    "Permission to photocopy portions of any individual standard for educational classroom use can also be obtained through the Copyright Clearance Center.",
    "The IEEE shall not be responsible for identifying patents for which a license may be required by an IEEE standard.",
    "The IEEE Trial-Use Standard for Testability and Diagnosability Characteristics and Metrics is not part of the introduction.",
    "The objective of the testability initiative is to make systems easier to test.",
    "The IEEE 1232TM Artificial Intelligence Exchange and Service Tie to All Test Environments series of standards provide the foundation for precise and unambiguous testability and diagnosability metrics.",
    "The objective of this standard is to provide notionally correct and inherently useful but mathematically precise definitions of testability measures.",
    "The IEEE 1232TM Artificial Intelligence Exchange and Service Tie to All Test Environments series of standards provide the foundation for precise and unambiguous testability and diagnosability metrics.",
    "The objective of this standard is to provide notionally correct and inherently useful but mathematically precise definitions of testability measures.",
    "Errata can be accessed at http://standards.ieee.org/reading/ieee/updates/errata/index.html.",
    "Users are encouraged to check this URL for errata periodically.",
    "Current interpretations can be accessed at http://standards.ieee.org/reading/ieee/interp/index.html.",
    "Patents may be required to implement this standard.",
    "The IEEE shall not be responsible for identifying patents or patent applications for which a license may be required.",
    "Publication of this trial-use standard has been approved by the Institute of Electrical and Electronics Engineers.",
    "Trial-use standards are effective for 24 months from the date of publication.",
    "Comments for revision will be accepted for 18 months after publication.",
    "Suggestions for revision should be directed to the Secretary, IEEE-SA Standards Board.",
    "Comments for revision should be directed to the Secretary, IEEE-SA Standards Board.",
    "Suggestions for revision should be received no later than 23 March 2006.",
    "This trial-use standard shall be submitted to the IEEE-SA Standards Board for approval as a full-use standard after 24 months.",
    "Mark A. Kaufman is the Co-chair of the Diagnostic & Maintenance Control subcommittee.",
    "Tim Wilmering is the Co-Chair of the Diagnostic & Maintenance Control subcommittee.",
    "The following members of the individual balloting committee voted on this trial-use standard.",
    "Steve M. Mills is the Vice Chair of the IEEE-SA Standards Board.",
    "Judith Gorman is the Secretary of the IEEE-SA Standards Board.",
    "Satish K. Aggarwal is the NRC Representative on the IEEE-SA Standards Board.",
    "Richard DeBlasio is the DOE Representative on the IEEE-SA Standards Board.",
    "Li Pi Su",
    "William J. Taylor",
    "Joerg H. Urban",
    "J. Richard Weger",
    "Antony Bartolini",
    "Amanda Jane Giarla",
    "Martin Baur",
    "Tommy Cooper",
    "Hermann Koch",
    "Thomas J. McGean",
    "Daleep C. Mohla",
    "Paul Nikolich",
    "T. W. Olsen",
    "Ronald C. Petersen",
    "Gary S. Robinson",
    "Frank Stone",
    "References",
    "Definitions",
    "Context",
    "Fundamental measures",
    "Annex A is informative.",
    "Annex B is informative.",
    "Annex C is normative.",
    "The AI-ESTATE standard has extensions.",
    "Authorized use is limited to Technische Universitat Kaiserslautern.",
    "The document was downloaded from IEEE Xplore.",
    "Restrictions apply to the document.",
    "The document was downloaded on August 21, 2024.",
    "Authorized use is limited to Technische Universitat Kaiserslautern.",
    "The document was downloaded from IEEE Xplore.",
    "Restrictions apply to the document.",
    "The document was downloaded on August 21, 2024.",
    "Copyright 2005 IEEE.",
    "All rights are reserved by IEEE.",
    "IEEE developed the standard for testability and diagnosability characteristics and metrics.",
    "The standard was developed by the Diagnostic and Maintenance Control subcommittee.",
    "The standard was developed for the IEEE Standards Coordinating Committee 20.",
    "The standard provides standard definitions of testability and diagnosability metrics and characteristics.",
    "The standard builds on fundamental definitions derived from IEEE Std 1232TM-2002.",
    "The goals of the standard are to provide standard definitions.",
    "Provide definitions of testability and diagnosability characteristics and metrics that are independent of specific test and diagnosis technologies.",
    "Provide definitions of testability and diagnosability characteristics and metrics that are independent of specific system under test technologies.",
    "Provide unambiguous definitions of testability and diagnosability metrics used by procurement and support organizations.",
    "Lord Kelvin commented that when you can measure what you are speaking about and express it in numbers, you know something about it.",
    "Lord Kelvin commented that when you cannot measure it, you cannot express it.",
    "Lord Kelvin commented that when you can measure what you are speaking about and express it in numbers, your knowledge is of a meager and unsatisfactory kind.",
    "Lord Kelvin commented that when you cannot measure it, your knowledge is of a meager and unsatisfactory kind.",
    "Lord Kelvin commented that when you can measure what you are speaking about and express it in numbers, you know something about it; and when you cannot measure it, you cannot express it",
    "Lord Kelvin’s insight is that when different tools measure something differently, and the basis for the measurement is not known or understood, it is neither knowledge nor science.",
    "The objective of this standard is to provide precise formal definitions of metrics that may be used to predict the testability of a system.",
    "Predictive metrics may be used iteratively during various phases of design and diagnostic development to map the progress toward a project’s testability goals.",
    "Empirical metrics are derived from actual maintenance data to determine the testability achieved during the factory and field testing of a system.",
    "Information for references can be found in Clause 2.",
    "IEEE Std 1522-2004 is a trial-use standard for testability and diagnosability.",
    "Predictive testability and diagnosability metrics are defined based on IEEE Std 1232-2002.",
    "Entities required that have not been defined in these information models are provided by this standard in the form of an AI-ESTATE extension.",
    "This standard does not impose any implementation-specific requirements for actually computing the metrics.",
    "Metrics not computed using the identified standard information models must be demonstrated to be mathematically equivalent to the definitions provided.",
    "This standard defines technology-independent testability and diagnosability characteristics and metrics.",
    "This standard defines testability and diagnosability characteristics and metrics based on relevant standard information models, including standard AI-ESTATE information models.",
    "This standard assumes that no more than a single independent fault exists at the time of diagnostics.",
    "Multiple fault metrics are outside the scope of this standard because of a lack of industry consensus as to how those metrics should be calculated.",
    "This standard provides consistent definitions of testability and diagnosability characteristics and metrics.",
    "A common basis for system testability and diagnosability assessment will be provided.",
    "Specifications in the EXPRESS language are given in the Courier type font.",
    "The standard uses the vocabulary and definitions of relevant IEEE standards.",
    "Specifications in the EXPRESS language include references to entity and attribute names in the supporting text.",
    "IEEE Std 1232-2002 takes precedence in case of conflict of definitions.",
    "Portions of IEEE Std 1232-2002 are repeated in this standard for clarity.",
    "This standard shall be used in conjunction with IEEE Std 1232-2002.",
    "The current, approved version of IEEE Std 1232-2002 takes precedence in case of revision to AI-ESTATE.",
    "IEEE publications are available from the Institute of Electrical and Electronics Engineers.",
    "ISO publications are available from the ISO Central Secretariat.",
    "ISO publications are also available in the United States from the Sales Department, American National Standards Institute.",
    "Authorized licensed use limited to: Technische Universitat Kaiserslautern.",
    "Downloaded on August 21,2024 at 11:55:44 UTC from IEEE Xplore.",
    "Restrictions apply.",
    "The Authoritative Dictionary of IEEE Standards and Terms, Seventh edition should be referenced for terms not defined in this clause.",
    "The standard describes its behavior under test.",
    "The behavior under test may or may not be measurable during actual system operation or maintenance.",
    "Faults in a system can be localized.",
    "Fault localization can be done frequently and unambiguously.",
    "Fault localization can be done efficiently.",
    "Faults are measured during system operation and maintenance.",
    "Fault isolation is to be performed efficiently.",
    "Systems became more complex, costly, and difficult to diagnose and repair.",
    "Initiatives were started to address these problems.",
    "Test points are needed in the right places.",
    "System design has to include characteristics to make the system easier to test.",
    "Testability is considered as a design characteristic.",
    "Testability is a design characteristic which allows the status of an item to be determined.",
    "Fault isolation within an item can be performed in a timely manner.",
    "MIL-STD-2165 provides uniform procedures and methods to control planning, implementation, and verification of testability.",
    "MIL-STD-2165 provides useful guidance to government suppliers.",
    "Commercial system developers have used MIL-STD-2165 to guide their activities.",
    "Testability is made up of two related practices.",
    "Design for test facilitates the testing process by encouraging good design practices.",
    "Diagnosability is evaluated within the discipline of testability.",
    "Formal, unambiguous definitions of testability and diagnosability metrics and characteristics have been unavailable.",
    "This standard defines metrics related to fault detection and isolation.",
    "Fault detection metrics are represented as a ratio of detected or detectable faults to the full set of possible faults.",
    "The ratio is weighted using the failure rates of the faults within the fault universe.",
    "IEEE Std 1522-2004 is a trial-use standard.",
    "IEEE Std 1522-2004 is for testability and diagnosability.",
    "Fault isolation metrics are based on a ratio of faults in ambiguity groups.",
    "Fault isolation calculations are frequently weighted using failure rates.",
    "Testability has been concerned with fault detection and fault isolation.",
    "Testability has been concerned with false indication issues.",
    "No consensus exists in the test industry for predicting false indication.",
    "This standard will defer specification of metrics for false indication.",
    "False indication issues are complex.",
    "No consensus exists in the test industry for predicting false indication.",
    "This standard distinguishes between predictive and empirical metrics.",
    "Predictive metrics include testability and diagnosability metrics.",
    "Empirical metrics are derived from collected maintenance data.",
    "Clause 5 provides several fundamental measures for testability and diagnosability.",
    "Fundamental measures are defined using the AI-ESTATE information models.",
    "Clause 6 uses fundamental measures to define standard metrics.",
    "Predictive metrics are derived from a static AI-ESTATE-compliant model.",
    "Empirical metrics are beyond the scope of this standard.",
    "Clause 5 provides several fundamental measures for testability and diagnosability.",
    "Fundamental measures are defined using the AI-ESTATE information models.",
    "Clause 6 uses fundamental measures to define standard metrics.",
    "The standard defines the architecture of an AI-ESTATE-conformant system.",
    "The standard defines the information models for knowledge and data exchange.",
    "The standard defines a set of standard software services.",
    "Clause 5 provides several fundamental measures for testability and diagnosability.",
    "Fundamental measures are defined using the AI-ESTATE information models.",
    "Clause 6 uses fundamental measures to define standard metrics.",
    "The standard defines the architecture of an AI-ESTATE-conformant system.",
    "The standard defines the information models for knowledge and data exchange.",
    "The standard defines a set of standard software services.",
    "Detailed algorithms are not provided for fundamental measures.",
    "The purpose of this standard is to provide semantically rigorous definitions.",
    "IEEE Std 1232-2002 is an information exchange standard.",
    "IEEE Std 1232-2002 defines the architecture of an AI-ESTATE-conformant system.",
    "IEEE Std 1232-2002 defines the information models for knowledge and data exchange.",
    "IEEE Std 1232-2002 defines a set of standard software services.",
    "The standard defines the architecture of an AI-ESTATE-conformant system.",
    "The standard defines the information models for knowledge and data exchange.",
    "The standard defines a set of standard software services.",
    "The standard is for test and diagnosis.",
    "AI-ESTATE provides formal definitions of information required for test and diagnosis.",
    "AI-ESTATE is used as the basis for metrics defined within this standard.",
    "Clause 6 describes how to use fundamentals to develop metrics.",
    "Conformance demands that all metrics be computed as specified in Clause 6.",
    "The AI-ESTATE standard defines testability and diagnosability characteristics and metrics.",
    "The standard testability and diagnosability characteristics and metrics are defined in this standard.",
    "Metrics are computed as specified in Clause 6 for conformance.",
    "The standard provides an extensibility mechanism for future enhancement.",
    "Failure rate is accounted for by extending the AI-ESTATE models with the EXTEND schema.",
    "The EXTEND schema is used to extend the AI-ESTATE models.",
    "Extensions are nonconformant but an extensibility mechanism is provided.",
    "Extensions should be submitted to the D&MC Subcommittee for consideration.",
    "Proposed extensions are ranked in order of preference.",
    "Metrics are derived strictly from the fundamental measures of Clause 5.",
    "Metrics are derived from functions and measures based on the AI-ESTATE models.",
    "Metrics are derived from functions and measures based on the AI-ESTATE models in combination with AI-ESTATE-conformant extensions.",
    "The fundamental measures are categorized as either aggregation measures, cost-related measures, or measures to support detection and isolation metrics.",
    "The specific measures are listed in Table 1.",
    "The approach to defining standard, unambiguous testability and diagnosability metrics is based on the assumption that standard information models provide formal semantics for information of interest.",
    "Standard information models provide formal semantics for information of interest to the testability and diagnosability domain.",
    "The fundamental measures are defined using terminology from EXPRESS models defined in AI-ESTATE.",
    "The approach to specifying measures follows the conventions for defining services in AI-ESTATE.",
    "The primary information models used to define these measures are drawn from the AI-ESTATE standard.",
    "The AI-ESTATE common element model and fault tree models are used to define these measures.",
    "The specific models used include the AI-ESTATE common element model and fault tree models.",
    "The fundamental measures are based on the following propositions.",
    "The fundamental measures are defined using terminology from EXPRESS models defined in AI-ESTATE.",
    "The approach to specifying measures follows the conventions for defining services in AI-ESTATE.",
    "The primary information models used to define these measures are drawn from the AI-ESTATE standard.",
    "The AI-ESTATE common element model and fault tree models are used to define these measures.",
    "The specific models used include the AI-ESTATE common element model and fault tree models.",
    "The fundamental measures are based on the following propositions.",
    "The propositions include the AI-ESTATE common element model and fault tree models.",
    "The propositions are used to define the fundamental measures.",
    "All cost-related metrics are computed with respect to a single test or repair.",
    "Metrics are computed with respect to a single test or repair within the AI-ESTATE common element model.",
    "Isolation metrics are computed under the assumption that no more than a single, independent fault exists at the time of diagnostics.",
    "Isolation metrics are computed without dependence on diagnostic and maintenance strategies.",
    "The type of underlying diagnostic model will establish detectability and isolatability differently.",
    "The AI-ESTATE model defines the level entity to be the level of indenture for a particular hierarchical element.",
    "The type of underlying diagnostic model will establish detectability and isolatability differently.",
    "The AI-ESTATE model defines the level entity to be the level of indenture for a particular hierarchical element.",
    "Many measures are defined relative to a level defined within the AI-ESTATE model.",
    "The level entity is defined within the AI-ESTATE model.",
    "IEEE Std 1522-2004 is a trial-use standard for testability and diagnosability assessment.",
    "IEEE Std 1522-2004 is a standard for testability and diagnosability assessment.",
    "Copyright for IEEE Std 1522-2004 is held by IEEE.",
    "Copyright for IEEE Std 1522-2004 is reserved by IEEE.",
    "IEEE Std 1522-2004 defines the total repair non-time cost.",
    "IEEE Std 1522-2004 defines the total repair time cost.",
    "IEEE Std 1522-2004 defines the total test non-time cost.",
    "IEEE Std 1522-2004 defines the total test time cost.",
    "IEEE provides the definition of each aggregation fundamental to be used in more complex metric definitions.",
    "All fundamental measures are based on the AI-ESTATE common element model.",
    "Actions are the primary entities against which costs are associated.",
    "The diagnosis and repair process is concerned with optimizing the sequence of actions required to return a unit to service.",
    "The function action_set returns the set of all actions within a diagnostic model at a particular level.",
    "A diagnosis is defined by the information model to be a lattice of diagnostic conclusions.",
    "A diagnosis consists of failures or faults.",
    "The diagnoses can be interconnected in a lattice to classify constituent units by function.",
    "The function diagnosis_set returns the set of all diagnoses within a diagnostic model at a particular level.",
    "A failure mode is defined by the information model to be a specific mode or means by which a unit or system can fail.",
    "A failure mode is associated with the diagnosis and then with the item that has failed.",
    "The function failure_mode_set returns the set of all failure modes within a diagnostic model at a particular level.",
    "Failure modes are associated with diagnoses within the model.",
    "IEEE Std 1522-2004 is a trial-use standard for testability.",
    "IEEE Std 1522-2004 is a copyright of 2005 IEEE.",
    "All rights are reserved by IEEE.",
    "A failure is defined as a manifestation of an anomaly within a system.",
    "A failure is defined as the failure of the system under test to perform some intended function.",
    "The function failure_set returns the set of all failures within a diagnostic model at a particular level.",
    "A fault is defined as a physical cause of anomalous behavior within a system.",
    "A fault typically corresponds to some physical breakdown in the system under test.",
    "The function fault_set returns the set of all faults within a diagnostic model at a particular level.",
    "A function is defined as any functional behavior represented within a system.",
    "The function entity is intended to provide a placeholder for functional information in the event the diagnostic or testability model is function-oriented.",
    "The function function_set returns the set of all functions within a diagnostic model at a particular level.",
    "A repair item is defined as some part of the system to be adjusted, calibrated, repaired, replaced, etc.",
    "A diagnosis shall lead the maintainer to the object of the maintenance action.",
    "The function repair_item_set returns the set of all repair items within a diagnostic model at a particular level.",
    "A repair is defined as the process undertaken to return the unit to service.",
    "The function repair_set returns the set of all repairs within a diagnostic model at a particular level.",
    "A resource is defined as something that any given action in the maintenance process is likely to require to perform that action.",
    "resource_set returns the set of all resources within a diagnostic model at a particular level.",
    "resource_set is a function.",
    "resource_set takes two parameters: mdl and lvl.",
    "mdl is a diagnostic model.",
    "lvl is a level.",
    "resource_set returns a set of resources.",
    "The subclause provides the definition of each cost-related fundamental.",
    "All fundamental measures are based on the AI-ESTATE common element model.",
    "cost-related measures are defined in this standard.",
    "This standard applies the categories of cost types as specified in AI-ESTATE.",
    "The categories of cost types are time cost and non-time cost.",
    "Cost is computed over a set of tests or repairs.",
    "Cost calculations use associated test action costs, repair action costs, and resource costs.",
    "All cost calculations use the same units of measure.",
    "Cost calculations are based on resource cost.",
    "No unit conversion is included in the definition.",
    "measures are specified in four versions.",
    "Each version is associated with a particular level and a particular required context.",
    "Each version is associated with a particular level but all contexts.",
    "Each version is associated with a particular required context but all levels.",
    "Each version is associated with no level and no required context specified.",
    "The context refers to the required set of conditions.",
    "The context is specified within AI-ESTATE.",
    "The context is required when specified test, diagnosis, or repair is performed.",
    "A model structure is provided to capture failure rate information.",
    "The model structure is provided within AI-ESTATE.",
    "The failure rate is defined based on clock time or operating time.",
    "Clock time includes the time when the system is not in operation.",
    "Operating time does not include the time when the system is not in operation.",
    "The time basis attribute permits specification of a user-defined basis.",
    "The time basis attribute permits specification that the basis is unknown.",
    "IEEE 1232-2002 lacks an attribute.",
    "An extension to AI-ESTATE has been specified in Annex C.",
    "The function probability_of_diagnosis returns the conditional probability of a diagnosis given a specified set of diagnoses.",
    "The probability is calculated as the failure rate of the specified diagnosis, divided by the sum of the failure rates of the diagnoses in the specified set.",
    "The underlying distribution would be used to derive a probability at a specified point in time for the members of the set.",
    "The probability of diagnosis would be computed by normalizing over the specified set.",
    "The probability of diagnosis is computed relative to a specified set of diagnoses.",
    "The diagnosis for which the probability is being calculated is a member of the specified diagnosis set.",
    "No diagnosis in the relative diagnosis set is a child of another diagnosis in the specified diagnosis set.",
    "The time basis is consistent for all members of the diagnosis set.",
    "The set of diagnoses does not mix faults and failures.",
    "The diagnoses in the specified set are probabilistically independent of one another.",
    "The probability is then calculated using the extended diagnosis entity defined in Annex C.",
    "The measure probability_of_repair_item_set represents the probability that a set of repair items is diagnosed.",
    "The probability of a repair item is defined as the sum of the probabilities of diagnosis for all diagnoses tied to that repair item.",
    "No diagnosis in the repair item is a child of another diagnosis in the same repair item.",
    "The time basis is consistent for all diagnoses in the repair item.",
    "The set of diagnoses in the repair item does not mix faults and failures.",
    "Computing the probability of a diagnosis uses the probability_of_diagnosis function defined here.",
    "The diagnoses in the specified set are probabilistically independent of one another.",
    "IEEE Std 1522-2004 is a standard.",
    "The standard is for diagnosability characteristics and metrics.",
    "The standard is copyrighted by IEEE in 2005.",
    "The standard reserves all rights.",
    "The function probability_of_repair_item_set computes repair cost given a context.",
    "The function adds non-time cost of actions associated with performing a repair.",
    "The function is limited to resources and actions available in a required context.",
    "The function computes repair cost given the specified context.",
    "The function repair_context_non_time_cost computes repair cost given a context.",
    "The function adds non-time cost of actions associated with performing a repair.",
    "The function is limited to resources and actions available in a required context.",
    "The function computes repair cost given the specified context.",
    "The function repair_level_non_time_cost computes repair cost given a level.",
    "The function adds non-time cost of actions associated with performing a repair.",
    "The function is limited to resources and actions available at a particular level of indenture.",
    "The function computes repair cost given the specified level.",
    "The function repair_level_time_cost computes repair cost given a level.",
    "The function adds time cost of actions associated with performing a repair.",
    "The function is limited to resources and actions available at a particular level of indenture.",
    "The function computes repair cost given the specified level.",
    "The cost-related measure repair_non_time_cost adds the non-time cost of all actions.",
    "The cost-related measure repair_non_time_cost includes the costs of the actions' required resources.",
    "The cost-related measure repair_non_time_cost is limited to the resources and actions available in the required context.",
    "The cost-related measure repair_non_time_cost is limited to the resources and actions available at a particular level of indenture.",
    "The cost-related measure repair_non_time_cost computes repair cost given both the specified context and the specified level.",
    "The cost-related measure repair_time_cost adds the time cost of all actions.",
    "The cost-related measure repair_time_cost includes the costs of the actions' required resources.",
    "The cost-related measure repair_time_cost is limited to the resources and actions available in the required context.",
    "The cost-related measure repair_time_cost is limited to the resources and actions available in the required context.",
    "The cost-related measure repair_time_cost computes repair cost given both the specified context and the specified level.",
    "The cost-related measure test_context_non_time_cost adds the non-time cost of all actions.",
    "The cost-related measure test_context_non_time_cost includes the costs of the actions' required resources.",
    "The cost-related measure test_context_non_time_cost is limited to the resources and actions available in the required context.",
    "The cost-related measure test_context_time_cost adds the time cost of all actions.",
    "The cost-related measure test_context_time_cost includes the costs of the actions' required resources.",
    "The cost-related measure test_context_time_cost is limited to the resources and actions available in the required context.",
    "This function computes test cost given the specified context.",
    "Authorized licensed use limited to Technische Universitat Kaiserslautern.",
    "Downloaded on August 21,2024 at 11:55:44 UTC from IEEE Xplore.",
    "Restrictions apply.",
    "The cost-related measure test_context_time_cost is limited to the resources and actions available in the required context.",
    "The cost-related measure test_context_time_cost computes test cost given the specified context.",
    "The cost-related measure test_level_non_time_cost adds the non-time cost of all actions.",
    "The cost-related measure test_level_non_time_cost includes the costs of the actions' required resources.",
    "The cost-related measure test_level_non_time_cost is limited to the resources and actions available at a particular level of indenture.",
    "The cost-related measure test_level_non_time_cost computes test cost given the specified level.",
    "The cost-related measure test_level_non_time_cost is limited to the resources and actions available at a particular level of indenture.",
    "The cost-related measure test_level_non_time_cost computes test cost given the specified level.",
    "The cost-related measure test_level_time_cost adds the time cost of all actions.",
    "The cost-related measure test_level_time_cost includes the costs of the actions' required resources.",
    "The cost-related measure test_level_time_cost is limited to the resources and actions available at a particular level of indenture.",
    "This function computes test cost given the specified level.",
    "The function test_level_time_cost is a cost-related measure.",
    "The function test_level_time_cost is associated with performing the indicated test.",
    "The function test_level_time_cost is used to compute test cost.",
    "The function test_level_time_cost is used to compute test cost given the specified level.",
    "The cost-related measure test_non_time_cost adds the non-time cost of all actions.",
    "The cost-related measure test_non_time_cost includes the costs of the actions' required resources.",
    "The cost-related measure test_non_time_cost is limited to the resources and actions available in the required context at a particular level of indenture.",
    "This function computes test cost given both the specified context and the specified level.",
    "The function test_non_time_cost is a cost-related measure.",
    "The function test_non_time_cost is associated with performing the indicated test.",
    "The function test_non_time_cost is used to compute test cost.",
    "The function test_non_time_cost is used to compute test cost given both the specified context and the specified level.",
    "The cost-related measure test_time_cost adds the time cost of all actions.",
    "The cost-related measure test_time_cost includes the costs of the actions' required resources.",
    "The cost-related measure test_time_cost is limited to the resources and actions available in the required context at a particular level of indenture.",
    "This function computes test cost given both the specified context and the specified level.",
    "The function test_time_cost is a cost-related measure.",
    "The function test_time_cost is associated with performing the indicated test.",
    "The function test_time_cost is used to compute test cost.",
    "The function test_time_cost is used to compute test cost given both the specified context and the specified level.",
    "The cost-related measure total_repair_non_time_cost adds the non-time cost of all actions.",
    "The cost-related measure total_repair_non_time_cost includes the costs of the actions' required resources.",
    "The cost-related measure total_repair_non_time_cost has no limits to the resources and actions available based on required level or context.",
    "The function total_repair_non_time_cost is a cost-related measure.",
    "The function total_repair_non_time_cost is associated with performing the indicated repair.",
    "The function total_repair_non_time_cost is used to compute repair cost.",
    "The function total_repair_non_time_cost is used to compute repair cost with no limits to the resources and actions available.",
    "The function total_repair_non_time_cost is used to compute repair cost with no limits to the resources and actions available based on required level or context.",
    "The cost-related measure total_repair_time_cost adds the time cost of all actions.",
    "The cost-related measure total_repair_time_cost includes the costs of the actions' required resources.",
    "The cost-related measure total_repair_time_cost has no limits to the resources and actions available based on required level or context.",
    "The function total_repair_time_cost is a cost-related measure.",
    "The function total_repair_time_cost is associated with performing the indicated repair.",
    "The function total_repair_time_cost is used to compute repair cost.",
    "The function total_repair_time_cost is used to compute repair cost with no limits to the resources and actions available.",
    "The function total_repair_time_cost is used to compute repair cost with no limits to the resources and actions available based on required level or context.",
    "IEEE defined Std 1522-2004.",
    "The cost-related measure total_test_non_time_cost adds non-time cost of all actions.",
    "The cost-related measure total_test_time_cost adds time cost of all actions.",
    "No limits to resources and actions available based on required level or context.",
    "FUNCTION total_test_non_time_cost defined.",
    "FUNCTION total_test_time_cost defined.",
    "Cost-related measures defined in Std 1522-2004.",
    "IEEE has all rights reserved.",
    "FUNCTION total_test_non_time_cost defined.",
    "FUNCTION total_test_time_cost defined.",
    "No limits to resources and actions available based on required level or context.",
    "Diagnostic models defined in AI-ESTATE common element model.",
    "Diagnostic models include FTM, DIM, or EDIM.",
    "Diagnostic models include an instance of the diagnosis entity corresponding to No Fault.",
    "Diagnoses that are detectable or isolatable by the set of tests included in the model are identified.",
    "Diagnostic models used to specify measures include an instance of the diagnosis entity corresponding to No Fault.",
    "The ability to define metrics based on detection and isolation within a diagnostic model is fundamental.",
    "All diagnoses that are detectable or isolatable by the set of tests included in the model are identified.",
    "Metrics are to be computed based on a predefined universe of diagnoses and a predefined set of tests.",
    "Actual measures of isolation depend on the algorithms used to perform diagnosis.",
    "Several functions are defined to support definition of fundamental measures, standard metrics, and extended metrics.",
    "Functions are defined in 5.4.1–5.4.20.",
    "Derived types are defined to represent ambiguity groups and test signatures.",
    "Ambiguity groups and test signatures are represented by derived types.",
    "Derived types are defined to represent ambiguity groups and test signatures.",
    "Authorized licensed use limited to Technische Universitat Kaiserslautern.",
    "Downloaded on August 21,2024 at 11:55:44 UTC from IEEE Xplore.",
    "Restrictions apply.",
    "IEEE Std 1522-2004 is a trial-use standard.",
    "The standard is for testability and type.",
    "The function get_leaves takes a step from a fault tree model.",
    "The function returns a set of sets of diagnoses.",
    "The function get_signature takes a diagnosis and returns a set of test outcomes.",
    "The set of test outcomes is referred to as the test signature.",
    "The function get_ambig_group takes a repair item and returns a set of repair item ambiguity groups.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "The function get_signature takes a diagnostic model and a diagnosis.",
    "The function returns a signature.",
    "The function get_ambig_group takes a diagnostic model, a repair item, and a level.",
    "The function returns a set of repair item ambiguity groups.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "The function get_diag_ambig_group takes a diagnostic model, a diagnosis, and a level.",
    "The function returns a set of diagnosis ambiguity groups.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "Authorized licensed use is limited to Technische Universitat Kaiserslautern.",
    "The function get_size_n_ambig_group returns a set of repair item ambiguity groups.",
    "The function takes a diagnostic model, a level, and an integer.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "The function get_size_n_diag_ambig_group returns a set of diagnosis ambiguity groups.",
    "The function get_size_n_diag_ambig_group takes a diagnostic model, a level of indenture, and an integer n as input.",
    "The function get_size_n_diag_ambig_group must be a DIM, a FTM, or an EDIM.",
    "The function convert_repair_to_diag_ambiguity returns the set of diagnosis ambiguity groups.",
    "The function convert_repair_to_diag_ambiguity takes a diagnostic model, a level of indenture, and a set of repair item ambiguity groups as input.",
    "The function convert_repair_to_diag_ambiguity must be a DIM, a FTM, or an EDIM.",
    "The function convert_repair_to_diag_ambiguity returns the set of diagnosis ambiguity groups.",
    "The function convert_repair_to_diag_ambiguity takes a diagnostic model, a level of indenture, and a set of repair item ambiguity groups as input.",
    "The function convert_repair_to_diag_ambiguity must be a DIM, a FTM, or an EDIM.",
    "The function convert_diag_to_repair_ambiguity returns the set of repair item ambiguity groups.",
    "The function convert_diag_to_repair_ambiguity takes a diagnostic model, a level of indenture, and a set of diagnosis ambiguity groups as input.",
    "The function convert_diag_to_repair_ambiguity must be a DIM, a FTM, or an EDIM.",
    "The predicate repair_item_ambiguity takes a diagnostic model, a target repair item, a level of indenture, and a group size n as input.",
    "The predicate repair_item_ambiguity returns TRUE if the repair item exists in a repair item ambiguity group of exactly size n.",
    "The predicate repair_item_ambiguity returns FALSE otherwise.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "The predicate diagnosis_ambiguity takes a diagnostic model, a target diagnosis, a level of indenture, and a group size n as input.",
    "The predicate diagnosis_ambiguity returns TRUE if the diagnosis exists in a diagnosis ambiguity group of exactly size n.",
    "The predicate diagnosis_ambiguity returns FALSE otherwise.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "This function finds all diagnoses at a specified level of indenture that have no parents in the diagnosis hierarchy at the same level of indenture.",
    "This function returns a reduced set of diagnoses.",
    "This function takes a set of diagnoses and a level of indenture as input.",
    "The function single_level_detection finds all diagnoses at a specified level of indenture.",
    "The function single_level_detection has no parents in the diagnosis hierarchy at the same level of indenture.",
    "The function single_level_detection returns a reduced set of diagnoses.",
    "The function single_level_detection examines a diagnostic model.",
    "The function single_level_detection returns the set of implicated diagnoses within that model at a specified level of indenture",
    "An implicated diagnosis is a particular candidate diagnosis identified as a candidate explanation associated with an indicated test failure.",
    "An implicated diagnosis is a candidate explanation associated with an indicated test failure.",
    "An implicated diagnosis is identified as a candidate explanation associated with an indicated test failure.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "The function implicated_diagnosis_set examines a diagnostic model.",
    "The function implicated_diagnosis_set returns the set of implicated diagnoses within that model at a specified level of indenture",
    "The function implicated_diagnosis_set takes a diagnostic model and a level as input",
    "The fundamental function detectable_failure_set examines a diagnostic model.",
    "The fundamental function detectable_failure_set returns the set of detectable failures within that model at a specified level of indenture.",
    "The fundamental function detectable_failure_set takes a diagnostic model and a level as input.",
    "A detectable failure is also an implicated diagnosis.",
    "A detectable failure is a subtype of diagnosis.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "The function detectable_failure_set examines a diagnostic model",
    "The fundamental function detectable_fault_set examines a diagnostic model.",
    "The fundamental function detectable_fault_set returns the set of detectable faults within that model at a specified level of indenture.",
    "The fundamental function detectable_fault_set takes a diagnostic model and a level as input.",
    "A detectable fault is also an implicated diagnosis.",
    "A detectable fault is a subtype of diagnosis.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "The function detectable_fault_set examines a diagnostic model",
    "The fundamental function isolatable_repair_item_set takes a diagnostic model, a level of indenture, and a group size n as input.",
    "The fundamental function isolatable_repair_item_set returns the set of repair item ambiguity groups of exactly size n.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "The function isolatable_repair_item_set takes a BOOLEAN argument as input.",
    "The function isolatable_repair_item_set includes ambiguity with No Fault in the analysis.",
    "The function isolatable_repair_item_set examines a diagnostic model",
    "The function isolatable_repair_item_set returns the set of repair item ambiguity groups",
    "The function isolatable_diagnosis_set takes a diagnostic model as input.",
    "The function isolatable_diagnosis_set takes a level of indenture as input.",
    "The function isolatable_diagnosis_set takes a group size n as input.",
    "The function isolatable_diagnosis_set returns a set of diagnosis ambiguity groups.",
    "The function isolatable_diagnosis_set returns a set of diagnosis ambiguity groups of exactly size n.",
    "The function isolatable_diagnosis_set includes ambiguity with No Fault in the analysis if specified.",
    "The model specified for isolatable_diagnosis_set must be a DIM, a FTM, or an EDIM.",
    "The function isolatable_diagnoses_set takes a diagnostic model as input.",
    "The function isolatable_diagnoses_set takes a level of indenture as input.",
    "The function isolatable_diagnoses_set takes a group size n as input.",
    "The function isolatable_diagnoses_set returns a set of diagnosis ambiguity groups.",
    "The function isolatable_diagnoses_set returns a set of diagnosis ambiguity groups of exactly size n.",
    "The function isolatable_diagnoses_set includes ambiguity with No Fault in the analysis if specified.",
    "The model specified for isolatable_diagnoses_set must be a DIM, a FTM, or an EDIM.",
    "The function isolatable_failures_set takes a diagnostic model as input.",
    "The function isolatable_failures_set takes a level of indenture as input.",
    "The function isolatable_failures_set takes a group size n as input.",
    "The function isolatable_failures_set returns a set of diagnosis ambiguity groups.",
    "The function isolatable_failures_set returns a set of diagnosis ambiguity groups of exactly size n.",
    "The function isolatable_failures_set includes ambiguity with No Fault in the analysis if specified.",
    "The model specified for isolatable_failures_set must be a DIM, a FTM, or an EDIM.",
    "The function isolatable_faults_set takes a diagnostic model as input.",
    "The function isolatable_faults_set takes a level of indenture as input.",
    "The function isolatable_faults_set takes a group size n as input.",
    "The function isolatable_faults_set returns a set of diagnosis ambiguity groups.",
    "The function isolatable_faults_set returns a set of diagnosis ambiguity groups of exactly size n.",
    "The function isolatable_faults_set includes ambiguity with No Fault in the analysis if specified.",
    "The model specified for isolatable_faults_set must be a DIM, a FTM, or an EDIM.",
    "The function fault_ambig_set takes a diagnostic model as input.",
    "The function fault_ambig_set takes a level of indenture as input.",
    "The function fault_ambig_set takes a group size n as input.",
    "The function fault_ambig_set returns a set of diagnosis ambiguity groups.",
    "The function fault_ambig_set returns a set of diagnosis ambiguity groups of exactly size n.",
    "The function fault_ambig_set includes ambiguity with No Fault in the analysis if specified.",
    "The model specified for fault_ambig_set must be a DIM, a FTM, or an EDIM.",
    "IEEE Std 1522-2004 is a standard.",
    "The standard is about diagnostic characteristics and metrics.",
    "The standard is copyrighted by IEEE in 2005.",
    "The standard has all rights reserved.",
    "The standard defines a function called fault_ambig_set.",
    "The function takes a diagnostic model, a level, and a group size as input.",
    "The function returns a set of diagnosis ambiguity groups.",
    "The function includes an additional BOOLEAN argument.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "The standard defines a function called failure_ambig_set.",
    "The function takes a diagnostic model, a level, and a group size as input.",
    "The function returns a set of diagnosis ambiguity groups.",
    "The function includes an additional BOOLEAN argument.",
    "The standard became impractical to delineate all possible metrics.",
    "Metrics can be tailored to answer specific questions about the testability of a system.",
    "The standard does not exclude worthwhile metrics.",
    "The metrics in this clause all use fundamentals.",
    "Several metrics are included as informative, rather than as normative.",
    "The informative metrics illustrate the process of developing a metric.",
    "Metrics developed using the fundamentals can be submitted to the D&MC Subcommittee.",
    "The subclause provides definitions of the testability and diagnosability metrics.",
    "The metrics quantify the fault detection capability of a given diagnostic model.",
    "There are two detection metrics in this standard.",
    "One metric describes a diagnostic model’s fault detection capability as an unweighted percentage.",
    "The standard provides definitions of the testability and diagnosability metrics.",
    "The metrics quantify the fault detection capability of a given diagnostic model.",
    "There are two detection metrics in this standard.",
    "One metric describes a diagnostic model’s fault detection capability as an unweighted percentage.",
    "The other metric uses a percentage weighted by probability of diagnosis.",
    "The standard is authorized by IEEE.",
    "The standard is licensed for use by Technische Universitat Kaiserslautern.",
    "The standard is downloaded from IEEE Xplore.",
    "IEEE Std 1522-2004 is a standard.",
    "The standard is about testability and diagnosability.",
    "The standard is copyrighted by IEEE in 2005.",
    "The standard has all rights reserved.",
    "The standard defines a metric called Percentage of detection.",
    "The metric is described by Equation (1).",
    "The metric calculates the percentage of possible diagnoses at a particular level.",
    "The metric uses a specified diagnostic model and a given set of tests.",
    "EPoD is a failure probability-weighted percentage of possible diagnoses.",
    "EPoD is calculated within a specified diagnostic model.",
    "EPoD is calculated at a particular level within a model.",
    "EPoD is calculated using a given set of tests.",
    "EPoD is described by Equation (2).",
    "EPoD is calculated for a diagnostic model.",
    "EPoD is calculated at a specified level of a model.",
    "EPoD is calculated using tests defined within a model.",
    "This subclause provides definitions of testability and diagnosability metrics.",
    "There are six fault isolation metrics.",
    "The metrics quantify the fault isolation capability of a diagnostic model.",
    "Each fault isolation metric is described by an equation.",
    "The metrics include percentage of isolation, expected percentage of isolation, and others.",
    "The metrics are used to quantify the fault isolation capability of a model.",
    "The metrics are described by equations.",
    "The metrics are used to evaluate a diagnostic model.",
    "The first and sixth metrics are unweighted.",
    "The other four metrics are weighted using probability of diagnosis.",
    "The metrics include expected percentage of isolation, expected ambiguity group size, and others.",
    "The metrics are used to quantify the fault isolation capability of a model.",
    "The metrics are described by equations.",
    "The metrics are used to evaluate a diagnostic model.",
    "The metrics include isolation effectiveness and projected effect of ambiguity upon false removals.",
    "The metrics are used to evaluate a diagnostic model.",
    "Percentage of isolation consists of two individual equations.",
    "The incremental percentage of isolation is the percentage of all diagnosis ambiguity groups that can be isolated.",
    "The incremental percentage of isolation is described by Equation (3).",
    "The cumulative percentage of isolation is the percentage of all diagnosis ambiguity groups that can be isolated.",
    "The cumulative percentage of isolation is described by Equation (4).",
    "The incremental percentage of isolation is calculated for a particular level of a model.",
    "The cumulative percentage of isolation is calculated for a particular level of a model.",
    "The metrics are used to quantify the fault isolation capability of a model.",
    "Cumulative percentage of isolation is the percentage of all diagnosis ambiguity groups that can be isolated.",
    "Cumulative percentage of isolation is described by Equation (4).",
    "Cumulative percentage of isolation is calculated for a particular level of a model.",
    "Cumulative percentage of isolation is calculated using tests defined within a model.",
    "Cumulative percentage of isolation is calculated for a diagnostic model.",
    "Cumulative percentage of isolation is calculated at a specified level of a model.",
    "Cumulative percentage of isolation is calculated using a specified number of repair items.",
    "Cumulative percentage of isolation is calculated using the maximum size of an ambiguity group.",
    "n is the specified number of repair items",
    "Expected percentage of isolation consists of two individual equations",
    "The incremental expected percentage of isolation is the failure probability-weighted percentage of all diagnosis ambiguity groups",
    "The incremental expected percentage of isolation is described by Equation (5)",
    "The incremental expected percentage of isolation is the failure probability-weighted percentage of all diagnosis ambiguity groups that can be isolated using the tests defined within that model",
    "The incremental expected percentage of isolation contains a specified number of repair items",
    "The cumulative expected percentage of isolation is the failure probability-weighted percentage of all diagnosis ambiguity groups that can be isolated using the tests defined within that model",
    "The cumulative expected percentage of isolation is described by Equation (6)",
    "AGn is the UNION(RDn)",
    "RDn is the convert_repair_to_diag_ambiguity(mdl, lvl, RAGn)",
    "RAGn is the get_size_n_ambig_group(mdl, lvl, n)",
    "Di is the ith diagnosis in AGn",
    "P(Di) is the probability_of_diagnosis(Di, isld)",
    "isld is the the set returned by single_level_detection(ids, lvl)",
    "ids is the implicated_diagnosis_set(mdl, lvl)",
    "mdl is the diagnostic model for which this metric is to be calculated",
    "fault_ambig_set mdl lvl size , ( , ) size ∀∑",
    "fault_ambig_set mdl lvl n , ( , ) fault_ambig_set mdl lvl size , ( , ) size ∀∑",
    "Authorized licensed use limited to: Technische Universitat Kaiserslautern",
    "Downloaded on August 21,2024 at 11:55:44 UTC from IEEE Xplore",
    "Restrictions apply",
    "n is the specified number of repair items",
    "When calculating IEPoI, all repair item ambiguity groups of size n must first be found",
    "The probability of isolating to one ambiguity group is equal to the sum of the probabilities of the diagnoses associated with the repair items that caused the ambiguity",
    "IEPoI will then provide the probability of isolating to a repair item ambiguity group",
    "CEPoI provides the probability of isolating to a repair item ambiguity group of size n or less",
    "CEPoI is, for a particular level of a given diagnostic model, the failure probability-weighted percentage of all diagnosis ambiguity groups",
    "This metric is described by Equation (6)",
    "CEPoI is the failure probability-weighted percentage of all diagnosis ambiguity groups that can be isolated using the tests defined within that model",
    "n is the specified number of repair items",
    "CEPoI is the probability of isolating to a repair item ambiguity group of size n or less",
    "Expected ambiguity group size (EAGS) is a failure probability-weighted average number of repair items.",
    "EAGS is described by Equation (7).",
    "Equation (7) is: (7) where mdl is the diagnostic model for which this metric is to be calculated.",
    "mdl is the diagnostic model for which this metric is to be calculated.",
    "lvl is the level of the diagnostic model at which faults are to be counted.",
    "n is the maximum number of repair items in an ambiguity group in the model.",
    "This metric is described by Equation (7).",
    "Isolation effectiveness (IE) is a measure of how well the repair item ambiguity groups that can be isolated using tests defined within that model conform to a specified diagnostic goal.",
    "IE is, for a particular level of a given diagnostic model, a measure of how well the repair item ambiguity groups that can be isolated using tests defined within that model conform to a specified diagnostic goal.",
    "Typical goals include the ambiguity group size or the cost/time to isolate, replace or repair ambiguity groups.",
    "Let be the deviation of a function of x relative to the goal y.",
    "CEPoI mdl lvl n , ( , ) IEPoI mdl lvl i, ( , ) i = n ∑ = EAGS mdl lvl ( , ) i i = n ∑ IEPoI mdl lvl i, ( , ) i = n ∑",
    "Authorized licensed use limited to: Technische Universitat Kaiserslautern.",
    "Downloaded on August 21,2024 at 11:55:44 UTC from IEEE Xplore.",
    "Restrictions apply.",
    "IEEE DIAGONOSABLITY CHARACTERISTICS AND METRICS Std 1522-2004 Copyright",
    "Copyright  2005 IEEE.",
    "All rights reserved.",
    "Then the general form of this metric is described by Equation (8).",
    "Equation (8) is: (8) where AGi is the ith repair item ambiguity group goal is the goal (expressed as a lower bound/minimum) to which the calculated value for each ambi- guity group is to be compared (such as the target ambiguity group size or repair cost)",
    "lated mdl is the diagnostic model for which this metric is to be calculated.",
    "lvl is the level of the diagnostic model at which faults are to be counted.",
    "n is the total number of repair item ambiguity groups for the lvl and mdl.",
    "When all repair item ambiguity groups meet the specified goal, ((f(AGi),goal) will be equal to zero for all ambiguity groups.",
    "The isolation effectiveness metric will calculate to a value of 1.0 (100% effectiveness).",
    "x is set to AGi.",
    "f(AGi) is the size of repair item ambiguity group AGi.",
    "y is set to size.",
    "size specifies the maximum size.",
    "IEisol is the specific form of the isolation effectiveness metric.",
    "AGi is the ith repair item ambiguity group.",
    "|AGi| is the actual size of AGi.",
    "P(AGi) is the probability of repair item set AGi.",
    "n is the total number of repair item ambiguity groups for the lvl and mdl.",
    "setting size = 1 will test the ability to isolate to a single repair item.",
    "isolation effectiveness can be used to identify the effect of diagnostic ambiguity on a particular maintenance goal such as maximum repair time.",
    "be the repair time associated with AGi.",
    "RT(AGi) is the actual repair time of AGi.",
    "P(AGi) is the probability of repair item set AGi.",
    "mdl is the diagnostic model for which this metric is to be calculated.",
    "lvl is the level of the diagnostic model at which faults are to be counted.",
    "n is the total number of repair item ambiguity groups for the lvl and mdl",
    "n is the total number of repair item ambiguity groups for the lvl and mdl.",
    "time is set to 60.",
    "the delta function returns zero if the repair time for an ambiguity group is less than the specified goal of 60 minutes.",
    "PEAFR is a measure of the effect of ambiguous isolation on false removals.",
    "PEAFR is described by Equation (10).",
    "AGi is the ith repair item ambiguity group.",
    "AGi is the size of AGi.",
    "P(AGi) is the probability of repair item set AGi.",
    "mdl is the diagnostic model for which this metric is to be calculated.",
    "lvl is the level of the diagnostic model at which faults are to be counted.",
    "n is the total number of repair item ambiguity groups for the lvl and mdl.",
    "PEAFR gives the worst-case percentage of false removals because of diagnostic ambiguity.",
    "PEAFR projects the relative likelihood of false removals when malfunctions occur.",
    "PEAFR is calculated using the formula: PEAFR mdl lvl ( , ) P AGi ( ) AGi – ( ) × i = n ∑ P AGi ( ) i = n ∑ AGi ( ) ×",
    "n is the total number of repair item ambiguity groups for the lvl and mdl.",
    "PEAFR is equal to 1 minus IE with respect to isolation to a single failed repair item.",
    "PEAFR only quantifies the effect of diagnostic ambiguity on false removals.",
    "PEAFR is a measure of the effect of ambiguous isolation on false removals.",
    "PEAFR is described by Equation (10).",
    "PEAFR only quantifies the effect of diagnostic ambiguity on false removals.",
    "PEAFR is equal to 1 minus IE with respect to isolation to a single failed repair item.",
    "Repair item involvement ratio (RIIR) is, for a particular level of a given diagnostic model, the number of repair item ambiguity groups that contain a given repair item divided by the total number of ambiguity groups at that level that can be isolated using tests defined within that model.",
    "RIIR is described by Equation (11).",
    "AGRI is the get_ambig_group(mdl, RI, lvl).",
    "AGRI is the size of AGRI.",
    "RI is the repair item for which the RIIR is being calculated.",
    "mdl is the diagnostic model for which this metric is to be calculated.",
    "This subclause is informative only.",
    "This subclause is not a normative part of this standard.",
    "Fault detection and isolation metrics can be calculated over an entire design.",
    "Fault detection and isolation metrics can be calculated over an explicitly defined functional subset of that design.",
    "The following list provides some typical types of subsets that may be used to constrain the fault detection metrics for a design.",
    "Functionality can be used to constrain the fault detection metrics for a design.",
    "Technology can be used to constrain the fault detection metrics for a design.",
    "Operational usage can be used to constrain the fault detection metrics for a design.",
    "Hardware source can be used to constrain the fault detection metrics for a design.",
    "Operating mode can be used to constrain the fault detection metrics for a design.",
    "Test domain can be used to constrain the fault detection metrics for a design.",
    "Fault universe can be used to constrain the fault detection metrics for a design.",
    "The equations defined in this clause can be used to calculate the metrics for a particular functional subset of a design.",
    "The model must be constructed such that only the desired subset is represented.",
    "PEFR mdl lvl can be used to calculate the metrics for a particular functional subset of a design.",
    "IEisol mdl lvl can be used to calculate the metrics for a particular functional subset of a design.",
    "Fault detection and isolation metrics are frequently constrained by test class.",
    "Fault detection and isolation metrics are frequently constrained to calculate the fault coverage associated with different subsets of tests within the design.",
    "BIT type can be used to constrain analysis.",
    "Diagnostic usage can be used to constrain analysis.",
    "Test implementations can be used to constrain analysis.",
    "The equations defined in this clause can be used to calculate the metrics for a particular subset of tests within a design.",
    "The model must be constructed such that only the desired subset is represented.",
    "The diagnosis failure probabilities used to calculate the EPoD and EPoI are generally derived from failure rates.",
    "The diagnosis failure probabilities used to calculate the EPoD and EPoI are generally derived from failure rates.",
    "Failure rates describe expected rates of failure.",
    "Failure rates are usually expressed in terms of failures per million hours.",
    "The same metric equation can be used to calculate EPoD and EPoI over a specific time interval.",
    "EPoD and EPoI can be calculated over a specific time interval.",
    "The specified diagnostic model represents the number of failures.",
    "The specified diagnostic model represents the number of failures over an arbitrarily long time interval.",
    "The specified diagnostic model represents the number of failures over the first two years of deployment.",
    "failures are expected within a given time interval.",
    "failures are expected rather than the number of failures per million hours.",
    "IEEE published a standard for diagnosability characteristics and metrics.",
    "the standard is Std 1522-2004.",
    "the standard was published in 2004.",
    "the standard is copyrighted by IEEE.",
    "the standard is reserved for all rights.",
    "IEEE published a bibliography for testability.",
    "the bibliography includes multiple sources.",
    "the bibliography includes a source by DePaul.",
    "the bibliography includes a source by Gould.",
    "the bibliography includes a source by Keiner.",
    "IEEE published a bibliography for testability.",
    "the bibliography includes multiple sources.",
    "the bibliography includes a source by Simpson.",
    "the bibliography includes a source by the U.S. Navy.",
    "IEEE published a standard for testability and trial-use.",
    "the standard is Std 1522-2004.",
    "the standard was published in 2004.",
    "the standard is copyrighted by IEEE.",
    "the standard is reserved for all rights.",
    "The product life cycle process is related to diagnostic analysis and design.",
    "A comprehensive diagnostic analysis and design program requires a dedicated effort.",
    "The diagnostic design life cycle is organized around five phases.",
    "The five phases are: Requirements definition, Architecture design, Detailed test design, Verification and validation, and Diagnostic maturation.",
    "Each phase is described in a separate section.",
    "Requirements definition is the first step in an effective testability program.",
    "Diagnostic requirements are typically expressed in performance terms.",
    "Diagnostic requirements express the desired outcome without directing how to achieve it.",
    "Requirements definition is the first step in an effective testability program.",
    "Diagnostic requirements are typically expressed in performance terms.",
    "Diagnostic requirements express the desired outcome without directing how to achieve it.",
    "Goals are typically specified for fault detection, fault isolation, and fault isolation resolution.",
    "Mission reliability is a related requirement examined early in the design phase.",
    "Mission reliability is a measure of the prognostic capability of a system.",
    "Mission reliability is shown analytically to be capable of predicting system operation without malfunction.",
    "Other system-level metrics may be specified at this time.",
    "Mission reliability is a related requirement examined early in the design phase.",
    "Mission reliability is a measure of the prognostic capability of a system.",
    "Mission reliability is shown analytically to be capable of predicting system operation without malfunction.",
    "Mean time between failure (MTBF) is a system-level metric.",
    "Operational availability is a system-level metric.",
    "Can not duplicate (CND)/no evidence of failure (NEOF) rate is a system-level metric.",
    "Mean time between unscheduled maintenance actions (MTBUMA) is a system-level metric.",
    "Derivative requirements include mean time to repair (MTTR) and maintenance frequency.",
    "Derivative requirements include mean time to repair (MTTR) and maintenance frequency.",
    "Derivative requirements also include skill levels of repair personnel and time required for maintenance.",
    "Customer warranties may be executed on some metrics such as MTBF or operational availability.",
    "Customer warranties may also be executed on total operating hours.",
    "Authorized licensed use is limited to Technische Universitat Kaiserslautern.",
    "The document was downloaded from IEEE Xplore on August 21, 2024.",
    "Restrictions apply to the use of the document.",
    "The document is copyrighted by IEEE in 2005.",
    "The intent in the architecture design phase is to develop a preliminary design framework.",
    "The design framework allocates diagnostic program requirements to physical system components.",
    "A basic diagnostic subsystem architecture is laid out in conjunction with trade studies.",
    "Trade studies include fault tolerance, fault reporting, and field update approaches.",
    "The evaluation of the system's fault tolerance is against cost, weight, power, and MTBF.",
    "Alternative architectures are evaluated against cost, weight, power, and MTBF.",
    "The evaluation of the system's fault tolerance is important for architecture design.",
    "The evaluation of the system's fault tolerance is a key consideration in architecture design.",
    "Subsystem requirements are allocated to individual hardware elements.",
    "System-level testability models may be created to support analysis.",
    "Testability analysis is performed on the design models to verify requirements.",
    "Functional/physical partitioning and diagnostic requirements allocation will satisfy top-level requirements.",
    "Testability analysis is performed in a top-down manner.",
    "Testability models should evolve with the design.",
    "Testability analysis is performed to verify diagnostic requirements allocation.",
    "Detailed design requirements are allocated to individual hardware elements.",
    "Diagnostic design influence is assured by identifying necessary diagnostic design features.",
    "An elementary framework for a test strategy begins to emerge during analysis.",
    "Diagnostic program requirements are met by developing a detailed design solution.",
    "Detailed hardware and software designs are created in accordance with allocated system requirements.",
    "Diagnostic and reliability trade studies are iterated as required.",
    "Allocations of FD, FI, and FIR are adjusted as necessary.",
    "The results of modifications are reflected in the models and verified.",
    "Diagnostic and reliability trade studies affect cost, weight, power, MTBCF, and MTBF.",
    "The physical design matures as hardware aspects are reflected in analysis models.",
    "The hardware aspects are linked to their functional elements.",
    "The basic diagnostic subsystem architecture is modified as design and support system details emerge.",
    "Diagnostic and reliability trade studies are performed to optimize design.",
    "Fault tolerance, fault reporting, prognostics, and field update approaches are considered.",
    "The results of modifications are reflected in the models and verified.",
    "Diagnostic and reliability trade studies affect cost, weight, power, MTBCF, and MTBF.",
    "The diagnostic subsystem architecture is modified as design details emerge.",
    "Preliminary test verticality is performed during this phase.",
    "Comparative margins and tolerances of tests are determined.",
    "Test consistency is compared between BIT and ATE.",
    "Test consistency is compared between factory and field tests.",
    "Worst-case tolerance variations are considered.",
    "Latent manufacturing defects are considered.",
    "The cone of tolerance analysis is performed.",
    "The results of the analysis are used to determine comparative margins and tolerances.",
    "Diagnostic requirements are validated through test and demonstration.",
    "Diagnostic support equipment is tested or demonstrated.",
    "Diagnostic support system contributions to diagnostics are tested or demonstrated.",
    "Quantitative testability allocations are verified through analysis and inspection methods.",
    "Authorized licensed use limited to: Technische Universitat Kaiserslautern.",
    "Diagnostic requirements are verified on delivery.",
    "Diagnostic support equipment and support system contributions are tested or demonstrated.",
    "Diagnostic requirements are verified through test and demonstration.",
    "IEEE Std 1522-2004 is a trial-use standard for testability.",
    "Copyright 2005 IEEE. All rights reserved.",
    "Two primary validation efforts are performed during this phase.",
    "The validity of the fault detection and fault isolation models are assessed through a static fault insertion.",
    "Susceptibility to false alarms and can not duplicates is evaluated during field testing opportunities.",
    "Fault insertion is the only controlled opportunity for exercising the complete embedded hardware/software.",
    "Diagnostic software only performs its intended job in the presence of failures.",
    "Faults selected for insertion should be chosen based on highest failure probability.",
    "Diagnostic software must be executed to verify that the tests assumed during the analysis phases were effectively implemented in software.",
    "Faults selected for insertion should be chosen based on highest failure probability.",
    "Corrective actions for FD/FI deficiencies are to be implemented and validated.",
    "False alarms and can not duplicates are undesirable design characteristics.",
    "Development and qualification tests exercise the hardware under simulated environmental and life conditions.",
    "Laboratory and field tests provide an opportunity to correct diagnostic anomalies.",
    "The purpose of the maturation phase is to implement a program that effectively measures actual product performance.",
    "A maturation plan must be constructed to document how data indicative of diagnostics performance will be collected.",
    "False alarms and can not duplicates are undesirable design characteristics.",
    "Development and qualification tests exercise the hardware under simulated environmental and life conditions.",
    "Laboratory and field tests provide an opportunity to correct diagnostic anomalies.",
    "The purpose of the maturation phase is to implement a program that effectively measures actual product performance.",
    "A maturation plan must be constructed to document how data indicative of diagnostics performance will be collected.",
    "The effort to mature a design begins at the conceptual design stage and continues throughout the system life cycle.",
    "Data indicative of diagnostics performance will be collected, measured, evaluated, and acted on.",
    "The state of the diagnostic design will be demonstrated to meet the diagnostic and health management requirements.",
    "The purpose of the maturation phase is to implement a program that effectively measures actual product performance.",
    "A maturation plan must be constructed to document how data indicative of diagnostics performance will be collected.",
    "Data indicative of diagnostics performance will be collected, measured, evaluated, and acted on.",
    "The state of the diagnostic design will be demonstrated to meet the diagnostic and health management requirements.",
    "Unexpected and unplanned system-level design interactions can degrade the performance of the diagnostic design.",
    "Operational and environmental stresses can degrade the performance of the diagnostic design.",
    "Other influences can degrade the performance of the diagnostic design.",
    "The performance of the diagnostic design can degrade from what was predicted.",
    "The purpose of the maturation phase is to implement a program that effectively measures actual product performance.",
    "A maturation plan must be constructed to document how data indicative of diagnostics performance will be collected.",
    "Data indicative of diagnostics performance will be collected, measured, evaluated, and acted on.",
    "The state of the diagnostic design will be demonstrated to meet the diagnostic and health management requirements.",
    "Unexpected and unplanned system-level design interactions can degrade the performance of the diagnostic design.",
    "Operational and environmental stresses can degrade the performance of the diagnostic design.",
    "Other influences can degrade the performance of the diagnostic design.",
    "The performance of the diagnostic design can degrade from what was predicted.",
    "Remedial actions must be taken for unacceptable product performance or other cost of ownership problems.",
    "Root cause analysis must be performed to identify potential adjustments.",
    "Potential adjustments include improvements or refinements to diagnostic, support, or operational elements.",
    "IEEE Std 1522-2004 defines the specification for extensions of the AI-ESTATE information models.",
    "The AI-ESTATE standard is extended to include the probability_of_diagnosis and probability_of_repair_item_set measures.",
    "The AI-ESTATE common element model is extended to include a failure rate value for each diagnosis.",
    "The failure rate extension is an abstract entity that contains the frequency value for the associated failure rate.",
    "The failure rate extension is a subtype of the failure_rate entity in the AI-ESTATE common element model.",
    "The associated_frequency attribute is used to specify the rate of failures associated with a diagnosis over a given time span.",
    "The EXTEND_weibull_failure_rate entity is a subtype of the abstract entity EXTEND_failure_rate.",
    "beta is a REAL.",
    "beta is an attribute.",
    "alpha is an attribute.",
    "alpha is used to specify the alpha parameter of the Weibull distribution.",
    "beta is used to specify the beta parameter of the Weibull distribution.",
    "EXTEND_exponential_failure_rate is a subtype of EXTEND_failure_rate.",
    "EXTEND_exponential_failure_rate is used when the associated failure rate is the result of an exponential distribution.",
    "EXTEND_exponential_failure_rate is a subtype of EXTEND_failure_rate.",
    "EXTEND_exponential_failure_rate is used when the associated failure rate is the result of an exponential distribution.",
    "EXTEND_diagnosis is a subtype of diagnosis.",
    "EXTEND_diagnosis contains the failure rate for the associated diagnosis.",
    "new_rate is an attribute.",
    "new_rate is used to specify the failure rate associated with the given diagnosis."
  ],
  "created_at": "20260121_113119Z",
  "meta": {
    "mode": "chunks",
    "num_docs": 184,
    "use_batch_decomposer": true,
    "batch_size": 5,
    "num_batches": 37
  }
}