{
  "num_qualities": 126,
  "qualities": [
    "David Dembinsky is affiliated with German Research Center for Artificial Intelligence.",
    "Adriano Lucieri is affiliated with German Research Center for Artificial Intelligence.",
    "Stanislav Frolov is affiliated with German Research Center for Artificial Intelligence.",
    "Hiba Najjar is affiliated with German Research Center for Artificial Intelligence.",
    "Ko Watanabe is affiliated with German Research Center for Artificial Intelligence.",
    "Andreas Dengel is affiliated with German Research Center for Artificial Intelligence.",
    "Modern AI systems frequently rely on opaque black-box models.",
    "Deep Neural Networks are complex architectures with millions of learned parameters.",
    "Explainable AI addresses the issue of lack of transparency in AI systems.",
    "Explainable AI provides human-understandable explanations of model behavior.",
    "Explainable AI must be rigorously evaluated to ensure its usefulness and trustworthiness.",
    "The field of Explainable AI lacks standardized evaluation protocols and consensus on appropriate metrics.",
    "A systematic literature review following the PRISMA guidelines is conducted to address the gap in evaluation protocols.",
    "A unified framework for the eValuation of XAI (VXAI) is introduced to support systematic metric selection and comparability across methods.",
    "Explainable AI is a research area of growing interest to both AI researchers and practitioners.",
    "Explainable AI aims to alleviate the black-box issue of current deep-learning models.",
    "Government-affiliated initiatives identify Explainable AI as a crucial part of Trustworthy AI.",
    "Explainable AI helps AI systems in serving the 'right to explain' its decisions and fosters user trust through understanding of the system.",
    "Explainable AI plays a fundamental role in making high-stakes AI systems more trustworthy.",
    "Explainable AI is used to help with other dimensions of trustworthiness like privacy, robustness, or fairness.",
    "Explainability is used to help with other dimensions of trustworthiness.",
    "Explainability is used to help with privacy, robustness, or fairness.",
    "Explainability is used to help with robustness or fairness.",
    "Explainability is used to help with fairness.",
    "Evaluation is still not performed consistently and seldom systematically.",
    "The community frequently calls to develop comprehensive and unified evaluation standards.",
    "A central motivation behind developing comprehensive and unified evaluation standards is to enable the comparison of explanations and assess whether explainability is achieved.",
    "Explanations are meant to aid humans.",
    "Human-grounded evaluation is the gold standard to assess explanations.",
    "Faithfulness and plausibility of explanations do not necessarily correlate.",
    "Human-grounded evaluation should be distinguished from functionality-grounded evaluation.",
    "Humans can't confidently attribute unexpected explanans to faulty explanations or flawed models.",
    "Explanations have two stages: generation and interpretation.",
    "Explanations can be evaluated using technical criteria and cognitive principles.",
    "Explanation quality has multifaceted nature.",
    "Functionality-grounded expectations reflect demands on explanation quality.",
    "Interpretability and Fidelity are major components of explainability.",
    "Interpretability includes Clarity, Broadness, and Parsimony.",
    "Fidelity includes Completeness and Soundness.",
    "A comprehensive and unified framework for functionality-grounded evaluation is missing.",
    "Terms such as interpretability, comprehensibility, understandability, transparency, and explainability are used inconsistently.",
    "A framework called eValuation of Explainable Artificial Intelligence (VXAI) is introduced.",
    "VXAI aims to unify functionality-grounded evaluation for XAI.",
    "Our contributions are as follows.",
    "Interpretation refers to the assignment of meaning to an explanation.",
    "Interpretation describes the process of inferring knowledge about the explanandum using the explanans.",
    "The success of an explanation depends on the receiving human's mental model.",
    "The explanandum is what is to be explained.",
    "The explanation is the process of explaining.",
    "The explanans is the explaining information.",
    "A well-founded evaluation of XAI methods requires clearly defined criteria for good explanations.",
    "Explanations in XAI have a two-stage process: generation and interpretation.",
    "The first stage can be evaluated using technical criteria.",
    "The second stage depends on the interpretability of the explanation.",
    "A number of desiderata have been proposed in the literature.",
    "Desiderata reflect demands on explanation quality.",
    "Interpretability and Fidelity are major components of explainability.",
    "Interpretability includes Clarity, Broadness, and Parsimony.",
    "Fidelity includes Completeness and Soundness.",
    "Robnik-Šikonja & Bohanec proposed a framework.",
    "Carvalho et al. adopted the framework.",
    "Molnar adopted the framework.",
    "The framework differentiates between properties of explanations and individual explanantia.",
    "Translucency is a property of explanations.",
    "Portability is a property of explanations.",
    "Algorithmic Complexity is a property of explanations.",
    "Expressive Power is a descriptive property.",
    "Comprehensibility is a property of individual explanantia.",
    "Importance is a property of individual explanantia.",
    "Representativeness is a property of individual explanantia.",
    "Fidelity is a property of individual explanantia.",
    "Guidotti et al. wrote an XAI review.",
    "The review was inspired by earlier works.",
    "Interpretability is a desideratum.",
    "Fidelity is a desideratum.",
    "Accuracy is a desideratum.",
    "Consistency is a desideratum.",
    "Scalability is a desideratum.",
    "Generality is a desideratum.",
    "Alvarez-Melis & Jaakkola reported desiderata.",
    "Jesus et al. reported desiderata.",
    "Alangari et al. reported desiderata.",
    "Interpretability is a desideratum.",
    "Faithfulness is a desideratum.",
    "Stability is a desideratum.",
    "Robustness is a desideratum.",
    "Complexity is a desideratum.",
    "Localization is a metric.",
    "Randomization is a metric.",
    "Axiomatic is a metric.",
    "Belaid et al. created a benchmark.",
    "The benchmark organizes functional tests into categories.",
    "Fidelity is a category.",
    "Stability is a category.",
    "Fragility is a category.",
    "Simplicity is a category.",
    "Stress is a category.",
    "Portability is a category.",
    "A set of seven desiderata was proposed.",
    "The desiderata serve as a categorization scheme.",
    "The goal is to offer a principled yet practical structure.",
    "The structure enables consistent classification.",
    "Properties beyond explainability are excluded.",
    "Fairness is a property beyond explainability.",
    "VXAI metrics are used to measure fairness.",
    "Palacio et al. described a two-stage view of explaining.",
    "The two-stage view of explaining has a Technical dimension.",
    "The Technical dimension assesses factual correctness, robustness, and reliability.",
    "The Technical dimension ensures the explanation faithfully reflects the model's reasoning.",
    "The Technical dimension is aligned with the Co-12 properties.",
    "The Technical dimension is aligned with the taxonomy by Zhou et al.",
    "The desiderata are designed to be independent from each other.",
    "The desiderata allow for reliable quantification of different aspects.",
    "The desiderata are relevant to trustworthy XAI.",
    "The categorization scheme is presented in Figure 3.",
    "The categorization scheme is introduced in the following paragraphs.",
    "Seven desiderata are defined.",
    "The explanation should keep the explanans concise.",
    "The explanation should support interpretability.",
    "The explanation should provide an explanans for every explanandum.",
    "The explanation should align with human expectations.",
    "The explanation should make the model's true reasoning reflect the explanans.",
    "The explanation should produce stable explanantia across repeated evaluations.",
    "The explanation should ensure similar explananda yield similar explanantia.",
    "The explanation should compute the explanans efficiently.",
    "The explanation should keep the explanans concise to support interpretability."
  ],
  "created_at": "20260208_194750Z",
  "meta": {
    "mode": "chunks",
    "num_docs": 18,
    "use_batch_decomposer": true,
    "batch_size": 5,
    "num_batches": 4,
    "parallel": false,
    "max_workers": null
  }
}