{
  "num_qualities": 1177,
  "qualities": [
    "IEEE Std 1522-2004 is a trial-use standard.",
    "IEEE Std 1522-2004 is for testability and diagnosability characteristics and metrics.",
    "IEEE Standards Coordinating Committee 20 sponsored IEEE Std 1522-2004.",
    "IEEE Std 1522-2004 was approved on 23 September 2004.",
    "IEEE Std 1522-2004 provides standard definitions of testability and diagnosability metrics and characteristics.",
    "IEEE Std 1522-2004 builds on IEEE Std 1232-2002.",
    "IEEE Std 1522-2004 is related to test and diagnosis.",
    "IEEE Std 1522-2004 uses aggregation fundamentals.",
    "IEEE Std 1522-2004 uses cost-related fundamentals.",
    "IEEE Std 1522-2004 is related to diagnosability.",
    "IEEE Std 1522-2004 is related to diagnostic inference.",
    "IEEE Std 1522-2004 is related to fault tree models.",
    "IEEE Standards documents are developed within the IEEE Societies.",
    "IEEE Standards documents are developed within the Standards Coordinating Committees of the IEEE Standards Association (IEEE-SA) Standards Board.",
    "The IEEE develops its standards through a consensus development process.",
    "The consensus development process is approved by the American National Standards Institute.",
    "Volunteers represent varied viewpoints and interests in the consensus development process.",
    "Volunteers serve without compensation.",
    "The IEEE administers the process and establishes rules to promote fairness.",
    "The IEEE does not independently evaluate the accuracy of its standards.",
    "The IEEE does not independently test its standards.",
    "The IEEE does not independently verify the accuracy of its standards.",
    "Use of an IEEE Standard is wholly voluntary.",
    "The IEEE disclaims liability for personal injury or property damage.",
    "The IEEE disclaims liability for personal injury or property damage.",
    "The IEEE disclaims liability for indirect or consequential damage.",
    "The IEEE disclaims liability for compensatory damage.",
    "The IEEE does not warrant the accuracy of the material contained in its standards.",
    "The IEEE does not represent the content of the material contained in its standards.",
    "The IEEE disclaims any express or implied warranty.",
    "The IEEE disclaims any implied warranty of merchantability.",
    "The IEEE disclaims any implied warranty of fitness for a specific purpose.",
    "The use of the material contained in an IEEE Standard is not free from patent infringement.",
    "IEEE Standards documents are supplied 'AS IS'.",
    "The existence of an IEEE Standard does not imply that there are no other ways to produce goods and services.",
    "The viewpoint expressed in an IEEE Standard is subject to change.",
    "Every IEEE Standard is subjected to review at least every five years.",
    "IEEE Standards are reviewed for revision or reaffirmation.",
    "A document is more than five years old if it has not been reaffirmed.",
    "A document that is more than five years old may not reflect the present state of the art.",
    "Users should check to determine that they have the latest edition of an IEEE Standard.",
    "The IEEE is not suggesting or rendering professional services for any person or entity.",
    "The IEEE is not undertaking to perform any duty owed by any other person or entity.",
    "Any person utilizing an IEEE Standard should rely upon the advice of a professional.",
    "Any person utilizing an IEEE Standard should rely upon the advice of a professional.",
    "IEEE provides interpretations of standards.",
    "Interpretations of IEEE standards require concurrence of a balance of interests.",
    "IEEE Standards Coordinating Committees provide responses to interpretation requests.",
    "IEEE cannot provide instant responses to interpretation requests.",
    "Individuals presenting IEEE standards information must disclose their personal views.",
    "Comments for revision of IEEE Standards are welcome from any interested party.",
    "Suggestions for changes in documents should be in the form of a proposed change of text.",
    "Comments on standards and requests for interpretations should be addressed to the IEEE-SA Standards Board.",
    "Authorization to photocopy portions of any individual standard is granted by IEEE.",
    "Permission to photocopy portions of any individual standard for educational classroom use can be obtained through the Copyright Clearance Center.",
    "Implementation of this standard may require use of subject matter covered by patent rights.",
    "IEEE is not responsible for identifying patents for which a license may be required by an IEEE standard.",
    "IEEE Standards Coordinating Committees cannot provide instant responses to interpretation requests.",
    "Individuals presenting IEEE standards information must disclose their personal views.",
    "Comments for revision of IEEE Standards are welcome from any interested party.",
    "Suggestions for changes in documents should be in the form of a proposed change of text.",
    "Comments on standards and requests for interpretations should be addressed to the IEEE-SA Standards Board.",
    "Authorization to photocopy portions of any individual standard is granted by IEEE.",
    "Permission to photocopy portions of any individual standard for educational classroom use can be obtained through the Copyright Clearance Center.",
    "Implementation of this standard may require use of subject matter covered by patent rights.",
    "IEEE is not responsible for identifying patents for which a license may be required by an IEEE standard.",
    "Comments should be addressed to the Secretary, IEEE-SA Standards Board.",
    "The IEEE-SA Standards Board address is 445 Hoes Lane, Piscataway, NJ 08855-1331, USA.",
    "The Copyright Clearance Center address is 222 Rosewood Drive, Danvers, MA 01923, USA.",
    "Comments for revision of IEEE Standards are welcome from any interested party.",
    "Suggestions for changes in documents should be in the form of a proposed change of text.",
    "Comments on standards and requests for interpretations should be addressed to the IEEE-SA Standards Board.",
    "Authorization to photocopy portions of any individual standard is granted by IEEE.",
    "Permission to photocopy portions of any individual standard for educational classroom use can be obtained through the Copyright Clearance Center.",
    "Implementation of this standard may require use of subject matter covered by patent rights.",
    "IEEE is not responsible for identifying patents for which a license may be required by an IEEE standard.",
    "The IEEE-SA Standards Board address is 445 Hoes Lane, Piscataway, NJ 08855-1331, USA.",
    "The Copyright Clearance Center address is 222 Rosewood Drive, Danvers, MA 01923, USA.",
    "The Copyright Clearance Center phone number is +1 978 750 8400.",
    "The Copyright Clearance Center address is 222 Rosewood Drive, Danvers, MA 01923, USA.",
    "The IEEE-SA Standards Board address is 445 Hoes Lane, Piscataway, NJ 08855-1331, USA.",
    "Implementation of this standard may require use of subject matter covered by patent rights.",
    "IEEE is not responsible for identifying patents for which a license may be required by an IEEE standard.",
    "Permission to photocopy portions of any individual standard for educational classroom use can be obtained through the Copyright Clearance Center.",
    "The Copyright Clearance Center address is 222 Rosewood Drive, Danvers, MA 01923, USA.",
    "The Copyright Clearance Center phone number is +1 978 750 8400.",
    "The IEEE-SA Standards Board address is 445 Hoes Lane, Piscataway, NJ 08855-1331, USA.",
    "Comments should be addressed to the Secretary, IEEE-SA Standards Board.",
    "Authorization to photocopy portions of any individual standard is granted by IEEE.",
    "Suggestions for changes in documents should be in the form of a proposed change of text.",
    "Comments on standards and requests for interpretations should be addressed to the IEEE-SA Standards Board.",
    "Comments for revision of IEEE Standards are welcome from any interested party.",
    "Individuals presenting IEEE standards information must disclose their personal views.",
    "Authorized licensed use limited to Technische Universitat Kaiserslautern.",
    "Downloaded on August 21,2024 at 11:55:44 UTC from IEEE Xplore.",
    "Restrictions apply.",
    "Copyright 2005 IEEE.",
    "All rights reserved.",
    "This introduction is not part of IEEE Std 1522-2004.",
    "IEEE Trial-Use Standard for Testability and Diagnosability Characteristics and Metrics is not part of this introduction.",
    "Systems became more complex costly and difficult to diagnose and repair.",
    "Initiatives were started to address these problems.",
    "The objective of one initiative was to make systems easier to test.",
    "This commercial standard must provide specific unambiguous definitions of criteria for assessing system testability.",
    "IEEE has started initiatives to standardize test architectures.",
    "The IEEE 1232TM Artificial Intelligence Exchange and Service Tie to All Test Environments series of standards provide the foundation for precise and unambiguous testability and diagnosability metrics.",
    "The IEEE 1232TM Artificial Intelligence Exchange and Service Tie to All Test Environments series of standards provide the foundation for precise and unambiguous testability and diagnosability metrics.",
    "It is the objective of this standard to provide notionally correct and inherently useful but mathematically precise definitions of testability measures.",
    "Notionally correct means that the measures are not in conflict with intuitive and historical representations.",
    "Notice to users Errata can be accessed at the following URL http:// standards.ieee.org/reading/ieee/updates/errata/index.html.",
    "Users are encouraged to check this URL for errata periodically.",
    "Current interpretations can be accessed at the following URL http://standards.ieee.org/reading/ieee/interp/ index.html.",
    "Implementation of this standard may require use of subject matter covered by patent rights.",
    "By publication of this standard no position is taken with respect to the existence or validity of patent rights.",
    "IEEE shall not be responsible for identifying patents or patent applications.",
    "IEEE shall not be responsible for conducting inquiries into the legal validity or scope of patents.",
    "Publication of this trial-use standard has been approved by the Institute of Electrical and Electronics Engineers.",
    "Trial-use standards are effective for 24 months from the date of publication.",
    "Comments for revision will be accepted for 18 months after publication.",
    "Suggestions for revision should be directed to the Secretary, IEEE-SA Standards Board.",
    "Suggestions for revision should be received no later than 23 March 2006.",
    "This trial-use standard shall be submitted to the IEEE-SA Standards Board for approval as a full-use standard after 24 months.",
    "Mark A. Kaufman is the Co-chair of the Diagnostic & Maintenance Control subcommittee.",
    "Tim Wilmering is the Co-Chair of the Diagnostic & Maintenance Control subcommittee.",
    "The following persons contributed to this trial-use standard: Mark A. Kaufman, Tim Wilmering, and others.",
    "Steve M. Mills is the Vice Chair of the IEEE-SA Standards Board.",
    "Judith Gorman is the Secretary of the IEEE-SA Standards Board.",
    "Satish K. Aggarwal is the NRC Representative on the IEEE-SA Standards Board.",
    "Li Pi Su",
    "William J. Taylor",
    "Joerg H. Urban",
    "J. Richard Weger",
    "Antony Bartolini",
    "Amanda Jane Giarla",
    "Martin Baur",
    "Tommy Cooper",
    "Em Delahostria",
    "Bernd Dinklage",
    "William Frank",
    "Eric Gould",
    "Hermann Koch",
    "Thomas J. McGean",
    "Daleep C. Mohla",
    "Paul Nikolich",
    "T. W. Olsen",
    "Ronald C. Petersen",
    "Gary S. Robinson",
    "Frank Stone",
    "Malcolm V. Thaden",
    "Doug Topping",
    "Joe D. Watson",
    "References are listed.",
    "Definitions are provided.",
    "Context is explained.",
    "Fundamental measures exist.",
    "The number of fundamental measures is unknown.",
    "Metrics exist.",
    "The number of metrics is unknown.",
    "Annex A is informative.",
    "Annex B is informative.",
    "Annex C is normative.",
    "The bibliography is annexed.",
    "The product life cycle is described in annex B.",
    "The metric applicability is described in annex B.",
    "Extensions to the AI-ESTATE standard are described in annex C.",
    "Authorized licensed use is limited.",
    "Downloaded on August 21, 2024.",
    "Downloaded at 11:55:44 UTC.",
    "Restrictions apply.",
    "licensed use limited to Technische Universitat Kaiserslautern.",
    "downloaded on August 21,2024 at 11:55:44 UTC from IEEE Xplore.",
    "restrictions apply.",
    "IEEE Trial-Use Standard for Testability and Diagnosability Characteristics and Metrics was developed by the Diagnostic and Maintenance Control subcommittee of the IEEE Standards Coordinating Committee 20 on Test and Diagnosis for Electronic Systems.",
    "the standard provides standard unambiguous definitions of testability and diagnosability metrics and characteristics.",
    "the standard builds on fundamental definitions derived from elements in formal information models related to test and diagnosis defined in IEEE Std 1232TM-2002.",
    "the standard provides definitions of testability and diagnosability characteristics and metrics that are independent of specific test and diagnosis technologies.",
    "the standard provides definitions of testability and diagnosability characteristics and metrics that are independent of specific system under test technologies.",
    "the standard provides unambiguous definitions of testability and diagnosability metrics used by procurement and support organizations.",
    "Lord Kelvin commented that when you can measure what you are speaking about and express it in numbers, you know something about it.",
    "Lord Kelvin commented that when you cannot measure it, you cannot express it in numbers, your knowledge is of a meager and unsatisfactory kind.",
    "when different tools measure something differently, and the basis for the measurement is not known or understood, it is neither knowledge nor science.",
    "the objective of this standard is to provide precise formal definitions of metrics that may be used to predict the testability of a system.",
    "Metrics are derived from actual maintenance data.",
    "Metrics determine testability achieved during factory and field testing.",
    "Metrics are used to determine testability of a system.",
    "Testability is determined during factory and field testing.",
    "Metrics are derived from actual data.",
    "Metrics are used to determine testability.",
    "Testability is determined using metrics.",
    "Metrics are used to measure testability.",
    "Testability is measured using metrics.",
    "Metrics are used to assess testability.",
    "Testability is assessed using metrics.",
    "Metrics are used to evaluate testability.",
    "Predictive testability and diagnosability metrics are defined.",
    "Metrics are defined based on IEEE Std 1232-2002.",
    "Entities are required to define metrics.",
    "Information models are used to define metrics.",
    "Metrics are not computed using implementation-specific requirements.",
    "Metrics must be mathematically equivalent to definitions.",
    "Metrics are based on the assumption of a single independent fault.",
    "Multiple fault metrics are outside the scope of this standard.",
    "Industry consensus is lacking for multiple fault metrics.",
    "Metrics are technology-independent.",
    "Testability and diagnosability characteristics are defined.",
    "Metrics are based on relevant standard information models.",
    "Metrics are defined in this standard.",
    "Metrics are based on standard information models.",
    "Testability and diagnosability characteristics are defined.",
    "Metrics are technology-independent.",
    "Metrics are based on relevant standard information models.",
    "This standard provides consistent definitions.",
    "This standard provides unambiguous definitions.",
    "A common basis for system testability and diagnosability assessment is provided.",
    "Specifications are given in the EXPRESS language.",
    "Specifications are presented in the Courier type font.",
    "Entity and attribute names are referenced in the supporting text.",
    "Relevant IEEE standards are used.",
    "This standard provides consistent definitions.",
    "This standard provides unambiguous definitions.",
    "A common basis for system testability and diagnosability assessment is provided.",
    "Specifications are given in the EXPRESS language.",
    "Specifications are presented in the Courier type font.",
    "Entity and attribute names are referenced in the supporting text.",
    "Relevant IEEE standards are used.",
    "Conflict of standards is addressed.",
    "Vocabulary and definitions of relevant IEEE standards are used.",
    "Specifications are presented in a consistent format.",
    "Specifications are presented in a clear format.",
    "Specifications are easy to understand.",
    "IEEE Std 1232-2002 takes precedence over AI-ESTATE.",
    "IEEE Std 1232-2002 is repeated in this standard.",
    "This standard is used with IEEE Std 1232-2002.",
    "IEEE Std 1232-2002 is the current version of AI-ESTATE.",
    "This standard is used with AI-ESTATE.",
    "IEEE Std 1232-2002 is the standard for AI-ESTATE.",
    "This standard is used with the following publications.",
    "IEEE Std 1232-2002 is the standard for Artificial Intelligence Exchange and Service Tie to All Test Environments (AI-ESTATE).",
    "IEEE publications are available from the Institute of Electrical and Electronics Engineers.",
    "ISO publications are available from the ISO Central Secretariat.",
    "ISO publications are also available in the United States from the Sales Department, American National Standards Institute.",
    "IEEE publications are available from the Institute of Electrical and Electronics Engineers, Inc.",
    "ISO publications are available from the ISO Central Secretariat, Case Postale 56, 1 rue de Varembé, CH-1211, Genève 20, Switzer-land/ Suisse.",
    "ISO publications are available in the United States from the Sales Department, American National Standards Institute.",
    "Authorized licensed use limited to: Technische Universitat Kaiserslautern.",
    "Downloaded on August 21,2024 at 11:55:44 UTC from IEEE Xplore.",
    "Restrictions apply.",
    "The Authoritative Dictionary of IEEE Standards and Terms, Seventh edition [B4] should be referenced for terms not defined in this clause.",
    "It may or may not be measurable during actual system operation or maintenance.",
    "The Authoritative Dictionary of IEEE Standards and Terms, Seventh edition [B4] is referenced for terms not defined in this clause.",
    "It may or may not be measurable during actual system operation or maintenance.",
    "Faults in a system should be localized frequently and unambiguously.",
    "Fault localization in a system should be optimized.",
    "Faults in a system should be detected and isolated during operation and maintenance.",
    "Fault isolation in a system should be performed efficiently.",
    "Fault isolation in a system should be performed in a timely manner.",
    "System design should include characteristics to make the system easier to test.",
    "Testability is a design characteristic that allows the status of an item to be determined.",
    "Testability is a design characteristic that allows the isolation of faults within an item to be performed in a timely manner.",
    "MIL-STD-2165 provides uniform procedures and methods to control planning, implementation, and verification of testability.",
    "Testability is made up of two related practices: design for test and diagnosability.",
    "Design for test facilitates the testing process by encouraging good design practices.",
    "Diagnosability evaluates the ability to determine the status of an item.",
    "This standard defines metrics related to fault detection and isolation.",
    "Fault detection metrics are represented as a ratio of detected or detectable faults to the full set of possible faults.",
    "The ratio is weighted using the failure rates of the faults within the fault universe.",
    "The numbers in brackets correspond to those of the bibliography in Annex A.",
    "Authorized licensed use limited to: Technische Universitat Kaiserslautern.",
    "The standard is copyrighted by IEEE.",
    "IEEE Std 1522-2004 is a trial-use standard for testability and",
    "Fault isolation metrics are based on a ratio of the number of faults in ambiguity groups to the total number of faults.",
    "Isolation calculations are frequently weighted using failure rates.",
    "Testability has been concerned with predicting and measuring the incidence of false indication.",
    "No consensus exists in the test industry for predicting and measuring the incidence of false indication.",
    "The standard will defer specification of metrics for false indication until such time as consensus is reached.",
    "The standard distinguishes between two classes of metrics—predictive and empirical.",
    "Predictive metrics include all testability and diagnosability metrics that can be derived from a static AI-ESTATE-compliant model.",
    "Empirical metrics are derived from collected maintenance data and are beyond the scope of this standard.",
    "Clause 5 provides several metrics for this standard.",
    "The standard defines the approach for defining metrics.",
    "Clause 5 provides several metrics for this standard.",
    "Fundamental measures are used in defining testability and diagnosability metrics.",
    "Several fundamental functions are defined in 5.2.",
    "Functions are defined in 5.3 to estimate cost of tests or probability of faults.",
    "Functions are defined in 5.4 to assist in traversing the diagnostic models.",
    "Fundamental measures are defined using the AI ESTATE information models.",
    "Multiple correct means compute the individual fundamentals.",
    "Clause 6 uses these fundamental measures from Clause 5.",
    "IEEE Std 1232-2002 is an information exchange standard for test and diagnosis.",
    "The standard defines the architecture of an AI-ESTATE-conformant system.",
    "The standard defines the information models for knowledge and data exchange.",
    "A set of standard software services is provided by a diagnostic reasoner.",
    "The AI-ESTATE standard provides formal definitions of the information required for test and diagnosis.",
    "The purpose of this standard is to provide semantically rigorous definitions.",
    "Detailed algorithms are not provided for the fundamental measures.",
    "Clause 6 uses the fundamental measures from Clause 5 to define the standard metrics.",
    "IEEE Std 1232-2002 is an information exchange standard for test and diagnosis.",
    "The standard defines the architecture of an AI-ESTATE-conformant system.",
    "The standard defines the information models for knowledge and data exchange.",
    "A set of standard software services is provided by a diagnostic reasoner.",
    "The AI-ESTATE standard provides formal definitions of the information required for test and diagnosis.",
    "The standard is used as the basis for the metrics defined within this standard.",
    "A description of how to use the fundamentals to develop metrics is contained in Clause 6.",
    "Conformance demands that all metrics be computed as specified in Clause 6.",
    "The requirements for conformance to the standard testability and diagnosability characteristics and metrics are defined in this standard.",
    "The AI-ESTATE standard provides formal definitions of the information required for test and diagnosis.",
    "The standard is used as the basis for the metrics defined within this standard.",
    "A description of how to use the fundamentals to develop metrics is contained in Clause 6.",
    "Conformance demands that all metrics be computed as specified in Clause 6.",
    "The requirements for conformance to the standard testability and diagnosability characteristics and metrics are defined in this standard.",
    "Clause 6 defines the requirements for conformance to the standard testability and diagnosability characteristics and metrics.",
    "All metrics must be computed as specified in Clause 6.",
    "The standard defines the requirements for conformance to the standard testability and diagnosability characteristics and metrics.",
    "The AI-ESTATE standard is used as the basis for the metrics defined within this standard.",
    "A description of how to use the fundamentals to develop metrics is contained in Clause 6.",
    "Conformance demands that all metrics be computed as specified in Clause 6.",
    "The requirements for conformance to the standard testability and diagnosability characteristics and metrics are defined in this standard.",
    "IEEE Std 1522-2004 is a standard.",
    "The standard provides an extensibility mechanism.",
    "Extensions should be submitted to the D&MC Subcommittee.",
    "Proposed extensions are ranked in order of preference.",
    "Metrics are derived from fundamental measures of Clause 5.",
    "Metrics are derived from AI-ESTATE models.",
    "Extensions cannot redefine any metrics defined in this standard.",
    "Fundamental measures are categorized as aggregation measures, cost-related measures, or measures to support detection and isolation metrics.",
    "Standard, unambiguous testability and diagnosability metrics are defined based on AI-ESTATE models.",
    "Standard information models provide formal semantics for information of interest to the testability and diagnosability domain.",
    "Fundamental measures are defined using terminology from EXPRESS models defined in AI-ESTATE.",
    "Measures are specified following the conventions for defining services in AI-ESTATE.",
    "Metrics are derived from functions and measures based on AI-ESTATE models.",
    "Metrics are derived from AI-ESTATE-conformant extensions.",
    "Extensions cannot redefine any metrics defined in this standard.",
    "Fundamental measures are categorized as aggregation measures, cost-related measures, or measures to support detection and isolation metrics.",
    "Standard, unambiguous testability and diagnosability metrics are defined based on AI-ESTATE models.",
    "Standard information models provide formal semantics for information of interest to the testability and diagnosability domain.",
    "Fundamental measures are defined using terminology from EXPRESS models defined in AI-ESTATE.",
    "Measures are specified following the conventions for defining services in AI-ESTATE.",
    "The approach to defining standard, unambiguous testability and diagnosability metrics is based on AI-ESTATE models.",
    "The specific measures defined in this clause are listed in Table 1.",
    "The primary information models used to define these measures are drawn from the AI-ESTATE standard.",
    "The AI-ESTATE common element model is used to define measures.",
    "The approach to specifying measures follows the conventions for defining services in AI-ESTATE.",
    "The fundamental measures in this clause are based on the following propositions.",
    "The primary information models used to define these measures are drawn from the AI-ESTATE standard.",
    "The AI-ESTATE common element model is used to define measures.",
    "The fault tree model is used to define measures.",
    "The diagnostic inference model is used to define measures.",
    "The enhanced diagnostic inference model is used to define measures.",
    "All cost-related metrics are computed with respect to a single test or repair within the AI-ESTATE common element model.",
    "All isolation metrics are computed under the assumption that no more than a single, independent fault exists at the time of diagnostics.",
    "Isolation metrics are computed to remove dependence on diagnostic and maintenance strategies.",
    "Detection and isolation metrics are defined to manage the complexity of computing isolation-related metrics.",
    "The type of underlying diagnostic and maintenance strategies is not considered when defining detection and isolation metrics.",
    "The exam inspection period begins two weeks after grades are published.",
    "Students must request an appointment by email.",
    "Students must request the appointment before the deadline.",
    "The deadline for requesting an appointment is not specified.",
    "The exam inspection period is not specified.",
    "The grades are published after the exam.",
    "The grades are published two weeks before the exam inspection period begins.",
    "The grades are published after the deadline for requesting an appointment.",
    "The grades are published before the deadline for requesting an appointment.",
    "The deadline for requesting an appointment is after the grades are published.",
    "The deadline for requesting an appointment is before the exam inspection period begins.",
    "The deadline for requesting an appointment is two weeks after the grades are published.",
    "A diagnostic model establishes detectability and isolatability differently.",
    "The diagnostic model is a fault tree model, diagnostic inference model, or enhanced diagnostic inference model.",
    "The AI-ESTATE model defines the level entity to be the level of indenture for a particular hierarchical element.",
    "The level entity is used for constraining diagnosis or analysis for testability and diagnosability assessment.",
    "Many measures are defined relative to a level defined within the AI-ESTATE model.",
    "IEEE Std 1522-2004 is a trial-use standard for testability and diagnosability assessment.",
    "The standard defines fundamental measures for testability and diagnosability assessment.",
    "The standard defines cost functions for testability and diagnosability assessment.",
    "The standard defines detection and isolation functions for testability and diagnosability assessment.",
    "The standard defines detection and isolation functions for testability and diagnosability assessment.",
    "The standard defines functions for getting leaves, signatures, and ambiguity groups.",
    "The standard defines functions for converting repair to diagnosis ambiguity and vice versa.",
    "The standard defines functions for repair item and diagnosis ambiguity.",
    "Authorized licensed use limited to: Technische Universitat Kaiserslautern.",
    "Downloaded on August 21,2024 at 11:55:44 UTC from IEEE Xplore.",
    "Restrictions apply.",
    "IEEE DIAGONOSABLITY CHARACTERISTICS AND METRICS Std 1522-2004 Copyright",
    "All rights reserved.",
    "This subclause provides the definition of each aggregation fundamental to be used in more complex metric definitions.",
    "All fundamental measures are based on the AI-ESTATE common element model and need not be tied to specific diagnostic models (i.e., FTM, DIM, or EDIM).",
    "Within AI-ESTATE, an action is defined by the information model to be “A specific action taken to either test or repair an item.",
    "Actions are the primary entities against which costs are associated.",
    "Ultimately",
    "the diagnosis and repair process is concerned with optimizing the sequence of actions required to return a unit to service.",
    "The function action_set returns the set of all actions within a diagnostic model at a particular level.",
    "FUNCTION action_set (mdl : diagnostic_model; lvl : level) : SET OF action; END_FUNCTION;",
    "Within AI-ESTATE, a diagnosis is defined by the information model to be “a lattice of diagnostic conclusions.",
    "Typically, a diagnosis consists of failures or fault (sic.).",
    "The diagnoses can be interconnected in a lattice to classify constituent units, e.g., by function.",
    "This construct provides a generalized grouping mechanism for the constituents of the unit under test and their failure modes.”",
    "The function diagnosis_set returns the set of all diagnoses within a diagnostic model at a particular level.",
    "FUNCTION diagnosis_set (mdl : diagnostic_model; lvl : level) : SET OF diagnosis; END_FUNCTION;",
    "Within AI-ESTATE, a failure mode is defined by the information model to be “A specific mode or means by which a unit or system can fail.",
    "The specific failure mode is associated, first with the diagnosis, then (by way of the appropriate subtype) to the item that has failed.",
    "The function failure_mode_set returns the set of all failure modes within a diagnostic model at a particular level.",
    "failure modes are associated with diagnoses",
    "level is determined by examining diagnoses",
    "failure_mode_set returns a set of failure modes",
    "Authorized licensed use limited to Technische Universitat Kaiserslautern",
    "a failure is a manifestation of an anomaly within a system",
    "a failure is the failure of the system to perform some intended function",
    "failure_set returns a set of all failures",
    "a fault is a physical cause of anomalous behavior within a system",
    "a fault corresponds to a physical breakdown in the system",
    "fault_set returns a set of all faults",
    "a function is any functional behavior represented within a system",
    "function_set returns a set of all functions",
    "a repair item is some part of the system to be adjusted",
    "repair_item_set returns a set of all repair items",
    "Authorized licensed use limited to Technische Universitat Kaiserslautern.",
    "Downloaded on August 21,2024 at 11:55:44 UTC from IEEE Xplore.",
    "Restrictions apply.",
    "A repair is defined by the information model to be the process undertaken to return the unit to service.",
    "The function repair_set returns the set of all repairs within a diagnostic model at a particular level.",
    "A resource is defined within the information model to be something that any given action in the maintenance process is likely to require to perform that action.",
    "The function resource_set returns the set of all resources within a diagnostic model at a particular level.",
    "The function resource_set returns the set of all resources within a diagnostic model at a particular level.",
    "All fundamental measures are based on the AI-ESTATE common element model.",
    "Costs are measurable quantities of time or resources.",
    "Costs include money and/or expendables.",
    "Cost is computed over a set of tests or repairs by using associated test action costs, repair action costs, and resource costs.",
    "All cost calculations use the same units of measure and are based on resource cost.",
    "No unit conversion is included in the definition.",
    "measures are specified—one associated with a particular level and a particular required context",
    "measures are specified—one associated with a particular level but all contexts",
    "measures are specified—one associated with a particular required context but all levels",
    "measures are specified—one with no level and no required context specified",
    "the context refers to the required set of conditions that is true when specified test is performed",
    "the context refers to the required set of conditions that is true when specified diagnosis is performed",
    "the context refers to the required set of conditions that is true when specified repair is performed",
    "a model structure is provided to capture failure rate information for a particular diagnosis in a diagnostic model",
    "the failure rate is defined based on clock time",
    "the failure rate is defined based on operating time",
    "the time basis attribute permits specification of a user-defined basis",
    "the time basis attribute permits specification of a basis that is unknown",
    "the function probability_of_diagnosis returns the conditional probability of a diagnosis given a specified set of diagnoses",
    "the probability of diagnosis is calculated as the failure rate of the specified diagnosis divided by the sum of the failure rates of the diagnoses in the specified set",
    "the probability of diagnosis is computed by normalizing the underlying distribution",
    "The approach to calculating the measure must be specified.",
    "The probability of diagnosis is computed relative to a specified set of diagnoses.",
    "The diagnosis for which the probability is being calculated is a member of the specified diagnosis set.",
    "No diagnosis in the relative diagnosis set is a child of another diagnosis in the specified diagnosis set.",
    "The time basis is consistent for all members of the diagnosis set.",
    "The set of diagnoses does not mix faults and failures.",
    "The diagnoses in the specified set are probabilistically independent of one another.",
    "The probability is then calculated using the extended diagnosis entity defined in Annex C.",
    "The measure probability_of_diagnosis represents the probability that a diagnosis is correct.",
    "The probability of a diagnosis is defined as the sum of the probabilities of all diagnoses tied to that diagnosis.",
    "Computing the probability of a diagnosis uses the probability_of_diagnosis function defined here.",
    "The probability of a diagnosis is computed relative to a specified set of diagnoses.",
    "The set of diagnoses does not mix faults and failures.",
    "The diagnoses in the specified set are probabilistically independent of one another.",
    "The probability is then calculated using the extended diagnosis entity defined in Annex C.",
    "The measure probability_of_diagnosis represents the probability that a diagnosis is correct.",
    "The probability of a diagnosis is defined as the sum of the probabilities of all diagnoses tied to that diagnosis.",
    "Computing the probability of a diagnosis uses the probability_of_diagnosis function defined here.",
    "The probability of a diagnosis is computed relative to a specified set of diagnoses.",
    "The probability of a diagnosis is the sum of the probabilities of all diagnoses tied to that diagnosis.",
    "The probability of a diagnosis is computed using the extended diagnosis entity defined in Annex C.",
    "The probability of a diagnosis is computed relative to a specified set of diagnoses.",
    "The probability of a diagnosis is the sum of the probabilities of all diagnoses tied to that diagnosis.",
    "The probability of a diagnosis is computed using the probability_of_diagnosis function defined here.",
    "No diagnosis in the repair item is a child of another diagnosis in the same repair item.",
    "The time basis is consistent for all diagnoses in the repair item.",
    "The set of diagnoses in the repair item does not mix faults and failures.",
    "Computing the probability of a diagnosis uses the probability_of_diagnosis function defined here.",
    "The probability of a diagnosis is computed using the probability_of_diagnosis function defined in Annex C.",
    "The probability of a diagnosis is the sum of the probabilities of all diagnoses tied to that diagnosis.",
    "The probability of a diagnosis is computed relative to a specified set of diagnoses.",
    "The probability of a diagnosis is the sum of the probabilities of all diagnoses tied to that diagnosis.",
    "The probability of a diagnosis is computed using the extended diagnosis entity defined in Annex C.",
    "The probability of a diagnosis is computed relative to a specified set of diagnoses.",
    "The probability of a diagnosis is the sum of the probabilities of all diagnoses tied to that diagnosis.",
    "The probability of a diagnosis is computed using the probability_of_diagnosis function defined here.",
    "The diagnoses in the specified set are probabilistically independent of one another.",
    "The probability is then calculated using the extended diagnosis entity defined in Annex C.",
    "The measure probability_of_diagnosis represents the probability that a diagnosis is correct.",
    "The probability of a diagnosis is defined as the sum of the probabilities of all diagnoses tied to that diagnosis.",
    "Computing the probability of a diagnosis uses the probability_of_diagnosis function defined here.",
    "The probability of a diagnosis is computed relative to a specified set of diagnoses.",
    "The probability of a diagnosis is the sum of the probabilities of all diagnoses tied to that diagnosis.",
    "The probability of a diagnosis is computed using the extended diagnosis entity defined in Annex C.",
    "The probability of a diagnosis is computed relative to a specified set of diagnoses.",
    "The probability of a diagnosis is the sum of the probabilities of all diagnoses tied to that diagnosis.",
    "The probability of a diagnosis is computed using the probability_of_diagnosis function defined here.",
    "The probability of a diagnosis is computed using the extended diagnosis entity defined in Annex C.",
    "IEEE published Std 1522-2004.",
    "The standard is copyrighted.",
    "All rights to the standard are reserved by IEEE.",
    "The standard defines a function called probability_of_repair_item_set.",
    "The function takes three parameters: rpr, diag_set, and time_point.",
    "The function returns a real value.",
    "The function computes repair cost given the specified context.",
    "The standard defines a cost-related measure called repair_context_non_time_cost.",
    "The measure adds the non-time cost of all actions associated with performing the indicated repair.",
    "The measure is limited to the resources and actions available in the required context.",
    "The standard defines a function called repair_context_non_time_cost.",
    "The function takes three parameters: rpr, cntxt, and of_type.",
    "The function returns a real value.",
    "The function computes repair cost given the specified context.",
    "The standard defines a cost-related measure called repair_context_time_cost.",
    "The measure adds the time cost of all actions associated with performing the indicated repair.",
    "The measure is limited to the resources and actions available in the required context.",
    "The standard defines a function called repair_level_non_time_cost.",
    "The function takes three parameters: rpr, lvl, and of_type.",
    "The function returns a real value.",
    "The function computes repair cost given the specified level.",
    "The standard defines a cost-related measure called repair_level_non_time_cost.",
    "The measure adds the non-time cost of all actions associated with performing the indicated repair.",
    "The measure is limited to the resources and actions available at a particular level of indenture.",
    "Authorized licensed use is limited to Technische Universitat Kaiserslautern.",
    "The use is restricted to a download from IEEE Xplore.",
    "The download was made on August 21, 2024.",
    "The download was made at 11:55:44 UTC.",
    "Restrictions apply to the use of the standard.",
    "IEEE Std 1522-2004 is a trial-use standard.",
    "IEEE Std 1522-2004 is for testability and",
    "Copyright 2005 IEEE. All rights reserved.",
    "The repair_level_time_cost adds time cost of actions.",
    "The repair_level_time_cost is limited to resources and actions available at a particular level of indenture.",
    "The repair_level_time_cost computes repair cost given the specified level.",
    "The function repair_level_time_cost takes three parameters.",
    "The function repair_level_time_cost returns a real value.",
    "The repair_non_time_cost adds non-time cost of actions.",
    "The repair_non_time_cost is limited to resources and actions available in the required context at a particular level of indenture.",
    "The repair_non_time_cost computes repair cost given both the specified context and the specified level.",
    "The function repair_non_time_cost takes four parameters.",
    "The function repair_non_time_cost returns a real value.",
    "The repair_time_cost adds time cost of actions.",
    "The repair_time_cost is limited to resources and actions available in the required context at a particular level of indenture.",
    "The repair_time_cost computes repair cost given both the specified context and the specified level.",
    "The function repair_time_cost takes four parameters.",
    "The function repair_time_cost returns a real value.",
    "The test_context_non_time_cost adds non-time cost of actions.",
    "The test_context_non_time_cost is limited to resources and actions available in the required context.",
    "The test_context_non_time_cost computes test cost given the specified context.",
    "Authorized licensed use is limited to Technische Universitat Kaiserslautern.",
    "IEEE Std 1522-2004 is a standard.",
    "The standard is about diagnosability characteristics and metrics.",
    "The standard is copyrighted by IEEE in 2005.",
    "IEEE has all rights reserved.",
    "The standard defines a function test_context_non_time_cost.",
    "The function takes three parameters: tst, cntxt, and of_type.",
    "The function returns a real value.",
    "The cost-related measure test_context_time_cost adds time cost of actions.",
    "The cost-related measure is limited to resources and actions available in the required context.",
    "The function computes test cost given the specified context.",
    "The function is used to compute test cost.",
    "The function is used to add time cost of actions.",
    "The standard defines a function test_level_non_time_cost.",
    "The function takes three parameters: tst, lvl, and of_type.",
    "The function returns a real value.",
    "The cost-related measure test_level_non_time_cost adds non-time cost of actions.",
    "The cost-related measure is limited to resources and actions available at a particular level of indenture.",
    "The function computes test cost given the specified level.",
    "The function is used to compute test cost.",
    "The function is used to add non-time cost of actions.",
    "The standard defines a function test_level_time_cost.",
    "The function takes three parameters: tst, lvl, and of_type.",
    "The function returns a real value.",
    "The cost-related measure test_level_time_cost adds time cost of actions.",
    "The cost-related measure is limited to resources and actions available at a particular level of indenture.",
    "The function computes test cost given the specified level.",
    "The function is used to compute test cost.",
    "The function is used to add time cost of actions.",
    "The standard defines a function test_non_time_cost.",
    "The function takes three parameters: tst, cntxt, lvl, and of_type.",
    "The function returns a real value.",
    "The cost-related measure test_non_time_cost adds non-time cost of actions.",
    "The cost-related measure is limited to resources and actions available in the required context at a particular level of indenture.",
    "The function computes test cost given both the specified context and the specified level.",
    "The function is used to compute test cost.",
    "The function is used to add non-time cost of actions.",
    "The cost-related measure test_time_cost adds the time cost of all actions.",
    "The cost-related measure test_time_cost is limited to the resources and actions available in the required context.",
    "The cost-related measure test_time_cost is limited to the resources and actions available at a particular level of indenture.",
    "The cost-related measure test_time_cost computes test cost given both the specified context and the specified level.",
    "The cost-related measure test_time_cost is of type REAL.",
    "The cost-related measure test_time_cost has parameters tst, cntxt, lvl, and of_type.",
    "The cost-related measure test_time_cost is a function.",
    "The cost-related measure total_repair_non_time_cost adds the non-time cost of all actions.",
    "The cost-related measure total_repair_non_time_cost has no limits to the resources and actions available based on required level or context.",
    "The cost-related measure total_repair_non_time_cost has parameters rpr and of_type.",
    "The cost-related measure total_repair_non_time_cost is of type REAL.",
    "The cost-related measure total_repair_non_time_cost is a function.",
    "The cost-related measure total_repair_non_time_cost is associated with performing the indicated repair.",
    "Authorized licensed use is limited to Technische Universitat Kaiserslautern.",
    "Authorized licensed use is downloaded on August 21,2024 at 11:55:44 UTC from IEEE Xplore.",
    "Authorized licensed use has restrictions apply.",
    "The cost-related measure total_test_non_time_cost adds the non-time cost of all actions.",
    "The cost-related measure total_test_non_time_cost has no limits to the resources and actions available based on required level or context.",
    "The cost-related measure total_test_non_time_cost has parameters tst and of_type.",
    "The cost-related measure total_test_non_time_cost is of type REAL.",
    "The cost-related measure total_test_non_time_cost is a function.",
    "The cost-related measure total_test_non_time_cost is associated with performing the indicated test.",
    "resources are required for the test",
    "no limits to resources and actions available",
    "total test time cost is a function",
    "detection and isolation fundamentals are defined",
    "diagnostic models are subtypes of diagnostic_model entity",
    "type of model is used for detectability and isolatability",
    "diagnostic models include an instance of diagnosis entity",
    "metrics are based on detection and isolation within a diagnostic model",
    "metrics are computed based on a predefined universe of diagnoses and tests",
    "measures of isolation depend on diagnostic algorithms",
    "metrics are computed based on a predefined universe of diagnoses and tests",
    "measures of isolation depend on diagnostic algorithms",
    "documentation is provided to users of measures",
    "standard metrics and extended metrics are defined",
    "derived types represent ambiguity groups and test signatures",
    "functions are defined to support standard metrics and extended metrics",
    "derived types represent ambiguity groups and test signatures",
    "diagnosis ambiguity and repair ambiguity are defined",
    "test signatures are defined",
    "IEEE Std 1522-2004 is a trial-use standard.",
    "IEEE defines a type signature.",
    "The type signature is a set of test outcomes.",
    "The function get_leaves returns a set of diagnosis ambiguity groups.",
    "The function get_leaves takes a given step from a fault tree model.",
    "The function get_leaves returns a set of sets of diagnoses.",
    "The function get_signature returns the set of test outcomes for a diagnosis.",
    "The function get_signature takes a diagnostic model and a diagnosis.",
    "The function get_ambig_group returns a set of repair item ambiguity groups.",
    "The function get_ambig_group takes a diagnostic model, a repair item, and a level.",
    "The function get_diag_ambig_group returns a set of diagnosis ambiguity groups.",
    "The function get_diag_ambig_group takes a diagnostic model, a diagnosis, and a level.",
    "The function get_signature returns a test signature.",
    "The test signature identifies a specified diagnosis.",
    "The function get_signature takes a diagnostic model and a diagnosis.",
    "The function get_ambig_group returns a set of repair item ambiguity groups.",
    "The function get_ambig_group takes a diagnostic model, a repair item, and a level.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "The function get_diag_ambig_group returns a set of diagnosis ambiguity groups.",
    "The function get_diag_ambig_group takes a diagnostic model, a diagnosis, and a level.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "Authorized use is limited to Technische Universitat Kaiserslautern.",
    "Downloaded on August 21, 2024, at 11:55:44 UTC from IEEE Xplore.",
    "Restrictions apply.",
    "IEEE Std 1522-2004 defines diagnostic model characteristics and metrics.",
    "The function get_size_n_ambig_group returns a set of repair item ambiguity groups.",
    "Each repair item ambiguity group contains exactly n repair items.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "The function get_size_n_diag_ambig_group returns a set of diagnosis ambiguity groups.",
    "Each diagnosis ambiguity group contains exactly n diagnoses.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "The function convert_repair_to_diag_ambiguity returns the set of diagnosis ambiguity groups.",
    "The function convert_diag_to_repair_ambiguity returns the set of repair item ambiguity groups.",
    "The function get_size_n_diag_ambig_group returns a set of diagnosis ambiguity groups.",
    "Each diagnosis ambiguity group contains exactly n diagnoses.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "The function convert_repair_to_diag_ambiguity returns the set of diagnosis ambiguity groups.",
    "The function convert_diag_to_repair_ambiguity returns the set of repair item ambiguity groups.",
    "Diagnosis and repair item are defined in 5.2.2 and 5.2.7, respectively.",
    "The function convert_repair_to_diag_ambiguity returns the set of diagnosis ambiguity groups.",
    "The function convert_diag_to_repair_ambiguity returns the set of repair item ambiguity groups.",
    "Diagnosis and repair item are defined in 5.2.2 and 5.2.7, respectively.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "IEEE Std 1522-2004 is a trial-use standard.",
    "Copyright 2005 IEEE. All rights reserved.",
    "The predicate repair_item_ambiguity takes input.",
    "The predicate repair_item_ambiguity returns TRUE if the repair item exists.",
    "The predicate repair_item_ambiguity returns FALSE otherwise.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "The function repair_item_ambiguity has four parameters.",
    "The function repair_item_ambiguity returns a BOOLEAN value.",
    "The predicate diagnosis_ambiguity takes input.",
    "The predicate diagnosis_ambiguity returns TRUE if the diagnosis exists.",
    "The predicate diagnosis_ambiguity returns FALSE otherwise.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "The function diagnosis_ambiguity has four parameters.",
    "The function diagnosis_ambiguity returns a BOOLEAN value.",
    "The function single_level_detection takes input.",
    "The function single_level_detection returns a reduced set of diagnoses.",
    "The function single_level_detection finds diagnoses at a specified level.",
    "The function single_level_detection has two parameters.",
    "The function single_level_detection returns a SET OF diagnosis.",
    "The function implicated_diagnosis_set examines a diagnostic model.",
    "The function implicated_diagnosis_set returns the set of implicated diagnoses.",
    "An implicated diagnosis is a particular candidate diagnosis.",
    "The model specified must be a DIM, a FTM, or an EDIM.",
    "The function implicated_diagnosis_set has two parameters.",
    "The function implicated_diagnosis_set returns a SET OF diagnosis.",
    "IEEE published Std 1522-2004.",
    "The standard is copyrighted.",
    "The standard is owned by IEEE.",
    "The standard is reserved.",
    "The standard examines a diagnostic model.",
    "The standard returns the set of detectable failures.",
    "A detectable failure is a subtype of diagnosis.",
    "A detectable failure is implicated.",
    "The model must be a DIM, a FTM, or an EDIM.",
    "The function is detectable_failure_set.",
    "The function takes a diagnostic model as input.",
    "The function takes a level of indenture as input.",
    "The function is detectable_fault_set.",
    "The function examines a diagnostic model.",
    "The function returns the set of detectable faults.",
    "A detectable fault is a subtype of diagnosis.",
    "A detectable fault is implicated.",
    "The model must be a DIM, a FTM, or an EDIM.",
    "The function takes a diagnostic model as input.",
    "The function takes a level of indenture as input.",
    "The function is isolatable_repair_item_set.",
    "The function takes a diagnostic model as input.",
    "The function takes a level of indenture as input.",
    "The function takes a group size as input.",
    "The function takes a BOOLEAN argument as input.",
    "The function returns the set of repair item ambiguity groups.",
    "The model must be a DIM, a FTM, or an EDIM.",
    "The function is isolatable_diagnosis_set.",
    "The function takes a diagnostic model as input.",
    "The function takes a level of indenture as input.",
    "The function takes a group size as input.",
    "The function takes a BOOLEAN argument as input.",
    "The function returns the set of diagnosis ambiguity groups.",
    "The model must be a DIM, a FTM, or an EDIM.",
    "IEEE Std 1522-2004 is a trial-use standard.",
    "IEEE Std 1522-2004 is for testability and function.",
    "isolatable_diagnoses_set is a function.",
    "isolatable_diagnoses_set takes a diagnostic model as input.",
    "isolatable_diagnoses_set takes a level as input.",
    "isolatable_diagnoses_set takes a group size as input.",
    "isolatable_diagnoses_set returns a set of diagnosis ambiguity.",
    "isolatable_diagnoses_set returns a set of diagnosis ambiguity groups of size n.",
    "isolatable_diagnoses_set includes ambiguity with No Fault in the analysis if requested.",
    "isolatable_failures_set is a function.",
    "isolatable_failures_set takes a diagnostic model as input.",
    "isolatable_failures_set takes a level as input.",
    "isolatable_failures_set takes a group size as input.",
    "isolatable_failures_set returns a set of diagnosis ambiguity.",
    "isolatable_failures_set returns a set of diagnosis ambiguity groups of size n.",
    "isolatable_failures_set includes ambiguity with No Fault in the analysis if requested.",
    "isolatable_failures_set returns groups containing only diagnoses of type 'failure'.",
    "isolatable_faults_set is a function.",
    "isolatable_faults_set takes a diagnostic model as input.",
    "isolatable_faults_set takes a level as input.",
    "isolatable_faults_set takes a group size as input.",
    "isolatable_faults_set returns a set of diagnosis ambiguity.",
    "isolatable_faults_set returns a set of diagnosis ambiguity groups of size n.",
    "isolatable_faults_set includes ambiguity with No Fault in the analysis if requested.",
    "isolatable_faults_set returns groups containing only diagnoses of type 'fault'.",
    "isolatable_faults_set is a function.",
    "isolatable_faults_set takes a diagnostic model as input.",
    "isolatable_faults_set takes a level as input.",
    "isolatable_faults_set takes a group size as input.",
    "isolatable_faults_set returns a set of diagnosis ambiguity.",
    "isolatable_faults_set returns a set of diagnosis ambiguity groups of size n.",
    "isolatable_faults_set includes ambiguity with No Fault in the analysis if requested.",
    "isolatable_faults_set returns groups containing only diagnoses of type 'fault'.",
    "IEEE Std 1522-2004 is a standard.",
    "The standard is copyrighted by IEEE.",
    "The standard is about diagnostic model and metrics.",
    "The standard defines a function called fault_ambig_set.",
    "The function takes a diagnostic model, a level, and a group size as input.",
    "The function returns a set of diagnosis ambiguity groups.",
    "The function includes an option to include ambiguity with No Fault.",
    "The standard is based on IEEE Std 1232-2002.",
    "The standard is about diagnostic model and metrics.",
    "The standard defines a function called failure_ambig_set.",
    "The function takes a diagnostic model, a level, and a group size as input.",
    "The function returns a set of diagnosis ambiguity groups.",
    "The function includes an option to include ambiguity with No Fault.",
    "The standard is based on IEEE Std 1232-2002.",
    "The standard does not intend to exclude worthwhile metrics.",
    "The standard provides a series of building blocks called fundamentals.",
    "The standard provides definitions of testability and diagnosability metrics.",
    "The metrics quantify the fault detection capability of a diagnostic model.",
    "The standard provides equations for each fault detection metric.",
    "There are two detection metrics in the standard.",
    "One metric describes the fault detection capability as an unweighted percentage.",
    "The other metric uses a percentage weighted by probability of diagnosis.",
    "The standard is authorized by IEEE.",
    "The standard is restricted by IEEE Xplore.",
    "The standard is downloaded from IEEE Xplore.",
    "IEEE Std 1522-2004 is a trial-use standard for testability.",
    "Copyright 2005 IEEE. All rights reserved.",
    "Percentage of detection (PoD) is a metric.",
    "PoD is the percentage of possible diagnoses that can be detected.",
    "PoD is described by Equation (1).",
    "Equation (1) is (1) where ids is the implicated_diagnosis_set (mdl,lvl).",
    "mdl is the diagnostic model for which this metric is to be calculated.",
    "lvl is the level of the diagnostic model at which diagnoses are to be counted.",
    "Expected percentage of detection (EPoD) is a metric.",
    "EPoD is the failure probability-weighted percentage of possible diagnoses that can be detected.",
    "EPoD is described by Equation (2).",
    "Equation (2) is (2) where Di is the ith diagnosis in isld.",
    "isld is the set returned by single_level_detection(ids, lvl).",
    "ids is implicated_diagnosis_set(mdl, lvl).",
    "sld is the set returned by single_level_detection(ds, lvl).",
    "ds is diagnosis_set(mdl, lvl).",
    "mdl is the diagnostic model for which this metric is to be calculated.",
    "lvl is the level of the diagnostic model at which diagnoses are to be counted.",
    "This subclause provides definitions of testability and diagnosability metrics.",
    "There are six isolation metrics.",
    "The six isolation metrics are percentage of isolation, expected percentage of isolation, expected ambiguity group size, isolation effectiveness, projected effect of ambiguity upon false removals, and repair item involvement ratio.",
    "The first and sixth of these metrics are unweighted.",
    "The other four metrics are weighted using probability of diagnosis.",
    "Probability of diagnosis is used to weight the four metrics.",
    "Probability of diagnosis is used to weight expected percentage of isolation, expected ambiguity group size, isolation effectiveness, and projected effect of ambiguity upon false removals.",
    "PoD mdl lvl ( , ) single_level_detection ids lvl ( , ) × diagnosis_set mdl lvl ( , ) --------------------------------------------------------------------------------------------------------------------- = EPoD mdl lvl ( , ) probability_of_diagnosis Di sld ( , ) Di isld ∈ ∀∑ × =",
    "IEEE Std 1522-2004 is a standard.",
    "The standard is copyrighted by IEEE.",
    "All rights to the standard are reserved by IEEE.",
    "Percentage of isolation is a metric.",
    "Percentage of isolation consists of two individual equations.",
    "The incremental percentage of fault isolation is a metric.",
    "The cumulative percentage of isolation is a metric.",
    "The incremental percentage of isolation is described by Equation (3).",
    "The cumulative percentage of isolation is described by Equation (4).",
    "The diagnostic model is a specified model.",
    "The level of the diagnostic model is a specified level.",
    "The number of repair items is a specified number.",
    "The level of the diagnostic model is a specified level.",
    "The number of repair items is a specified number.",
    "The maximum size of an ambiguity group in the model is a specified size.",
    "Cumulative percentage of isolation is a metric.",
    "Cumulative percentage of isolation is described by Equation (4).",
    "The diagnostic model is a specified model.",
    "The level of the diagnostic model at which faults are to be counted is a specified level.",
    "The number of repair items is a specified number.",
    "The specified number of repair items is a specified number.",
    "The maximum size of an ambiguity group in the model is a specified size.",
    "The specified diagnostic model is a specified model.",
    "The specified level of the diagnostic model is a specified level.",
    "The number of repair items is a specified number.",
    "Expected percentage of isolation is a metric.",
    "Expected percentage of isolation consists of two individual equations.",
    "The incremental expected percentage of isolation is a metric.",
    "The cumulative expected percentage of isolation is a metric.",
    "The incremental expected percentage of isolation is described by Equation (5).",
    "The cumulative expected percentage of isolation is described by Equation (5).",
    "The diagnostic model is a specified model.",
    "The level of the diagnostic model is a specified level.",
    "The number of repair items is a specified number.",
    "The specified number of repair items is a specified number.",
    "The set union of RDn is a specified set.",
    "The set union of RDn is a specified set.",
    "RDn is a specified set.",
    "RAGn is a specified set.",
    "The ith diagnosis in AGn is a specified diagnosis.",
    "The probability of diagnosis is a specified probability.",
    "The set returned by single_level_detection is a specified set.",
    "The implicated diagnosis set is a specified set.",
    "The diagnostic model is a specified model.",
    "The level of the diagnostic model is a specified level.",
    "The number of repair items is a specified number.",
    "The specified number of repair items is a specified number.",
    "The size of an ambiguity group in the model is a specified size.",
    "Authorized licensed use limited to: Technische Universitat Kaiserslautern.",
    "Downloaded on August 21,2024 at 11:55:44 UTC from IEEE Xplore.",
    "Restrictions apply.",
    "IEEE Std 1522-2004 IEEE TRIAL-USE STANDARD FOR TESTABILITY AND Copyright",
    "All rights reserved.",
    "n is the specified number of repair items",
    "IEEPoI is the probability of isolating to one ambiguity group",
    "IEEPoI is the sum of the probabilities of the diagnoses associated with the repair items that caused the ambiguity",
    "IEEPoI is the sum of the probabilities of all diagnoses causing the collection of repair item ambiguity groups",
    "IEEPoI provides the probability of isolating to a repair item ambiguity group",
    "CEPoI is the probability-weighted percentage of all diagnosis ambiguity groups that can be isolated using the tests defined within that model",
    "CEPoI provides the probability of isolating to a repair item ambiguity group of size n or less",
    "CEPoI is described by Equation (6)",
    "Equation (6) is used to calculate CEPoI",
    "mdl is the diagnostic model for which this metric is to be calculated",
    "lvl is the level of the diagnostic model at which faults are to be counted",
    "n is the specified number of repair items",
    "EAGS is the failure probability-weighted average number of repair items in all repair item ambiguity groups",
    "EAGS is described by Equation (7)",
    "Equation (7) is used to calculate EAGS",
    "mdl is the diagnostic model for which this metric is to be calculated",
    "lvl is the level of the diagnostic model at which faults are to be counted",
    "n is the maximum number of repair items in an ambiguity group in the model",
    "This subclause is informative only.",
    "This subclause is not a normative part of this standard.",
    "Isolation effectiveness is a measure of how well repair item ambiguity groups can be isolated.",
    "Isolation effectiveness is a measure of how well repair item ambiguity groups conform to a specified diagnostic goal.",
    "A diagnostic goal is expressed as a lower bound/minimum.",
    "Typical diagnostic goals include the ambiguity group size or the cost/time to isolate, replace or repair ambiguity groups.",
    "The deviation of a function of x relative to the goal y is denoted by Let.",
    "The isolation effectiveness metric is used to measure the deviation of a function of x relative to the goal y.",
    "The isolation effectiveness metric is used to measure the deviation of a function of x relative to the goal y for a particular level of a given diagnostic model.",
    "The isolation effectiveness metric is used to measure the deviation of a function of x relative to the goal y for a particular level of a given diagnostic model and a specified diagnostic goal.",
    "The isolation effectiveness metric is used to measure the deviation of a function of x relative to the goal y for a particular level of a given diagnostic model and a specified diagnostic goal for a particular level of a given diagnostic model.",
    "The isolation effectiveness metric is used to measure the deviation of a function of x relative to the goal y for a particular level of a given diagnostic model and a specified diagnostic goal for a particular level of a given diagnostic model and a specified diagnostic goal.",
    "Authorized licensed use limited to: Technische Universitat Kaiserslautern.",
    "Downloaded on August 21,2024 at 11:55:44 UTC from IEEE Xplore.",
    "Restrictions apply.",
    "IEEE DIAGONOSABLITY CHARACTERISTICS AND METRICS Std 1522-2004 is a standard.",
    "Copyright 2005 IEEE. All rights reserved.",
    "The general form of the isolation effectiveness metric is described by Equation (8).",
    "Equation (8) describes the general form of the isolation effectiveness metric.",
    "AGi is the ith repair item ambiguity group goal.",
    "The goal is the goal (expressed as a lower bound/minimum) to which the calculated value for each ambiguity group is to be compared.",
    "f(AGi) is the value of the measure for AGi that is to be compared with the specified goal.",
    "P(AGi) is the probability of repair item set (AGi), i.e., the probability that AGi is isolated.",
    "mdl is the diagnostic model for which this metric is to be calculated.",
    "lvl is the level of the diagnostic model at which faults are to be counted.",
    "n is the total number of repair item ambiguity groups for the lvl and mdl.",
    "let x = AGi.",
    "f(AGi) = |AGi|.",
    "size specifies the maximum size.",
    "IEisol is the specific form of the isolation effectiveness metric.",
    "AGi is the ith repair item ambiguity group.",
    "|AGi| is the actual size of AGi.",
    "P(AGi) is the probability of repair item set AGi.",
    "mdl is the diagnostic model.",
    "lvl is the level of the diagnostic model.",
    "n is the total number of repair item ambiguity groups.",
    "n is the total number of repair item ambiguity groups for lvl and mdl.",
    "setting size = 1 will test the ability to isolate to a single repair item.",
    "isolation effectiveness can be used to identify the effect of diagnostic ambiguity on a particular maintenance goal.",
    "be the repair time associated with AGi.",
    "IERT is a variant of IE.",
    "AGi is the ith repair item ambiguity group.",
    "time is the goal specifying the maximum repair time of an ambiguity group.",
    "RT(AGi) is the actual repair time of AGi.",
    "P(AGi) is the probability of repair item set AGi.",
    "mdl is the diagnostic model.",
    "lvl is the level of the diagnostic model.",
    "n is the total number of repair item ambiguity groups for the lvl and mdl",
    "The delta function returns zero if the repair time for an ambiguity group is less than the specified goal of 60 minutes",
    "An alternative version of this metric could penalize for exceeding the goal by too much",
    "This subclause is informative only and is not a normative part of this standard",
    "Projected effect of ambiguity on false removals (PEAFR) is a measure of the effect that ambiguous isolation has on the frequency of false removals",
    "PEAFR is described by Equation (10)",
    "AGi is the ith repair item ambiguity group",
    "P(AGi) is the probability of repair item set (AGi)",
    "mdl is the diagnostic model for which this metric is to be calculated",
    "lvl is the level of the diagnostic model at which faults are to be counted",
    "n is the total number of repair item ambiguity groups for the lvl and mdl",
    "PEAFR gives the worst-case percentage of false removals because of diagnostic ambiguity for the specified level of the given diagnostic model",
    "PEAFR projects the relative likelihood of false removals when malfunctions occur",
    "The likelihood of false removals is calculated using the formula P(AGi) / (|AGi| * RT(AGi))",
    "The formula is summed over all repair item ambiguity groups",
    "IEEE Std 1522-2004 is a standard.",
    "The standard is copyrighted 2005 by IEEE.",
    "All rights to the standard are reserved by IEEE.",
    "Ambiguity groups occur singly in the standard.",
    "Repair item ambiguity groups are replaced as a block in the standard.",
    "False removals can result from factors other than ineffective fault isolation.",
    "PEAFR only quantifies the effect of diagnostic ambiguity on false removals.",
    "PEAFR is equal to 1 minus IE with respect to isolation to a single failed repair item.",
    "PEAFR can be calculated using the standard.",
    "The repair item involvement ratio (RIIR) is a metric.",
    "RIIR is the number of repair item ambiguity groups divided by the total number of ambiguity groups.",
    "RIIR is calculated for a particular level of a given diagnostic model.",
    "RIIR is described by Equation (11) in the standard.",
    "AGRI is the size of the ambiguity group.",
    "RI is the repair item for which RIIR is being calculated.",
    "mdl is the diagnostic model for which RIIR is being calculated.",
    "lvl is the level of the diagnostic model at which faults are to be counted.",
    "This subclause is informative only.",
    "This subclause is not a normative part of the standard.",
    "Fault detection and isolation metrics can be calculated over an entire design.",
    "Fault detection and isolation metrics can be calculated over an explicitly defined functional subset of the design.",
    "Typical types of subsets include functionality, technology, operational usage, and hardware source.",
    "Typical types of subsets include operating mode, test domain, and fault universe.",
    "Typical types of subsets include functionality, technology, operational usage, and hardware source.",
    "Typical types of subsets include operating mode, test domain, and fault universe.",
    "The equations defined in this clause can be used to calculate metrics for a particular functional subset.",
    "The model (mdl) must be constructed such that only the desired subset is represented.",
    "IEEE Std 1522-2004 is a trial-use standard for testability and fault detection and isolation metrics.",
    "Fault detection and isolation metrics are frequently constrained by test class to calculate the fault coverage associated with different subsets of tests within the design.",
    "Common test classes include BIT type, diagnostic usage, and test implementations.",
    "BIT type includes startup, continuous, and periodic tests.",
    "Diagnostic usage includes embedded diagnostics and technical manual tests.",
    "Test implementations include current BIT, proposed BIT, and proposed technical manual tests.",
    "When calculating metrics for a particular subset of tests within a design, equations defined in this clause can be used.",
    "The model (mdl) must be constructed such that only the desired subset is represented.",
    "Diagnosis failure probabilities are generally derived from failure rates.",
    "Failure rates describe expected rates of failure over an arbitrarily long time interval.",
    "Failure rates are most frequently expressed in terms of failures per million hours.",
    "The same metric equation can be used to calculate EPoD and EPoI over a specific time interval.",
    "The diagnosis failure probabilities used to calculate the EPoD and EPoI are generally derived from failure rates.",
    "Failure rates describe expected rates of failure over an arbitrarily long time interval.",
    "Failure rates are most frequently expressed in terms of failures per million hours.",
    "The same metric equation can be used to calculate EPoD and EPoI over a specific time interval.",
    "The model (mdl) must be constructed such that only the desired subset is represented.",
    "The diagnosis failure probabilities used to calculate the EPoD and EPoI are generally derived from failure rates.",
    "Failure rates describe expected rates of failure over an arbitrarily long time interval.",
    "Failure rates are most frequently expressed in terms of failures per million hours.",
    "The same metric equation can be used to calculate EPoD and EPoI over a specific time interval.",
    "All failure rates in the specified diagnostic model (mdl) represent the number of failures expected within the given time interval.",
    "The same metric equation can be used to calculate EPoD and EPoI over a specific time interval.",
    "The model (mdl) must be constructed such that only the desired subset is represented.",
    "IEEE published Std 1522-2004.",
    "IEEE published a standard in 2004.",
    "IEEE has copyright 2005.",
    "IEEE reserved all rights.",
    "Annex A is informative.",
    "Bibliography is provided.",
    "Proceedings of the IEEE AUTOTESTCON were published in 1999.",
    "IEEE AUTOTESTCON was held in New York.",
    "IEEE Press published the proceedings.",
    "IEEE 100 is a dictionary of IEEE standards terms.",
    "Qualtech Systems Inc. published Teams: Testability Engineering and Maintenance System Users Guide.",
    "U.S. Navy published Definitions of Terms for Test, Measurement and Diagnostic Equipment.",
    "U.S. Navy published Testability Program for Electronic Systems and Equipment.",
    "IEEE publications are available from the Institute of Electrical and Electronics Engineers.",
    "IEEE published IEEE Std 1522-2004.",
    "IEEE TRIAL-USE STANDARD FOR TESTABILITY AND was published in 2004.",
    "Copyright 2005 IEEE.",
    "All rights reserved by IEEE.",
    "Annex B is informative.",
    "The product life cycle process is related to diagnostic analysis and design.",
    "A comprehensive diagnostic analysis and design program requires a dedicated effort.",
    "The diagnostic design life cycle is organized around five phases.",
    "The five phases are: Requirements definition, Architecture design, Detailed test design, Verification and validation, and Diagnostic maturation.",
    "A brief description of each phase is provided in B.1–B.7.",
    "The first step in an effective testability program is to define a complete set of requirements.",
    "Diagnostic requirements are typically expressed in performance terms.",
    "Diagnostic requirements should express the desired outcome without directing how to achieve it.",
    "Goals are typically specified around fault detection, fault isolation, and fault isolation resolution or operational isolation.",
    "Mission reliability is a related requirement examined early in the design phase.",
    "Mission reliability is used to verify the reliability of systems that can be reconfigured, redundant, or safety-critical.",
    "Mission reliability is being applied as a measure of prognostic capability to satisfy mission requirements with a satisfactory measure of confidence.",
    "System prognostics are shown analytically to be capable of predicting some interval over which the system will operate without malfunction.",
    "System-level metrics may be specified at this time, including mean time between failure and operational availability.",
    "Derivative requirements include mean time to repair, maintenance frequency, and skill levels of repair personnel.",
    "Customer warranties may be executed on some metrics such as mean time between failure or operational availability.",
    "IEEE Std 1522-2004 is a standard.",
    "The standard is copyrighted by IEEE.",
    "The standard is about diagnostic characteristics and metrics.",
    "The standard is from 2004.",
    "The standard has a copyright notice.",
    "The standard is reserved by IEEE.",
    "The architecture design phase is in the standard.",
    "The intent in the architecture design phase is to develop a preliminary design framework.",
    "The framework allows diagnostic program requirements to be allocated in a top-down manner.",
    "The diagnostic program requirements are allocated to physical system components.",
    "A basic diagnostic subsystem architecture is laid out in the standard.",
    "The architecture is laid out in conjunction with trade studies.",
    "Subsystem requirements are allocated to individual hardware elements.",
    "The requirements are allocated to drive detailed design requirements.",
    "System-level testability models are created to support the analysis.",
    "The models are created in conjunction with a functional failure modes, effects and criticality analysis.",
    "Testability analysis is performed on the models of the design.",
    "The analysis is performed in a top-down manner.",
    "The analysis verifies that the functional/physical partitioning and diagnostic requirements allocation will satisfy the top-level requirements.",
    "The analysis uses the same metrics as identified in B.1.",
    "The analysis provides guidance for diagnostic design influence.",
    "The diagnostic design features necessary to meet testability requirements are identified and incorporated into the product design.",
    "An elementary framework for a test strategy begins to emerge during the analysis.",
    "The framework emerges during the diagnostic design influence process.",
    "The detailed test design phase is in the standard.",
    "The purpose of the detailed test design phase is to develop a detailed design solution.",
    "The solution meets all diagnostic program requirements.",
    "Detailed hardware and software designs are created in accordance with allocated system requirements.",
    "The physical design matures during the phase.",
    "The hardware aspects are reflected in the analysis models.",
    "The hardware aspects are linked to their functional elements.",
    "The basic diagnostic subsystem architecture is modified as design and support system details emerge.",
    "Diagnostic and reliability trade studies are iterated as required.",
    "The results of the modifications are reflected in the models and verified.",
    "The modifications affect cost, weight, power, MTBCF, and MTBF.",
    "The allocations of FD, FI, and FIR are adjusted as necessary.",
    "Diagnostic and reliability trade studies are iterated as required.",
    "The studies affect cost, weight, power, MTBCF, and MTBF.",
    "The allocations of FD, FI, and FIR are adjusted as necessary.",
    "The results of the modifications are reflected in the models and verified.",
    "The modifications are reflected in the analysis models.",
    "The modifications are linked to their functional elements.",
    "The basic diagnostic subsystem architecture is modified as design and support system details emerge.",
    "Diagnostic and reliability trade studies are iterated as required.",
    "The studies affect cost, weight, power, MTBCF, and MTBF.",
    "The allocations of FD, FI, and FIR are adjusted as necessary.",
    "The results of the modifications are reflected in the models and verified.",
    "The modifications are reflected in the analysis models.",
    "Preliminary test verticality is performed during this phase.",
    "Results of this analysis are comparative margins and tolerances of the tests.",
    "Preliminary test verticality includes BIT vs. ATE test consistency.",
    "Preliminary test verticality includes factory vs. field test consistency.",
    "Preliminary test verticality includes worst-case tolerance variations.",
    "Preliminary test verticality includes latent manufacturing defects.",
    "Verification and validation phase validates detailed design solution.",
    "Verification and validation phase validates compliance with specification requirements.",
    "Verification and validation phase validates achievement of diagnostic requirements on delivery.",
    "This approach uses test and demonstration to verify built-in test operations.",
    "Diagnostic support equipment and support system contributions to diagnostics are tested or demonstrated.",
    "Quantitative testability allocations and design requirements are verified through analysis and inspection methods.",
    "Validity of fault detection and fault isolation models are assessed through static fault insertion.",
    "Susceptibility to false alarms and can not duplicates is evaluated during field testing opportunities.",
    "Diagnostic software only performs its intended job in the presence of failures.",
    "Fault insertion is the only controlled opportunity for exercising embedded hardware/software design.",
    "Diagnostic software must be executed to verify tests assumed during analysis phases were implemented in software.",
    "Faults selected for insertion should be chosen based on highest failure probability.",
    "Faults selected for insertion should be chosen based on maximum amount of diagnostic software exercised.",
    "Faults selected for insertion should be chosen based on least potential damage to the unit under test.",
    "Fault insertion is accomplished by physically inserting nondestructive faults into hardware design.",
    "Faults inserted are properly detected and reported.",
    "Diagnostic software must be executed to verify tests assumed during analysis phases were implemented in software.",
    "Corrective actions for FD/FI deficiencies are to be implemented and validated.",
    "False alarms and can not duplicates are undesirable design characteristics.",
    "False alarms and can not duplicates cannot truly be predicted or systematically tested.",
    "Risk reduction activities can be performed in conjunction with other activities to mitigate the risk incurred by the possibility of false alarms and can not duplicates.",
    "Development and qualification tests exercise the hardware under simulated environmental and life conditions.",
    "Anomalies can be corrected in a “test, analyze, and fix” methodology.",
    "Specification compliance cannot truly be evaluated.",
    "Laboratory and field tests provide an opportunity to correct diagnostic anomalies.",
    "The purpose of the maturation phase is to implement a program that effectively measures actual product performance.",
    "A maturation plan must be constructed to document how data indicative of diagnostics performance will be collected, measured, evaluated, and acted on.",
    "The diagnostic design must meet the diagnostic and health management requirements.",
    "Unexpected and unplanned system-level design interactions can degrade the performance of the diagnostic design.",
    "Remedial actions must be taken when degradation results in unacceptable product performance or other cost of ownership problems.",
    "Laboratory and field tests are performed using simulated or actual interfaces.",
    "Diagnostic anomalies can be corrected in laboratory and field tests.",
    "The purpose of the maturation phase is to implement a program that effectively measures actual product performance.",
    "A maturation plan must be constructed to document how data indicative of diagnostics performance will be collected, measured, evaluated, and acted on.",
    "The diagnostic design must meet the diagnostic and health management requirements.",
    "Unexpected and unplanned system-level design interactions can degrade the performance of the diagnostic design.",
    "Remedial actions must be taken when degradation results in unacceptable product performance or other cost of ownership problems.",
    "Root cause analysis must be performed to identify potential adjustments, improvements, or refinements to diagnostic, support, or operational elements.",
    "The maturation phase begins at the conceptual design stage and continues throughout the system life cycle.",
    "A maturation plan must be constructed to document how data indicative of diagnostics performance will be collected, measured, evaluated, and acted on.",
    "The diagnostic design must meet the diagnostic and health management requirements.",
    "Unexpected and unplanned system-level design interactions can degrade the performance of the diagnostic design.",
    "Remedial actions must be taken when degradation results in unacceptable product performance or other cost of ownership problems.",
    "Root cause analysis must be performed to identify potential adjustments, improvements, or refinements to diagnostic, support, or operational elements.",
    "Authorized licensed use limited to: Technische Universitat Kaiserslautern.",
    "The diagnostic design is demonstrated to meet the diagnostic and health management requirements at the completion of the validation phase.",
    "The diagnostic design is fielded and starts to be used in an operational environment.",
    "Unexpected and unplanned system-level design interactions, operational and environmental stresses, and other influences can degrade the performance of the diagnostic design.",
    "Remedial actions must be taken when degradation results in unacceptable product performance or other cost of ownership problems.",
    "IEEE Std 1522-2004 is a standard.",
    "The standard is copyrighted by IEEE.",
    "The standard is from 2004.",
    "The standard has annex C.",
    "Annex C is normative.",
    "Annex C contains extensions to the AI-ESTATE standard.",
    "The AI-ESTATE standard is required by the probability_of_diagnosis and probability_of_repair_item_set measures.",
    "The AI-ESTATE standard is defined within IEEE Std 1232-2002.",
    "The AI-ESTATE standard allows a failure rate value to be assigned to each diagnosis.",
    "The AI-ESTATE standard is extended in annex C.",
    "The extension redefines the diagnosis entity in the common element model.",
    "The common element model is defined within IEEE Std 1232-2002.",
    "The AI-ESTATE common element model is used in the extension.",
    "The extension is for the failure rate entity.",
    "The failure rate entity is a subtype of the failure_rate entity.",
    "The failure_rate entity is in the AI-ESTATE common element model.",
    "The failure_rate entity has a subtype called EXTEND_failure_rate.",
    "EXTEND_failure_rate is an abstract entity.",
    "EXTEND_failure_rate is a subtype of the failure_rate entity.",
    "EXTEND_failure_rate contains the frequency value for the associated failure rate.",
    "EXTEND_failure_rate has two subtypes: EXTEND_weibull_failure_rate and EXTEND_exponential_failure_rate.",
    "EXTEND_failure_rate is a subtype of the failure_rate entity.",
    "EXTEND_failure_rate is in the AI-ESTATE common element model.",
    "EXTEND_failure_rate contains the frequency value for the associated failure rate.",
    "EXTEND_failure_rate has a subtype called EXTEND_weibull_failure_rate.",
    "EXTEND_weibull_failure_rate is a subtype of the EXTEND_failure_rate entity.",
    "EXTEND_weibull_failure_rate is used when the associated failure rate is the result of a Weibull distribution.",
    "EXTEND_weibull_failure_rate has two attributes: alpha and beta.",
    "IEEE Std 1522-2004 is a standard for testability and trial-use.",
    "The standard is copyrighted by IEEE.",
    "The standard is from 2005.",
    "The standard has attribute definitions.",
    "The attribute definitions are for the associated_frequency attribute.",
    "The associated_frequency attribute is used to specify the rate of failures associated with a diagnosis.",
    "The associated_frequency attribute is used over a given time span.",
    "EXTEND_weibull_failure_rate is a subtype of the EXTEND_failure_rate entity.",
    "EXTEND_weibull_failure_rate has two attributes: alpha and beta.",
    "beta is a REAL.",
    "beta is an attribute.",
    "alpha is an attribute.",
    "alpha is used to specify the alpha parameter of the Weibull distribution.",
    "beta is used to specify the beta parameter of the Weibull distribution.",
    "EXTEND_exponential_failure_rate is a subtype of EXTEND_failure_rate.",
    "EXTEND_exponential_failure_rate is used when the associated failure rate is the result of an exponential distribution.",
    "EXTEND_exponential_failure_rate is a subtype of EXTEND_failure_rate.",
    "EXTEND_exponential_failure_rate is used when the associated failure rate is the result of an exponential distribution.",
    "EXTEND_diagnosis is a subtype of diagnosis.",
    "EXTEND_diagnosis contains the failure rate for the associated diagnosis.",
    "new_rate is an attribute.",
    "new_rate is used to specify the failure rate associated with the given diagnosis."
  ],
  "created_at": "20260121_153722Z",
  "meta": {
    "mode": "chunks",
    "num_docs": 184,
    "use_batch_decomposer": true,
    "batch_size": 4,
    "num_batches": 46,
    "parallel": false,
    "max_workers": null
  }
}